#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_FaceCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Human_Male_Faces_Enum_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_FaceCustomization.AC_FaceCustomization_C
// 0x0308 (0x03C0 - 0x00B8)
class UAC_FaceCustomization_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<int32>                                 UpdateFurMaterialIndeces;                          // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       MyMIDs;                                            // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Brows;                          // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Eyes;                           // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Jaw;                            // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Mouth;                          // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Ears;                           // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Nose;                           // 0x0138(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FMaterialParameterInfo>         MaterialParamInfos_Scalp;                          // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceScalp;                                         // 0x0158(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceBrows;                                         // 0x0168(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceEyes;                                          // 0x0178(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceNose;                                          // 0x0188(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceMouth;                                         // 0x0198(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceJaw;                                           // 0x01A8(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<double>                                FaceEars;                                          // 0x01B8(0x0010)(Edit, BlueprintVisible, Interp, ExposeOnSpawn)
	TArray<class FString>                         FaceRegions;                                       // 0x01C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EHuman_Male_Faces_Enum                        FaceA;                                             // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHuman_Male_Faces_Enum                        FaceA_Prev;                                        // 0x01D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHuman_Male_Faces_Enum                        FaceB;                                             // 0x01DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHuman_Male_Faces_Enum                        FaceB_Prev;                                        // 0x01DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHuman_Male_Faces_Enum                        FaceC;                                             // 0x01DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHuman_Male_Faces_Enum                        FaceC_Prev;                                        // 0x01DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DE[0x2];                                      // 0x01DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HeadAdditiveAlpha;                                 // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bNormalizeFaceAlphas;                              // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpdateDeltaMaps;                                  // 0x01E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bUpdateBones;                                      // 0x01EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bUpdateFacialAnimation;                            // 0x01EB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bPlayFacialTestAnimation;                          // 0x01EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                FaceScalp_Prev;                                    // 0x01F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceBrows_Prev;                                    // 0x0200(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceEyes_Prev;                                     // 0x0210(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceNose_Prev;                                     // 0x0220(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceMouth_Prev;                                    // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceJaw_Prev;                                      // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                FaceEars_Prev;                                     // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EHuman_Male_Faces_Enum, class UTexture*> DeltaP_Map_Textures;                               // 0x0260(0x0050)(Edit, BlueprintVisible)
	TMap<EHuman_Male_Faces_Enum, class UTexture*> DeltaN_Map_Textures;                               // 0x02B0(0x0050)(Edit, BlueprintVisible)
	TMap<EHuman_Male_Faces_Enum, class UTexture*> Normal_Map_Textures;                               // 0x0300(0x0050)(Edit, BlueprintVisible)
	class APlayerPawnTest_C*                      As_Player_Pawn_Test;                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Dynamic_Material_Params_Scalar;                    // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Dynamic_Material_Params_Scalar_Names;              // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Dynamic_Material_Params_Vector_Names;              // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        Dynamic_Material_Params_Vector;                    // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Dynamic_Material_Params_Texture_Names;             // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture*>                       Dynamic_Material_Params_Texture;                   // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ParamsArrayWasCleared;                             // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUpdateOnTick;                                     // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ResetFaceWeights();
	void SetParamsRecursively();
	void ClearMaterialParamArrays();
	void UpdateSkinTextures();
	void ClampFaceAlphas(TArray<double>& FaceCurrent, TArray<double>& FacePrev);
	void UpdateDeltaMaps();
	void UpdateFaceRegionValues();
	void InitMaterials();
	void ReceiveBeginPlay();
	void ForceTick();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_AC_FaceCustomization(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AC_FaceCustomization_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AC_FaceCustomization_C")
	}
	static class UAC_FaceCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAC_FaceCustomization_C>();
	}
};
DUMPER7_ASSERTS_UAC_FaceCustomization_C;

}

