#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ACLPlugin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ACLPlugin_structs.hpp"


namespace SDK::Params
{

// Function ACLPlugin.AnimationCompressionLibraryDatabase.GetVisualFidelity
// 0x0010 (0x0010 - 0x0000)
struct AnimationCompressionLibraryDatabase_GetVisualFidelity final
{
public:
	class UAnimationCompressionLibraryDatabase*   DatabaseAsset;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EACLVisualFidelity                            ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimationCompressionLibraryDatabase_GetVisualFidelity;

// Function ACLPlugin.AnimationCompressionLibraryDatabase.SetVisualFidelity
// 0x0030 (0x0030 - 0x0000)
struct AnimationCompressionLibraryDatabase_SetVisualFidelity final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UAnimationCompressionLibraryDatabase*   DatabaseAsset;                                     // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EACLVisualFidelityChangeResult                Result;                                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EACLVisualFidelity                            VisualFidelity;                                    // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimationCompressionLibraryDatabase_SetVisualFidelity;

}

