#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorSequence

#include "Basic.hpp"

#include "ActorSequence_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ActorSequence.ActorSequence
// 0x0028 (0x0090 - 0x0068)
class UActorSequence final : public UMovieSceneSequence
{
public:
	class UMovieScene*                            MovieScene;                                        // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	struct FActorSequenceObjectReferenceMap       ObjectReferences;                                  // 0x0070(0x0020)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorSequence")
	}
	static class UActorSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorSequence>();
	}
};
DUMPER7_ASSERTS_UActorSequence;

// Class ActorSequence.ActorSequenceComponent
// 0x0038 (0x00F0 - 0x00B8)
class UActorSequenceComponent final : public UActorComponent
{
public:
	struct FMovieSceneSequencePlaybackSettings    PlaybackSettings;                                  // 0x00B8(0x0028)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UActorSequence*                         Sequence;                                          // 0x00E0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UActorSequencePlayer*                   SequencePlayer;                                    // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	void PauseSequence();
	void PlaySequence();
	void StopSequence();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorSequenceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorSequenceComponent")
	}
	static class UActorSequenceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorSequenceComponent>();
	}
};
DUMPER7_ASSERTS_UActorSequenceComponent;

// Class ActorSequence.ActorSequencePlayer
// 0x0000 (0x0480 - 0x0480)
class UActorSequencePlayer final : public UMovieSceneSequencePlayer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorSequencePlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorSequencePlayer")
	}
	static class UActorSequencePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorSequencePlayer>();
	}
};
DUMPER7_ASSERTS_UActorSequencePlayer;

}

