#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ASAUI_NewsCarousel_Half

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ASAUI_NewsCarousel_Half.ASAUI_NewsCarousel_Half_C.DoClickAction
// 0x0020 (0x0020 - 0x0000)
struct ASAUI_NewsCarousel_Half_C_DoClickAction final
{
public:
	class FString                                 ActionKey;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ActionValue;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ASAUI_NewsCarousel_Half_C_DoClickAction;

// Function ASAUI_NewsCarousel_Half.ASAUI_NewsCarousel_Half_C.ExecuteUbergraph_ASAUI_NewsCarousel_Half
// 0x0048 (0x0048 - 0x0000)
struct ASAUI_NewsCarousel_Half_C_ExecuteUbergraph_ASAUI_NewsCarousel_Half final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_ActionKey;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_ActionValue;                          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_StringToInt64_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ASAUI_NewsCarousel_Half_C_ExecuteUbergraph_ASAUI_NewsCarousel_Half;

// Function ASAUI_NewsCarousel_Half.ASAUI_NewsCarousel_Half_C.GetColorAndOpacity
// 0x0010 (0x0010 - 0x0000)
struct ASAUI_NewsCarousel_Half_C_GetColorAndOpacity final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ASAUI_NewsCarousel_Half_C_GetColorAndOpacity;

// Function ASAUI_NewsCarousel_Half.ASAUI_NewsCarousel_Half_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ASAUI_NewsCarousel_Half_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ASAUI_NewsCarousel_Half_C_PreConstruct;

}

