#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ASAUI_NewsCarouselTemplate_Entry_CTA_Half

#include "Basic.hpp"


namespace SDK::Params
{

// Function ASAUI_NewsCarouselTemplate_Entry_CTA_Half.ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C.ExecuteUbergraph_ASAUI_NewsCarouselTemplate_Entry_CTA_Half
// 0x0028 (0x0028 - 0x0000)
struct ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C_ExecuteUbergraph_ASAUI_NewsCarouselTemplate_Entry_CTA_Half final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_RawExtraData;                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstigatedByAutoRollover_1;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstigatedByAutoRollover;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsHighlighted;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C_ExecuteUbergraph_ASAUI_NewsCarouselTemplate_Entry_CTA_Half;

// Function ASAUI_NewsCarouselTemplate_Entry_CTA_Half.ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C.EntryFocusTick
// 0x0008 (0x0008 - 0x0000)
struct ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C_EntryFocusTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHighlighted;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C_EntryFocusTick;

// Function ASAUI_NewsCarouselTemplate_Entry_CTA_Half.ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C.EntryFocusStart
// 0x0001 (0x0001 - 0x0000)
struct ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C_EntryFocusStart final
{
public:
	bool                                          bInstigatedByAutoRollover;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C_EntryFocusStart;

// Function ASAUI_NewsCarouselTemplate_Entry_CTA_Half.ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C.EntryFocusEnd
// 0x0001 (0x0001 - 0x0000)
struct ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C_EntryFocusEnd final
{
public:
	bool                                          bInstigatedByAutoRollover;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C_EntryFocusEnd;

// Function ASAUI_NewsCarouselTemplate_Entry_CTA_Half.ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C.BlueprintInit
// 0x0010 (0x0010 - 0x0000)
struct ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C_BlueprintInit final
{
public:
	class FString                                 RawExtraData;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ASAUI_NewsCarouselTemplate_Entry_CTA_Half_C_BlueprintInit;

}

