#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AttackTarget_SRV

#include "Basic.hpp"


namespace SDK::Params
{

// Function AttackTarget_SRV.AttackTarget_SRV_C.ExecuteUbergraph_AttackTarget_SRV
// 0x0018 (0x0018 - 0x0000)
struct AttackTarget_SRV_C_ExecuteUbergraph_AttackTarget_SRV final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OwnerActor_1;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AttackTarget_SRV_C_ExecuteUbergraph_AttackTarget_SRV;

// Function AttackTarget_SRV.AttackTarget_SRV_C.ReceiveActivation
// 0x0008 (0x0008 - 0x0000)
struct AttackTarget_SRV_C_ReceiveActivation final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AttackTarget_SRV_C_ReceiveActivation;

// Function AttackTarget_SRV.AttackTarget_SRV_C.ReceiveDeactivation
// 0x0008 (0x0008 - 0x0000)
struct AttackTarget_SRV_C_ReceiveDeactivation final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AttackTarget_SRV_C_ReceiveDeactivation;

}

