#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseHumanAnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ControlRig_structs.hpp"
#include "BaseHumanAnimBP_structs.hpp"
#include "ShooterGame_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_CardinalDirection4_structs.hpp"
#include "AnimStruct_CardinalDirection4_structs.hpp"
#include "AnimStruct_CardinalDirection2_structs.hpp"
#include "Foot_Locking_IK_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BaseHumanAnimBP.BaseHumanAnimBP_C
// 0x1D8B0 (0x1DC70 - 0x03C0)
class UBaseHumanAnimBP_C : public UAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct BaseHumanAnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;              // 0x03C8(0x0598)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0960(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0968(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0970(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_BlendSpaceGraph;            // 0x0A18(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0A20(0x0008)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_140;                 // 0x0A28(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_6;                    // 0x0A70(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x0AB8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x0B00(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x0B48(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0B90(0x01A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x0D30(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x0D50(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_282;                   // 0x0D70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_281;                   // 0x0D98(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_83;                   // 0x0DC0(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_11;                    // 0x0E40(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_139;                 // 0x0F08(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_82;                   // 0x0F50(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x0FD0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_280;                   // 0x1018(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_279;                   // 0x1040(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_138;                 // 0x1068(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_278;                   // 0x10B0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_137;                 // 0x10D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x1120(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_7;          // 0x1168(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x1280(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_136;                 // 0x12C8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_10;                    // 0x1310(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x13D8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_135;                 // 0x1420(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_81;                   // 0x1468(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_277;                   // 0x14E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_276;                   // 0x1510(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_80;                   // 0x1538(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_275;                   // 0x15B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_274;                   // 0x15E0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_37;                             // 0x1608(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_84;                 // 0x1650(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x1738(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_134;                 // 0x1780(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x17C8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_133;                 // 0x1810(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_79;                   // 0x1858(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_273;                   // 0x18D8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_83;                 // 0x1900(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_272;                   // 0x19E8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_78;                   // 0x1A10(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_271;                   // 0x1A90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_270;                   // 0x1AB8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_132;                 // 0x1AE0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_82;                 // 0x1B28(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_269;                   // 0x1C10(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x1C38(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_131;                 // 0x1C80(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_130;                 // 0x1CC8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_129;                 // 0x1D10(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_128;                 // 0x1D58(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_268;                   // 0x1DA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_267;                   // 0x1DC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_266;                   // 0x1DF0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_81;                 // 0x1E18(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_265;                   // 0x1F00(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_6;          // 0x1F28(0x0118)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_127;                 // 0x2040(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_9;                     // 0x2088(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_126;                 // 0x2150(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_77;                   // 0x2198(0x0080)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0x2218(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x2288(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_125;                 // 0x22F8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_124;                 // 0x2340(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_264;                   // 0x2388(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_263;                   // 0x23B0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_262;                   // 0x23D8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_80;                 // 0x2400(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_123;                 // 0x24E8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x2530(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_36;                             // 0x2578(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_79;                 // 0x25C0(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_122;                 // 0x26A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_261;                   // 0x26F0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x2718(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_121;                 // 0x2788(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_5;                    // 0x27D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x2818(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x2860(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_120;                 // 0x28A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_260;                   // 0x28F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_259;                   // 0x2918(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_258;                   // 0x2940(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_78;                 // 0x2968(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x2A50(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_119;                 // 0x2A98(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_257;                   // 0x2AE0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_76;                   // 0x2B08(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_118;                 // 0x2B88(0x0048)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x2BD0(0x0550)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_117;                 // 0x3120(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_35;                             // 0x3168(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x31B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x31F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x3240(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x3288(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x32D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x32F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x3320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x3348(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x3370(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_256;                   // 0x3398(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x33C0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_116;                 // 0x33E0(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_80;                // 0x3428(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_255;                   // 0x3468(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_77;                 // 0x3490(0x00E8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_16;           // 0x3578(0x00D0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_79;                // 0x3648(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_78;                // 0x3688(0x0040)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_11;              // 0x36C8(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_254;                   // 0x3700(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_77;                // 0x3728(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x3768(0x0020)()
	uint8                                         Pad_3788[0x8];                                     // 0x3788(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x3790(0x01A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x3930(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x3958(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x3980(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x39A8(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_13;                       // 0x39D0(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_115;                 // 0x3EB0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x3EF8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x3F40(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x3F88(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_12;                       // 0x3FA8(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_114;                 // 0x4488(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x44D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x4518(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x4560(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_11;                       // 0x4580(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x4A60(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_113;                 // 0x4AA8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x4AF0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x4B38(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x4B58(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_112;                 // 0x4BA0(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_10;                       // 0x4BE8(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x50C8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_111;                 // 0x5110(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x5158(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_110;                 // 0x51A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x51E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x5230(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x5250(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_76;                // 0x5318(0x0040)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_4;            // 0x5358(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_75;                // 0x5378(0x0040)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_3;            // 0x53B8(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_74;                // 0x53D8(0x0040)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_2;            // 0x5418(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_73;                // 0x5438(0x0040)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_1;            // 0x5478(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_72;                // 0x5498(0x0040)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult;              // 0x54D8(0x0020)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph;                     // 0x54F8(0x0068)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_15;           // 0x5560(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_253;                   // 0x5630(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x5658(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_76;                 // 0x5678(0x00E8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x5760(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x5780(0x01A0)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_9;                        // 0x5920(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x5E00(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x5E20(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_109;                 // 0x5EE8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_75;                   // 0x5F30(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_74;                   // 0x5FB0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_252;                   // 0x6030(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x6058(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_108;                 // 0x6110(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_73;                   // 0x6158(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_251;                   // 0x61D8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x6200(0x01A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_34;                             // 0x63A0(0x0048)()
	uint8                                         Pad_63E8[0x8];                                     // 0x63E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x63F0(0x01A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x6590(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_5;          // 0x65B0(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_250;                   // 0x66C8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x66F0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_249;                   // 0x6710(0x0028)()
	uint8                                         Pad_6738[0x8];                                     // 0x6738(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x6740(0x01A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x68E0(0x01A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_107;                 // 0x6A80(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x6AC8(0x0020)()
	uint8                                         Pad_6AE8[0x8];                                     // 0x6AE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x6AF0(0x01A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_72;                   // 0x6C90(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_106;                 // 0x6D10(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x6D58(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_75;                 // 0x6DA0(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_33;                             // 0x6E88(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_105;                 // 0x6ED0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_32;                             // 0x6F18(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_248;                   // 0x6F60(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_247;                   // 0x6F88(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_104;                 // 0x6FB0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_103;                 // 0x6FF8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_246;                   // 0x7040(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_71;                // 0x7068(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_102;                 // 0x70A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_245;                   // 0x70F0(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_4;          // 0x7118(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_244;                   // 0x7230(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_101;                 // 0x7258(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_31;                             // 0x72A0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_30;                             // 0x72E8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_71;                   // 0x7330(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_100;                 // 0x73B0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_243;                   // 0x73F8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_29;                             // 0x7420(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_242;                   // 0x7468(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_99;                  // 0x7490(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_74;                 // 0x74D8(0x00E8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_14;           // 0x75C0(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_241;                   // 0x7690(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_31;                      // 0x76B8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_240;                   // 0x7780(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_70;                   // 0x77A8(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_28;                             // 0x7828(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_30;                      // 0x7870(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_239;                   // 0x7938(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_73;                 // 0x7960(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_29;                      // 0x7A48(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_238;                   // 0x7B10(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_72;                 // 0x7B38(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_28;                      // 0x7C20(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_237;                   // 0x7CE8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_71;                 // 0x7D10(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_27;                      // 0x7DF8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_236;                   // 0x7EC0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_235;                   // 0x7EE8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_8;                     // 0x7F10(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_26;                      // 0x7FD8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_234;                   // 0x80A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_233;                   // 0x80C8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_7;                     // 0x80F0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_69;                   // 0x81B8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_232;                   // 0x8238(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_231;                   // 0x8260(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_68;                   // 0x8288(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_230;                   // 0x8308(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_229;                   // 0x8330(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_228;                   // 0x8358(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_13;           // 0x8380(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_227;                   // 0x8450(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_12;           // 0x8478(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_67;                   // 0x8548(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_226;                   // 0x85C8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_98;                  // 0x85F0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_66;                   // 0x8638(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_225;                   // 0x86B8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_70;                 // 0x86E0(0x00E8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_69;                 // 0x87C8(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_65;                   // 0x88B0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_224;                   // 0x8930(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_64;                   // 0x8958(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_68;                 // 0x89D8(0x00E8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_67;                 // 0x8AC0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_223;                   // 0x8BA8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_63;                   // 0x8BD0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_222;                   // 0x8C50(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_66;                 // 0x8C78(0x00E8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_65;                 // 0x8D60(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_97;                  // 0x8E48(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_64;                 // 0x8E90(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_221;                   // 0x8F78(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_63;                 // 0x8FA0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_220;                   // 0x9088(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_62;                   // 0x90B0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_219;                   // 0x9130(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_218;                   // 0x9158(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_61;                   // 0x9180(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_217;                   // 0x9200(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_216;                   // 0x9228(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_215;                   // 0x9250(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x9278(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_62;                 // 0x9340(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x9428(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_96;                  // 0x9470(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_60;                   // 0x94B8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_214;                   // 0x9538(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_61;                 // 0x9560(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x9648(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_95;                  // 0x9690(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_60;                 // 0x96D8(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x97C0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_94;                  // 0x9808(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_213;                   // 0x9850(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_212;                   // 0x9878(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x98A0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_211;                   // 0x98E8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_27;                             // 0x9910(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_93;                  // 0x9958(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_59;                   // 0x99A0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_92;                  // 0x9A20(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_210;                   // 0x9A68(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_209;                   // 0x9A90(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_58;                   // 0x9AB8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_208;                   // 0x9B38(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_25;                      // 0x9B60(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_207;                   // 0x9C28(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_24;                      // 0x9C50(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_59;                 // 0x9D18(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_206;                   // 0x9E00(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_58;                 // 0x9E28(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_205;                   // 0x9F10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_204;                   // 0x9F38(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_57;                 // 0x9F60(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_203;                   // 0xA048(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_56;                 // 0xA070(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_202;                   // 0xA158(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_55;                 // 0xA180(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_201;                   // 0xA268(0x0028)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_10;              // 0xA290(0x0038)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_57;                   // 0xA2C8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_200;                   // 0xA348(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_199;                   // 0xA370(0x0028)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_9;               // 0xA398(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_198;                   // 0xA3D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_197;                   // 0xA3F8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_54;                 // 0xA420(0x00E8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_11;           // 0xA508(0x00D0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_23;                      // 0xA5D8(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0xA6A0(0x01A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0xA840(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_56;                   // 0xA888(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_196;                   // 0xA908(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_195;                   // 0xA930(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_194;                   // 0xA958(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_193;                   // 0xA980(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_22;                      // 0xA9A8(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_53;                 // 0xAA70(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_21;                      // 0xAB58(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_52;                 // 0xAC20(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_20;                      // 0xAD08(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_51;                 // 0xADD0(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_19;                      // 0xAEB8(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0xAF80(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_18;                      // 0xB048(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0xB110(0x00C8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_10;           // 0xB1D8(0x00D0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_9;            // 0xB2A8(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_192;                   // 0xB378(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_91;                  // 0xB3A0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_90;                  // 0xB3E8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_70;                // 0xB430(0x0040)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_17;                      // 0xB470(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_16;                      // 0xB538(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_50;                 // 0xB600(0x00E8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_49;                 // 0xB6E8(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_89;                  // 0xB7D0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_48;                 // 0xB818(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_88;                  // 0xB900(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_69;                // 0xB948(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0xB988(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_87;                  // 0xBA50(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_68;                // 0xBA98(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_86;                  // 0xBAD8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_67;                // 0xBB20(0x0040)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator;                 // 0xBB60(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_55;                   // 0xBBD8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_191;                   // 0xBC58(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_66;                // 0xBC80(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_85;                  // 0xBCC0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_84;                  // 0xBD08(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_65;                // 0xBD50(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_64;                // 0xBD90(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_83;                  // 0xBDD0(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_63;                // 0xBE18(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0xBE58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0xBE80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0xBEA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0xBED0(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_62;                // 0xBEF8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_61;                // 0xBF38(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_82;                  // 0xBF78(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0xBFC0(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_60;                // 0xBFE0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_59;                // 0xC020(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_81;                  // 0xC060(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0xC0A8(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_58;                // 0xC0C8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_57;                // 0xC108(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_80;                  // 0xC148(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0xC190(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_56;                // 0xC1B0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_55;                // 0xC1F0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_54;                // 0xC230(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_79;                  // 0xC270(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_78;                  // 0xC2B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0xC300(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0xC320(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_53;                // 0xC3E8(0x0040)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_54;                   // 0xC428(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_52;                // 0xC4A8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_51;                // 0xC4E8(0x0040)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_53;                   // 0xC528(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_190;                   // 0xC5A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_189;                   // 0xC5D0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_77;                  // 0xC5F8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_76;                  // 0xC640(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_50;                // 0xC688(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_49;                // 0xC6C8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_75;                  // 0xC708(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_48;                // 0xC750(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_74;                  // 0xC790(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_47;                // 0xC7D8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_73;                  // 0xC818(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_46;                // 0xC860(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_188;                   // 0xC8A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_187;                   // 0xC8C8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_186;                   // 0xC8F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_185;                   // 0xC918(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_184;                   // 0xC940(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_183;                   // 0xC968(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_52;                   // 0xC990(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_51;                   // 0xCA10(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_50;                   // 0xCA90(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_182;                   // 0xCB10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_181;                   // 0xCB38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_180;                   // 0xCB60(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_179;                   // 0xCB88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_178;                   // 0xCBB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_177;                   // 0xCBD8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_72;                  // 0xCC00(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_176;                   // 0xCC48(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_49;                   // 0xCC70(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_48;                   // 0xCCF0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_175;                   // 0xCD70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_174;                   // 0xCD98(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_173;                   // 0xCDC0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_172;                   // 0xCDE8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_171;                   // 0xCE10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_170;                   // 0xCE38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_169;                   // 0xCE60(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_168;                   // 0xCE88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_167;                   // 0xCEB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_166;                   // 0xCED8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_165;                   // 0xCF00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_164;                   // 0xCF28(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_71;                  // 0xCF50(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_47;                   // 0xCF98(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_46;                   // 0xD018(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_45;                   // 0xD098(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_44;                   // 0xD118(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_43;                   // 0xD198(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_42;                   // 0xD218(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_163;                   // 0xD298(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_162;                   // 0xD2C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_161;                   // 0xD2E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_160;                   // 0xD310(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_159;                   // 0xD338(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_158;                   // 0xD360(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_41;                   // 0xD388(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_157;                   // 0xD408(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_156;                   // 0xD430(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_155;                   // 0xD458(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_154;                   // 0xD480(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_40;                   // 0xD4A8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_153;                   // 0xD528(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_152;                   // 0xD550(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_151;                   // 0xD578(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_150;                   // 0xD5A0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_70;                  // 0xD5C8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_47;                 // 0xD610(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_39;                   // 0xD6F8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_149;                   // 0xD778(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_148;                   // 0xD7A0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_69;                  // 0xD7C8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_147;                   // 0xD810(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_8;                        // 0xD838(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_26;                             // 0xDD18(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_25;                             // 0xDD60(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_68;                  // 0xDDA8(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_7;                        // 0xDDF0(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_3;          // 0xE2D0(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_38;                   // 0xE3E8(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_15;                      // 0xE468(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_146;                   // 0xE530(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_145;                   // 0xE558(0x0028)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_8;               // 0xE580(0x0038)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_67;                  // 0xE5B8(0x0048)()
