#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseHumanAnimBP

#include "Basic.hpp"

#include "AnimStruct_CardinalDirection4_structs.hpp"
#include "BaseHumanAnimBP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ShooterGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_CardinalDirection4_structs.hpp"
#include "ControlRig_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "Foot_Locking_IK_structs.hpp"
#include "AnimStruct_CardinalDirection2_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BaseHumanAnimBP.BaseHumanAnimBP_C
// 0x1DCE0 (0x1E0A0 - 0x03C0)
class UBaseHumanAnimBP_C : public UAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct BaseHumanAnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;              // 0x03C8(0x05F0)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x09B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x09C0(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x09C8(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_BlendSpaceGraph;            // 0x0A70(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0A78(0x0008)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x0A80(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x0AC8(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0B10(0x01A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x0CB0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x0CD0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x0CF0(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_86;                // 0x0D38(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_282;                   // 0x0D78(0x0028)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_6;                    // 0x0DA0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_11;                    // 0x0DE8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_145;                 // 0x0EB0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_83;                   // 0x0EF8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x0F78(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_281;                   // 0x0FC0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_280;                   // 0x0FE8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_144;                 // 0x1010(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_279;                   // 0x1058(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_143;                 // 0x1080(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x10C8(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_7;          // 0x1110(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x1228(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_142;                 // 0x1270(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_85;                // 0x12B8(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_10;                    // 0x12F8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x13C0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_141;                 // 0x1408(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_82;                   // 0x1450(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_278;                   // 0x14D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_277;                   // 0x14F8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_81;                   // 0x1520(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_276;                   // 0x15A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_275;                   // 0x15C8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_37;                             // 0x15F0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_84;                 // 0x1638(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_140;                 // 0x1720(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_139;                 // 0x1768(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x17B0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_138;                 // 0x17F8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_80;                   // 0x1840(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_274;                   // 0x18C0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_83;                 // 0x18E8(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_273;                   // 0x19D0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_79;                   // 0x19F8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_272;                   // 0x1A78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_271;                   // 0x1AA0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_137;                 // 0x1AC8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_82;                 // 0x1B10(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_270;                   // 0x1BF8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x1C20(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_136;                 // 0x1C68(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_135;                 // 0x1CB0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_134;                 // 0x1CF8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_269;                   // 0x1D40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_268;                   // 0x1D68(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_267;                   // 0x1D90(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_81;                 // 0x1DB8(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_133;                 // 0x1EA0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_266;                   // 0x1EE8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_265;                   // 0x1F10(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0x1F38(0x0070)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_16;           // 0x1FA8(0x00D0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_9;                     // 0x2078(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_132;                 // 0x2140(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_78;                   // 0x2188(0x0080)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x2208(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x2278(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_131;                 // 0x22E8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_130;                 // 0x2330(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_264;                   // 0x2378(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_263;                   // 0x23A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_262;                   // 0x23C8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_80;                 // 0x23F0(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_129;                 // 0x24D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x2520(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_36;                             // 0x2568(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_79;                 // 0x25B0(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_128;                 // 0x2698(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_261;                   // 0x26E0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x2708(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_127;                 // 0x2778(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_5;                    // 0x27C0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x2808(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x2850(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_126;                 // 0x2898(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_260;                   // 0x28E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_259;                   // 0x2908(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_258;                   // 0x2930(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_78;                 // 0x2958(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_77;                   // 0x2A40(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_257;                   // 0x2AC0(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_6;          // 0x2AE8(0x0118)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_125;                 // 0x2C00(0x0048)()
	uint8                                         Pad_2C48[0x8];                                     // 0x2C48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x2C50(0x0550)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_256;                   // 0x31A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_255;                   // 0x31C8(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_5;          // 0x31F0(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_76;                   // 0x3308(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_124;                 // 0x3388(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_123;                 // 0x33D0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x3418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x3440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x3468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x3490(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x34B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_254;                   // 0x34E0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x3508(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_84;                // 0x3528(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_83;                // 0x3568(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_122;                 // 0x35A8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_121;                 // 0x35F0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_253;                   // 0x3638(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_77;                 // 0x3660(0x00E8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_15;           // 0x3748(0x00D0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_82;                // 0x3818(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_81;                // 0x3858(0x0040)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_11;              // 0x3898(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_252;                   // 0x38D0(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_80;                // 0x38F8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x3938(0x0020)()
	uint8                                         Pad_3958[0x8];                                     // 0x3958(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x3960(0x01A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x3B00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x3B28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x3B50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x3B78(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_13;                       // 0x3BA0(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_120;                 // 0x4080(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x40C8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x4110(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x4158(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_12;                       // 0x4178(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_119;                 // 0x4658(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x46A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x46E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x4730(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_11;                       // 0x4750(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x4C30(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_118;                 // 0x4C78(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x4CC0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x4D08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x4D28(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_117;                 // 0x4D70(0x0048)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_10;                       // 0x4DB8(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x5298(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_116;                 // 0x52E0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x5328(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_115;                 // 0x5370(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x53B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x5400(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x5420(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_79;                // 0x54E8(0x0040)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_4;            // 0x5528(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_78;                // 0x5548(0x0040)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_3;            // 0x5588(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_77;                // 0x55A8(0x0040)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_2;            // 0x55E8(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_76;                // 0x5608(0x0040)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_1;            // 0x5648(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_75;                // 0x5668(0x0040)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult;              // 0x56A8(0x0020)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph;                     // 0x56C8(0x0068)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_14;           // 0x5730(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_251;                   // 0x5800(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x5828(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_76;                 // 0x5848(0x00E8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x5930(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x5950(0x01A0)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_9;                        // 0x5AF0(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x5FD0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x5FF0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_75;                   // 0x60B8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_74;                   // 0x6138(0x0080)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x61B8(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_114;                 // 0x6270(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_73;                   // 0x62B8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_250;                   // 0x6338(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_113;                 // 0x6360(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_35;                             // 0x63A8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_34;                             // 0x63F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x6438(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x6480(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_249;                   // 0x64C8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x64F0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_248;                   // 0x6510(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x6538(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x6580(0x01A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_112;                 // 0x6720(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_111;                 // 0x6768(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x67B0(0x01A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x6950(0x01A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x6AF0(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x6B38(0x0020)()
	uint8                                         Pad_6B58[0x8];                                     // 0x6B58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x6B60(0x01A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_110;                 // 0x6D00(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x6D48(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_75;                 // 0x6D90(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_33;                             // 0x6E78(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_109;                 // 0x6EC0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_32;                             // 0x6F08(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_247;                   // 0x6F50(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_246;                   // 0x6F78(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_108;                 // 0x6FA0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_245;                   // 0x6FE8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x7010(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_107;                 // 0x7058(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_244;                   // 0x70A0(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_4;          // 0x70C8(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_243;                   // 0x71E0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_106;                 // 0x7208(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_105;                 // 0x7250(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_31;                             // 0x7298(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_30;                             // 0x72E0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_72;                   // 0x7328(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_104;                 // 0x73A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_242;                   // 0x73F0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_29;                             // 0x7418(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_241;                   // 0x7460(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_103;                 // 0x7488(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_74;                 // 0x74D0(0x00E8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_13;           // 0x75B8(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_240;                   // 0x7688(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_31;                      // 0x76B0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_239;                   // 0x7778(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_71;                   // 0x77A0(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_28;                             // 0x7820(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_30;                      // 0x7868(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_238;                   // 0x7930(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_73;                 // 0x7958(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_29;                      // 0x7A40(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_237;                   // 0x7B08(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_72;                 // 0x7B30(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_28;                      // 0x7C18(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_236;                   // 0x7CE0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_71;                 // 0x7D08(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_27;                      // 0x7DF0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_235;                   // 0x7EB8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_234;                   // 0x7EE0(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_8;                     // 0x7F08(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_26;                      // 0x7FD0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_233;                   // 0x8098(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_232;                   // 0x80C0(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_7;                     // 0x80E8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_70;                   // 0x81B0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_231;                   // 0x8230(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_230;                   // 0x8258(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_69;                   // 0x8280(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_229;                   // 0x8300(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_228;                   // 0x8328(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_227;                   // 0x8350(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_12;           // 0x8378(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_226;                   // 0x8448(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_11;           // 0x8470(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_68;                   // 0x8540(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_225;                   // 0x85C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_224;                   // 0x85E8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_67;                   // 0x8610(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_223;                   // 0x8690(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_3;          // 0x86B8(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_66;                   // 0x87D0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_222;                   // 0x8850(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_65;                   // 0x8878(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_102;                 // 0x88F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_221;                   // 0x8940(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_64;                   // 0x8968(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_220;                   // 0x89E8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_101;                 // 0x8A10(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_70;                 // 0x8A58(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_219;                   // 0x8B40(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_69;                 // 0x8B68(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_218;                   // 0x8C50(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_63;                   // 0x8C78(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_217;                   // 0x8CF8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_216;                   // 0x8D20(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_62;                   // 0x8D48(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_215;                   // 0x8DC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_214;                   // 0x8DF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_213;                   // 0x8E18(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x8E40(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_68;                 // 0x8F08(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x8FF0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_100;                 // 0x9038(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_61;                   // 0x9080(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_212;                   // 0x9100(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_67;                 // 0x9128(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x9210(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_99;                  // 0x9258(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_66;                 // 0x92A0(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x9388(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_98;                  // 0x93D0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_211;                   // 0x9418(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_210;                   // 0x9440(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x9468(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_209;                   // 0x94B0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_27;                             // 0x94D8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_97;                  // 0x9520(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_60;                   // 0x9568(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_96;                  // 0x95E8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_208;                   // 0x9630(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_207;                   // 0x9658(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_59;                   // 0x9680(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_206;                   // 0x9700(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_25;                      // 0x9728(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_205;                   // 0x97F0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_24;                      // 0x9818(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_65;                 // 0x98E0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_204;                   // 0x99C8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_64;                 // 0x99F0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_203;                   // 0x9AD8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_202;                   // 0x9B00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_201;                   // 0x9B28(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_63;                 // 0x9B50(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_200;                   // 0x9C38(0x0028)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_10;              // 0x9C60(0x0038)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_58;                   // 0x9C98(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_199;                   // 0x9D18(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_198;                   // 0x9D40(0x0028)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_9;               // 0x9D68(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_197;                   // 0x9DA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_196;                   // 0x9DC8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_62;                 // 0x9DF0(0x00E8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_10;           // 0x9ED8(0x00D0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_23;                      // 0x9FA8(0x00C8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0xA070(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_57;                   // 0xA0B8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_195;                   // 0xA138(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_194;                   // 0xA160(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_193;                   // 0xA188(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_192;                   // 0xA1B0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_22;                      // 0xA1D8(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_61;                 // 0xA2A0(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_21;                      // 0xA388(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_60;                 // 0xA450(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_20;                      // 0xA538(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_59;                 // 0xA600(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_19;                      // 0xA6E8(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0xA7B0(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_18;                      // 0xA878(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0xA940(0x00C8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_9;            // 0xAA08(0x00D0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_8;            // 0xAAD8(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_191;                   // 0xABA8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_95;                  // 0xABD0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0xAC18(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_94;                  // 0xAC60(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_74;                // 0xACA8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_93;                  // 0xACE8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_58;                 // 0xAD30(0x00E8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_57;                 // 0xAE18(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_92;                  // 0xAF00(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_56;                 // 0xAF48(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_91;                  // 0xB030(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_73;                // 0xB078(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0xB0B8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_90;                  // 0xB180(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_72;                // 0xB1C8(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_89;                  // 0xB208(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_71;                // 0xB250(0x0040)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator;                 // 0xB290(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_56;                   // 0xB308(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_190;                   // 0xB388(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_55;                 // 0xB3B0(0x00E8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_54;                 // 0xB498(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_88;                  // 0xB580(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0xB5C8(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_53;                 // 0xB5E8(0x00E8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_52;                 // 0xB6D0(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_87;                  // 0xB7B8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_70;                // 0xB800(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0xB840(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0xB868(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0xB890(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0xB8B8(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_69;                // 0xB8E0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_68;                // 0xB920(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_86;                  // 0xB960(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0xB9A8(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_67;                // 0xB9C8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_66;                // 0xBA08(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_85;                  // 0xBA48(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0xBA90(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_65;                // 0xBAB0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_64;                // 0xBAF0(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_84;                  // 0xBB30(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0xBB78(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_63;                // 0xBB98(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_62;                // 0xBBD8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_61;                // 0xBC18(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_83;                  // 0xBC58(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_82;                  // 0xBCA0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0xBCE8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0xBD08(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_60;                // 0xBDD0(0x0040)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_55;                   // 0xBE10(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_59;                // 0xBE90(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_58;                // 0xBED0(0x0040)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_54;                   // 0xBF10(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_189;                   // 0xBF90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_188;                   // 0xBFB8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_81;                  // 0xBFE0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_80;                  // 0xC028(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_57;                // 0xC070(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_56;                // 0xC0B0(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_79;                  // 0xC0F0(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_55;                // 0xC138(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_78;                  // 0xC178(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_54;                // 0xC1C0(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_77;                  // 0xC200(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_53;                // 0xC248(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_187;                   // 0xC288(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_186;                   // 0xC2B0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_185;                   // 0xC2D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_184;                   // 0xC300(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_183;                   // 0xC328(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_182;                   // 0xC350(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_53;                   // 0xC378(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_52;                   // 0xC3F8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_51;                   // 0xC478(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_181;                   // 0xC4F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_180;                   // 0xC520(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_179;                   // 0xC548(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_178;                   // 0xC570(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_177;                   // 0xC598(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_176;                   // 0xC5C0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_76;                  // 0xC5E8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_175;                   // 0xC630(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_50;                   // 0xC658(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_49;                   // 0xC6D8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_174;                   // 0xC758(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_173;                   // 0xC780(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_172;                   // 0xC7A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_171;                   // 0xC7D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_170;                   // 0xC7F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_169;                   // 0xC820(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_168;                   // 0xC848(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_167;                   // 0xC870(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_166;                   // 0xC898(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_165;                   // 0xC8C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_164;                   // 0xC8E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_163;                   // 0xC910(0x0028)()
	uint8                                         Pad_C938[0x8];                                     // 0xC938(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0xC940(0x01A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_48;                   // 0xCAE0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_47;                   // 0xCB60(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_46;                   // 0xCBE0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_45;                   // 0xCC60(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_44;                   // 0xCCE0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_43;                   // 0xCD60(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_162;                   // 0xCDE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_161;                   // 0xCE08(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_160;                   // 0xCE30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_159;                   // 0xCE58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_158;                   // 0xCE80(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_157;                   // 0xCEA8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_42;                   // 0xCED0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_156;                   // 0xCF50(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_155;                   // 0xCF78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_154;                   // 0xCFA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_153;                   // 0xCFC8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_41;                   // 0xCFF0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_152;                   // 0xD070(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_151;                   // 0xD098(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_150;                   // 0xD0C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_149;                   // 0xD0E8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_51;                 // 0xD110(0x00E8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_50;                 // 0xD1F8(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_40;                   // 0xD2E0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_148;                   // 0xD360(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_147;                   // 0xD388(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_75;                  // 0xD3B0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_146;                   // 0xD3F8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_49;                 // 0xD420(0x00E8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_8;                        // 0xD508(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_39;                   // 0xD9E8(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_74;                  // 0xDA68(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0xDAB0(0x01A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_48;                 // 0xDC50(0x00E8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_7;                        // 0xDD38(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_73;                  // 0xE218(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_38;                   // 0xE260(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_17;                      // 0xE2E0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_145;                   // 0xE3A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_144;                   // 0xE3D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_143;                   // 0xE3F8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_72;                  // 0xE420(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_37;                   // 0xE468(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_142;                   // 0xE4E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_141;                   // 0xE510(0x0028)()
