#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_HelperBot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ShooterGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BI_HelperBot.BI_HelperBot_C.BotMode_GetAdditivePose
// 0x0010 (0x0010 - 0x0000)
struct BI_HelperBot_C_BotMode_GetAdditivePose final
{
public:
	class UAnimSequenceBase*                      PoseAnimSequence;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsExclusivePose;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_BotMode_GetAdditivePose;

// Function BI_HelperBot.BI_HelperBot_C.BotMode_GetColor
// 0x0010 (0x0010 - 0x0000)
struct BI_HelperBot_C_BotMode_GetColor final
{
public:
	struct FLinearColor                           Return;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_BotMode_GetColor;

// Function BI_HelperBot.BI_HelperBot_C.BotMode_GetCurrentTarget
// 0x0008 (0x0008 - 0x0000)
struct BI_HelperBot_C_BotMode_GetCurrentTarget final
{
public:
	class AActor*                                 OutCurrentTarget;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_BotMode_GetCurrentTarget;

// Function BI_HelperBot.BI_HelperBot_C.BotMode_GetRadius
// 0x0008 (0x0008 - 0x0000)
struct BI_HelperBot_C_BotMode_GetRadius final
{
public:
	double                                        Radius;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_BotMode_GetRadius;

// Function BI_HelperBot.BI_HelperBot_C.BotMode_SetCurrentResourceNode
// 0x0040 (0x0040 - 0x0000)
struct BI_HelperBot_C_BotMode_SetCurrentResourceNode final
{
public:
	struct FOverlappedFoliageElement              Node;                                              // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BI_HelperBot_C_BotMode_SetCurrentResourceNode;

// Function BI_HelperBot.BI_HelperBot_C.BotMode_SetCurrentTarget
// 0x0008 (0x0008 - 0x0000)
struct BI_HelperBot_C_BotMode_SetCurrentTarget final
{
public:
	class AActor*                                 NewTarget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_BotMode_SetCurrentTarget;

// Function BI_HelperBot.BI_HelperBot_C.DockingBay_ClientDoMultiUse
// 0x0018 (0x0018 - 0x0000)
struct BI_HelperBot_C_DockingBay_ClientDoMultiUse final
{
public:
	const class APlayerController*                ForPC;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         UseIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APrimalStructure*                       ForBay;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_DockingBay_ClientDoMultiUse;

// Function BI_HelperBot.BI_HelperBot_C.DockingBay_GetLocation
// 0x0018 (0x0018 - 0x0000)
struct BI_HelperBot_C_DockingBay_GetLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_DockingBay_GetLocation;

// Function BI_HelperBot.BI_HelperBot_C.DockingBay_GetMultiUseEntries
// 0x0030 (0x0030 - 0x0000)
struct BI_HelperBot_C_DockingBay_GetMultiUseEntries final
{
public:
	class APlayerController*                      ForPC;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMultiUseEntry>                 MultiUseEntries;                                   // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class APrimalStructure*                       ForBay;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMultiUseEntry>                 OutMultiUseEntries;                                // 0x0020(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BI_HelperBot_C_DockingBay_GetMultiUseEntries;

// Function BI_HelperBot.BI_HelperBot_C.DockingBay_TryMultiUse
// 0x0018 (0x0018 - 0x0000)
struct BI_HelperBot_C_DockingBay_TryMultiUse final
{
public:
	const class APlayerController*                ForPC;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         UseIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APrimalStructure*                       ForBay;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_DockingBay_TryMultiUse;

// Function BI_HelperBot.BI_HelperBot_C.GetCurrentAimOffset
// 0x0010 (0x0010 - 0x0000)
struct BI_HelperBot_C_GetCurrentAimOffset final
{
public:
	class UAimOffsetBlendSpace*                   OutAimOffset;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bAlignAimOffsetToCurrentTarget;                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_GetCurrentAimOffset;

// Function BI_HelperBot.BI_HelperBot_C.GetCurrentBotMode
// 0x0008 (0x0008 - 0x0000)
struct BI_HelperBot_C_GetCurrentBotMode final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_GetCurrentBotMode;

// Function BI_HelperBot.BI_HelperBot_C.GetCurrentHearPercent
// 0x0008 (0x0008 - 0x0000)
struct BI_HelperBot_C_GetCurrentHearPercent final
{
public:
	double                                        CurrentHeat;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_GetCurrentHearPercent;

// Function BI_HelperBot.BI_HelperBot_C.OnFinishedTask
// 0x0018 (0x0018 - 0x0000)
struct BI_HelperBot_C_OnFinishedTask final
{
public:
	struct FContainerTasks                        Task;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_BI_HelperBot_C_OnFinishedTask;

// Function BI_HelperBot.BI_HelperBot_C.PlayBotVoiceline
// 0x000C (0x000C - 0x0000)
struct BI_HelperBot_C_PlayBotVoiceline final
{
public:
	class FName                                   VoicelineTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForcePlay;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_PlayBotVoiceline;

// Function BI_HelperBot.BI_HelperBot_C.SetLastNoTaskTIme
// 0x0010 (0x0010 - 0x0000)
struct BI_HelperBot_C_SetLastNoTaskTIme final
{
public:
	double                                        NewTime;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bClearTime;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_SetLastNoTaskTIme;

// Function BI_HelperBot.BI_HelperBot_C.UpdateTalkingFX
// 0x0010 (0x0010 - 0x0000)
struct BI_HelperBot_C_UpdateTalkingFX final
{
public:
	class USoundWave*                             SoundWave;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        PlaybackPercent;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_HelperBot_C_UpdateTalkingFX;

}

