#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BodyTemplates_Selector_ASA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Selector_ASA_Widget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BodyTemplates_Selector_ASA.BodyTemplates_Selector_ASA_C
// 0x0030 (0x0410 - 0x03E0)
class UBodyTemplates_Selector_ASA_C final : public USelector_ASA_Widget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BodyTemplates_Selector_ASA_C;       // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bPCCIsFemale;                                      // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedCustomData;                                // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     HairIconsFemale;                                   // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture2D*>                     HairIconsMale;                                     // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BPExecutedCommandForPrimalUI(class FName CommandName, const struct FBPNetExecParams& ExecParams);
	void ExecuteUbergraph_BodyTemplates_Selector_ASA(int32 EntryPoint);
	void GetOptions(TArray<class UTexture2D*>* Icons, TArray<class FString>* Names);
	void RefreshOptions();
	void SetValueChangedToParent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BodyTemplates_Selector_ASA_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BodyTemplates_Selector_ASA_C")
	}
	static class UBodyTemplates_Selector_ASA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBodyTemplates_Selector_ASA_C>();
	}
};
DUMPER7_ASSERTS_UBodyTemplates_Selector_ASA_C;

}

