#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BotControllerInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function BotControllerInterface.BotControllerInterface_C.BotPlayVoiceLine_Interface
// 0x000C (0x000C - 0x0000)
struct BotControllerInterface_C_BotPlayVoiceLine_Interface final
{
public:
	class FName                                   VoicelineTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForcePlay;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDidPlay;                                          // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BotControllerInterface_C_BotPlayVoiceLine_Interface;

// Function BotControllerInterface.BotControllerInterface_C.ClaimDino_Interface
// 0x0010 (0x0010 - 0x0000)
struct BotControllerInterface_C_ClaimDino_Interface final
{
public:
	class APrimalDinoCharacter*                   Dino;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BotControllerInterface_C_ClaimDino_Interface;

// Function BotControllerInterface.BotControllerInterface_C.ClaimSeatingStructure_Interface
// 0x0010 (0x0010 - 0x0000)
struct BotControllerInterface_C_ClaimSeatingStructure_Interface final
{
public:
	class APrimalStructureSeating*                SeatingStructure;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SeatNumber;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BotControllerInterface_C_ClaimSeatingStructure_Interface;

// Function BotControllerInterface.BotControllerInterface_C.GetClaimedDino_Interface
// 0x0008 (0x0008 - 0x0000)
struct BotControllerInterface_C_GetClaimedDino_Interface final
{
public:
	class AActor*                                 ClaimedDino;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BotControllerInterface_C_GetClaimedDino_Interface;

// Function BotControllerInterface.BotControllerInterface_C.GetClaimedSeatingStructure_Interface
// 0x0010 (0x0010 - 0x0000)
struct BotControllerInterface_C_GetClaimedSeatingStructure_Interface final
{
public:
	class AActor*                                 ClaimedSeatingStructure;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SeatNumber;                                        // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BotControllerInterface_C_GetClaimedSeatingStructure_Interface;

// Function BotControllerInterface.BotControllerInterface_C.InitializeBlackboardValues_interface
// 0x0008 (0x0008 - 0x0000)
struct BotControllerInterface_C_InitializeBlackboardValues_interface final
{
public:
	class UObject*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BotControllerInterface_C_InitializeBlackboardValues_interface;

// Function BotControllerInterface.BotControllerInterface_C.IsTooCloseToAttack_interface
// 0x0001 (0x0001 - 0x0000)
struct BotControllerInterface_C_IsTooCloseToAttack_interface final
{
public:
	bool                                          TooClose;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BotControllerInterface_C_IsTooCloseToAttack_interface;

// Function BotControllerInterface.BotControllerInterface_C.IsTooFarToAttack_interface
// 0x0001 (0x0001 - 0x0000)
struct BotControllerInterface_C_IsTooFarToAttack_interface final
{
public:
	bool                                          TooFar;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BotControllerInterface_C_IsTooFarToAttack_interface;

}

