#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CFCorePluginManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "cfcore_structs.hpp"
#include "cfcore_ui_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CFCorePluginManager.BP_CFCorePluginManager_C
// 0x0840 (0x0CC0 - 0x0480)
class ABP_CFCorePluginManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUI_StoreMenu_C*                        UI_OverwolfStoreMenu;                              // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_ModPage_C*                          UI_ModPage;                                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_ServerModsWidget_C*                 UI_ServerModsWidget;                               // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoSpawnOnGameStart;                              // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ForceRequireTermsOnStartup;                        // 0x04A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4AA[0x6];                                      // 0x04AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTermsAndConditions_C*                  TermsAndConditions;                                // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PremiumCheckHandle;                                // 0x04B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_NotificationManager_C*              UiNotifManager;                                    // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMediaSoundComponent*                   MediaSoundComponent;                               // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMediaSoundComponent*                   SoundMediaComponent;                               // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSignedIn;                                        // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCFCoreSettings                        CFCoreSettings;                                    // 0x04E8(0x0138)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMe                                    SignInCredentials;                                 // 0x0620(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int64>                                 ModsRequestedToPurchase;                           // 0x0690(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Enable_Discovery;                                  // 0x06A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          EnableDebuggingInputs;                             // 0x06A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6A2[0x6];                                      // 0x06A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_CfCoreUI_C*                       Save_CfCoreUI;                                     // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Double_Installed_List;                         // 0x06B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModsDirInfo                           DiscSpaceAvailable;                                // 0x06B8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FInstallProgressMod                    ModDetails;                                        // 0x06D8(0x0538)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUI_Prompt_Uninstall_C*                 UI_UninstallNotifPrompt;                           // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Prompt_UninstallAll_C*              UninstallAllPopup;                                 // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnModsUninstalled;                                 // 0x0C20(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Enable_Class_Selection;                            // 0x0C30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_C31[0x7];                                      // 0x0C31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCategory>                      ClassCategories;                                   // 0x0C38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FCategory                              CurrentClassCategory;                              // 0x0C48(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Accept_Terms();
	void ApplySomePCDefaults();
	void AttemptCreateOverwolfUI();
	void AttemptUninstallMod(const struct FInstallProgressMod& ModDetails_0);
	void BackToFreedom_YouThenAddWhateverYouWantHere();
	void Calculate_Total_Update_Size_Of_Mods(TArray<struct FInstallProgressMod>& Array, int64* Size);
	void ContinueUninstallAll();
	void Create_A_Mod_Page_From_ID();
	void CreateNotifManager();
	void CreateSaveFile();
	void CreateServerModsPageStandalone();
	void CreateTermsAndConditions();
	void DebugSignIn();
	void DestroyAllUIs();
	void DestroyPurchaseResponseHandle();
	void Event_On_CFCore_Init();
	void Event_On_CFCore_Init_Error(const struct FCFCoreError& Error);
	void Event_On_Get_User_Info(const struct FMe& Me);
	void Event_On_Get_User_Info_Failed(const struct FCFCoreError& Error);
	void Event_On_Sync_Installed_Mods_Error(const struct FCFCoreError& Error);
	void Event_On_Sync_Installed_Mods_Success();
	void Event_On_Uninstall_Aprroved();
	void Event_Result(bool is_authenticated);
	void ExecuteUbergraph_BP_CFCorePluginManager(int32 EntryPoint);
	void FailedPremiumModsChecks(const struct FCFCoreError& Error);
	void InitializeCfCorePlugin();
	void InitSoundMediaComponent();
	void InpActEvt_Eight_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_Five_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Four_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_Nine_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_One_K2Node_InputKeyEvent_7(const struct FKey& Key);
	void InpActEvt_Seven_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_Three_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void InpActEvt_Two_K2Node_InputKeyEvent_6(const struct FKey& Key);
	bool IsModPurchased(const struct FInstallProgressMod& ModInfo);
	void OnBack();
	void OnClassCategoriesInfoFound(const TArray<struct FCategory>& Categories);
	void OnClassCategoriesInfoFound_Error(const struct FCFCoreError& Error);
	void OnDiscSpaceAvailable(const struct FModsDirInfo& ModsDirInfo);
	void OnDiscSpaceCheckFail(const struct FCFCoreError& Error);
	void OnError();
	void OnErrorGeneratePremium(const struct FCFCoreError& Error);
	void OnErrorSpaceCheck(const struct FCFCoreError& Error);
	void OnErrorUpdateInstalledModProperties(const struct FCFCoreError& Error);
	void OnFailGetMyPremiumMods(const struct FCFCoreError& Error);
	void OnFinishedInitialization();
	void OnJoin(int64 ServerID);
	void OnReportFavorite(int64 ServerID);
	void OnSuccessGeneratePremium(const class FString& URL);
	void OnSuccessGetMyPremiumMods(const TArray<int64>& modIds);
	void OnSuccessPremiumModsCheck(const TArray<int64>& modIds);
	void OnSuccessSpaceCheck(const struct FModsDirInfo& ModsDirInfo);
	void OnSuccessUpdateInstalledModProperties();
	void PlayNotEnoughAnimation();
	void PremiumModChecking();
	void PurchaseModsWithIds(const TArray<int64>& PurchasedMods);
	void PurcherseMod(const int64& modId);
	void PurcherseMods(const TArray<int64>& ModsId);
	void ReceiveBeginPlay();
	void RefreshAllAfterCodeRedeem();
	void Reject_Terms();
	void RemovePopup();
	void RequestInstallMod(const struct FInstallProgressMod& ModInfo);
	void SortClassCategories();
	void TermsAlreadyAccepted();
	void UninstallMods(const TArray<struct FInstallProgressMod>& Array);
	void UpdateModEnabledStatuses(const TArray<struct FInstalledModProperties>& InInstalledModsProperties);
	void UpdateMods(const TArray<struct FInstallProgressMod>& ModsToUpdate);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CFCorePluginManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CFCorePluginManager_C")
	}
	static class ABP_CFCorePluginManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CFCorePluginManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_CFCorePluginManager_C;

}

