#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CFCorePluginManager

#include "Basic.hpp"

#include "cfcore_structs.hpp"
#include "cfcore_ui_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.ApplySomePCDefaults
// 0x0028 (0x0028 - 0x0000)
struct BP_CFCorePluginManager_C_ApplySomePCDefaults final
{
public:
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_GetDesktopResolution_ReturnValue;         // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_ApplySomePCDefaults;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.AttemptUninstallMod
// 0x0538 (0x0538 - 0x0000)
struct BP_CFCorePluginManager_C_AttemptUninstallMod final
{
public:
	struct FInstallProgressMod                    ModDetails_0;                                      // 0x0000(0x0538)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_AttemptUninstallMod;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.Calculate Total Update Size Of Mods
// 0x05A8 (0x05A8 - 0x0000)
struct BP_CFCorePluginManager_C_Calculate_Total_Update_Size_Of_Mods final
{
public:
	TArray<struct FInstallProgressMod>            Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int64                                         Size;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         Total;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInstallProgressMod                    CallFunc_Array_Get_Item;                           // 0x0028(0x0538)(ContainsInstancedReference)
	struct FCFCoreFileSize                        CallFunc_Get_Mod_Size_SizeStruct;                  // 0x0560(0x000C)(NoDestructor)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Get_Mod_Size_SizeInText;                  // 0x0570(0x0010)()
	int64                                         CallFunc_Get_Mod_Size_bytes;                       // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Add_Int64Int64_ReturnValue;               // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x059C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D[0x3];                                      // 0x059D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_Calculate_Total_Update_Size_Of_Mods;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.CreateNotifManager
// 0x0010 (0x0010 - 0x0000)
struct BP_CFCorePluginManager_C_CreateNotifManager final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_NotificationManager_C*              CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_CreateNotifManager;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.CreateSaveFile
// 0x0028 (0x0028 - 0x0000)
struct BP_CFCorePluginManager_C_CreateSaveFile final
{
public:
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_CfCoreUI_C*                       K2Node_DynamicCast_AsSave_Cf_Core_UI;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USave_CfCoreUI_C*                       CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_CreateSaveFile;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.DestroyAllUIs
// 0x0003 (0x0003 - 0x0000)
struct BP_CFCorePluginManager_C_DestroyAllUIs final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_DestroyAllUIs;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.DestroyPurchaseResponseHandle
// 0x0001 (0x0001 - 0x0000)
struct BP_CFCorePluginManager_C_DestroyPurchaseResponseHandle final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_DestroyPurchaseResponseHandle;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.Event On CFCore Init Error
// 0x0038 (0x0038 - 0x0000)
struct BP_CFCorePluginManager_C_Event_On_CFCore_Init_Error final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_Event_On_CFCore_Init_Error;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.Event On Get User Info
// 0x0070 (0x0070 - 0x0000)
struct BP_CFCorePluginManager_C_Event_On_Get_User_Info final
{
public:
	struct FMe                                    Me;                                                // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_Event_On_Get_User_Info;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.Event On Get User Info Failed
// 0x0038 (0x0038 - 0x0000)
struct BP_CFCorePluginManager_C_Event_On_Get_User_Info_Failed final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_Event_On_Get_User_Info_Failed;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.Event On Sync Installed Mods Error
// 0x0038 (0x0038 - 0x0000)
struct BP_CFCorePluginManager_C_Event_On_Sync_Installed_Mods_Error final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_Event_On_Sync_Installed_Mods_Error;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.Event Result
// 0x0001 (0x0001 - 0x0000)
struct BP_CFCorePluginManager_C_Event_Result final
{
public:
	bool                                          is_authenticated;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_Event_Result;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.ExecuteUbergraph_BP_CFCorePluginManager
// 0x2160 (0x2160 - 0x0000)
struct BP_CFCorePluginManager_C_ExecuteUbergraph_BP_CFCorePluginManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCFCoreUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCFCoreUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Prompt_Uninstall_C*                 CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCFCoreUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCFCoreUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FModsDirInfo& ModsDirInfo)> K2Node_CreateDelegate_OutputDelegate_1;  // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_2;        // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Prompt_UninstallAll_C*              CallFunc_Create_ReturnValue_1;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCFCoreUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_6;        // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const TArray<struct FCategory>& Categories)> K2Node_CreateDelegate_OutputDelegate_7; // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_2;         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_8;        // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTermsAndConditions_C*                  CallFunc_Create_ReturnValue_2;                     // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_ModPage_C*                          CallFunc_CreateModPageFromID_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int64                                         K2Node_CustomEvent_ServerId_1;                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         K2Node_CustomEvent_ServerId;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int64 ServerID)>               K2Node_CreateDelegate_OutputDelegate_11;           // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FModsDirInfo& ModsDirInfo)> K2Node_CreateDelegate_OutputDelegate_12; // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int64 ServerID)>               K2Node_CreateDelegate_OutputDelegate_14;           // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         K2Node_CustomEvent_modId;                          // 0x01B0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int64>                                 K2Node_CustomEvent_ModsId;                         // 0x01B8(0x0010)(ConstParm, ReferenceParm)
	class UBP_ServerModsWidget_C*                 CallFunc_Create_ReturnValue_3;                     // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_3;         // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int64>                                 K2Node_MakeArray_Array;                            // 0x01E8(0x0010)(ReferenceParm)
	class UBindButtonSystem*                      CallFunc_GetEngineSubsystem_ReturnValue_4;         // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCFCoreError                           K2Node_CustomEvent_error_9;                        // 0x0200(0x0038)(ConstParm)
	struct FCFCoreSettings                        CallFunc_MakeSettingsFromProjectConfig_ReturnValue; // 0x0238(0x0138)()
	class UCFCoreUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterModelClass_ReturnValue;           // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_5;         // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_is_authenticated;               // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_15;       // 0x038C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCFCoreError                           K2Node_CustomEvent_error_8;                        // 0x03A0(0x0038)(ConstParm)
	TDelegate<void(const TArray<int64>& modIds)>  K2Node_CreateDelegate_OutputDelegate_16;           // 0x03D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMe                                    K2Node_CustomEvent_me;                             // 0x03E8(0x0070)(ConstParm)
	struct FCFCoreError                           K2Node_CustomEvent_error_7;                        // 0x0458(0x0038)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x0490(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_18;       // 0x04A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x04B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& URL)>     K2Node_CreateDelegate_OutputDelegate_19;           // 0x04B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_6;         // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCFCoreUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<int64>                                 K2Node_CustomEvent_ModIds_1;                       // 0x04D8(0x0010)(ConstParm, ReferenceParm)
	struct FCFCoreError                           K2Node_CustomEvent_error_6;                        // 0x04E8(0x0038)(ConstParm)
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_7;         // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_20;       // 0x0528(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const TArray<int64>& modIds)>  K2Node_CreateDelegate_OutputDelegate_21;           // 0x0538(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_8;         // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_url;                            // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_22;           // 0x0560(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanLaunchURL_ReturnValue;                 // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCFCoreError                           K2Node_CustomEvent_error_5;                        // 0x0578(0x0038)(ConstParm)
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_23;       // 0x05B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_24;       // 0x05C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_9;         // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FMe& Me)>         K2Node_CreateDelegate_OutputDelegate_25;           // 0x05D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<int64>                                 K2Node_CustomEvent_ModIds;                         // 0x05E8(0x0010)(ConstParm, ReferenceParm)
	struct FCFCoreError                           K2Node_CustomEvent_error_4;                        // 0x05F8(0x0038)(ConstParm)
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_10;        // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_26;       // 0x0638(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool is_authenticated)>        K2Node_CreateDelegate_OutputDelegate_27;           // 0x0648(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int64>                                 K2Node_CustomEvent_PurchasedMods;                  // 0x0660(0x0010)(ConstParm, ReferenceParm)
	struct FGenPremiumCheckoutUrlRequest          K2Node_MakeStruct_GenPremiumCheckoutUrlRequest;    // 0x0670(0x0078)()
	bool                                          CallFunc_DidAllTheModsGetBought_ReturnValue;       // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCFCoreInitializationOptions           Temp_struct_Variable;                              // 0x06F0(0x0010)(ConstParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0700(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0708(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_28;           // 0x0710(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModsDirInfo                           K2Node_CustomEvent_ModsDirInfo_1;                  // 0x0728(0x0020)(ConstParm)
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_29;       // 0x0748(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCFCoreError                           K2Node_CustomEvent_error_3;                        // 0x0758(0x0038)(ConstParm)
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue_11;        // 0x0790(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_30;           // 0x0798(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A8[0x8];                                      // 0x07A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_1;                            // 0x07B0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSoundComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0818(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_There_Enough_Space_to_Install_Mod_EnoughSpace; // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821[0x7];                                      // 0x0821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_NotificationManager_C*              CallFunc_GetNotifManager_Output;                   // 0x0828(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_831[0x3];                                      // 0x0831(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInstallProgressMod                    K2Node_CustomEvent_ModInfo;                        // 0x0838(0x0538)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_GetIsModPaidStatus_Premium;               // 0x0D70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsModPaidStatus_Is_Freemium;           // 0x0D71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsModPaidStatus_Purchased;             // 0x0D72(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D73[0x5];                                      // 0x0D73(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetIsModPaidStatus_Tier_Price;            // 0x0D78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetIsModPaidStatus_Currency_Symbol;       // 0x0D80(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPremiumDetailsPlatformData            CallFunc_GetIsModPaidStatus_Platform_Data;         // 0x0D90(0x0010)()
	struct FPremiumDetailsDiscount                CallFunc_GetIsModPaidStatus_Discount_Data;         // 0x0DA0(0x0020)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0DC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0DC4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC5[0x3];                                      // 0x0DC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstallProgressMod                    K2Node_CustomEvent_ModDetails;                     // 0x0DC8(0x0538)(ConstParm, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_31;           // 0x1300(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x1310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1311[0x7];                                     // 0x1311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x1318(0x0010)()
	TArray<struct FInstallProgressMod>            K2Node_CustomEvent_ModsToUpdate;                   // 0x1328(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x1338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FInstallProgressMod                    CallFunc_Array_Get_Item;                           // 0x1348(0x0538)(ContainsInstancedReference)
	class FString                                 CallFunc_StringLimit_NewString;                    // 0x1880(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x1890(0x0010)()
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x18A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A1[0x7];                                     // 0x18A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_StringLimit_NewString_1;                  // 0x18A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x18B8(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x18C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x18CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18CD[0x3];                                     // 0x18CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Calculate_Total_Update_Size_Of_Mods_Size; // 0x18D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_Int64Int64_ReturnValue;           // 0x18D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D9[0x7];                                     // 0x18D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_NotificationManager_C*              CallFunc_GetNotifManager_Output_1;                 // 0x18E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FModsDirInfo                           K2Node_CustomEvent_ModsDirInfo;                    // 0x18E8(0x0020)(ConstParm)
	struct FCFCoreError                           K2Node_CustomEvent_error_2;                        // 0x1908(0x0038)(ConstParm)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x1940(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_6;                        // 0x1958(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x1970(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1971[0x7];                                     // 0x1971(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_7;                        // 0x1978(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x1990(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1994[0x4];                                     // 0x1994(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_StoreMenu_C*                        CallFunc_Create_ReturnValue_4;                     // 0x1998(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x19A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A4[0x4];                                     // 0x19A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstallProgressMod>            K2Node_CustomEvent_Array;                          // 0x19A8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x19B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x19BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19BD[0x3];                                     // 0x19BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCFCoreError                           K2Node_CustomEvent_error_1;                        // 0x19C0(0x0038)(ConstParm)
	TDelegate<void(const TArray<int64>& ModsId)>  K2Node_CreateDelegate_OutputDelegate_32;           // 0x19F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const int64& modId)>           K2Node_CreateDelegate_OutputDelegate_33;           // 0x1A08(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInstalledModProperties>        K2Node_CustomEvent_InInstalledModsProperties;      // 0x1A18(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x1A28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2C[0x4];                                     // 0x1A2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x1A30(0x0010)(ConstParm)
	struct FInstallProgressMod                    CallFunc_Array_Get_Item_1;                         // 0x1A40(0x0538)(ContainsInstancedReference)
	struct FCFCoreGetCategoriesFilter             CallFunc_MakeGetCategoriesFilter_ReturnValue;      // 0x1F78(0x0008)(NoDestructor)
	TArray<struct FCategory>                      K2Node_CustomEvent_categories;                     // 0x1F80(0x0010)(ConstParm, ReferenceParm)
	class UCFCoreUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x1F90(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCategory                              CallFunc_Array_Get_Item_2;                         // 0x1F98(0x0078)()
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x2010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2014[0x4];                                     // 0x2014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x2018(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x2030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2031[0x7];                                     // 0x2031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x2038(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x2050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2054[0x4];                                     // 0x2054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCategory                              CallFunc_Array_Get_Item_3;                         // 0x2058(0x0078)()
	struct FCFCoreError                           K2Node_CustomEvent_error;                          // 0x20D0(0x0038)(ConstParm)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x2108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_210C[0x4];                                     // 0x210C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x2110(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x2128(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_5;                        // 0x2140(0x0018)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_ExecuteUbergraph_BP_CFCorePluginManager;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.FailedPremiumModsChecks
// 0x0038 (0x0038 - 0x0000)
struct BP_CFCorePluginManager_C_FailedPremiumModsChecks final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_FailedPremiumModsChecks;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.InitSoundMediaComponent
// 0x0070 (0x0070 - 0x0000)
struct BP_CFCorePluginManager_C_InitSoundMediaComponent final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSoundComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_InitSoundMediaComponent;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.InpActEvt_Eight_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct BP_CFCorePluginManager_C_InpActEvt_Eight_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_InpActEvt_Eight_K2Node_InputKeyEvent_2;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.InpActEvt_Five_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_CFCorePluginManager_C_InpActEvt_Five_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_InpActEvt_Five_K2Node_InputKeyEvent_0;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.InpActEvt_Four_K2Node_InputKeyEvent_4
// 0x0018 (0x0018 - 0x0000)
struct BP_CFCorePluginManager_C_InpActEvt_Four_K2Node_InputKeyEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_InpActEvt_Four_K2Node_InputKeyEvent_4;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.InpActEvt_Nine_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_CFCorePluginManager_C_InpActEvt_Nine_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_InpActEvt_Nine_K2Node_InputKeyEvent_1;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.InpActEvt_One_K2Node_InputKeyEvent_7
// 0x0018 (0x0018 - 0x0000)
struct BP_CFCorePluginManager_C_InpActEvt_One_K2Node_InputKeyEvent_7 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_InpActEvt_One_K2Node_InputKeyEvent_7;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.InpActEvt_Seven_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct BP_CFCorePluginManager_C_InpActEvt_Seven_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_InpActEvt_Seven_K2Node_InputKeyEvent_3;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.InpActEvt_Three_K2Node_InputKeyEvent_5
// 0x0018 (0x0018 - 0x0000)
struct BP_CFCorePluginManager_C_InpActEvt_Three_K2Node_InputKeyEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_InpActEvt_Three_K2Node_InputKeyEvent_5;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.InpActEvt_Two_K2Node_InputKeyEvent_6
// 0x0018 (0x0018 - 0x0000)
struct BP_CFCorePluginManager_C_InpActEvt_Two_K2Node_InputKeyEvent_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_InpActEvt_Two_K2Node_InputKeyEvent_6;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.IsModPurchased
// 0x05A0 (0x05A0 - 0x0000)
struct BP_CFCorePluginManager_C_IsModPurchased final
{
public:
	struct FInstallProgressMod                    ModInfo;                                           // 0x0000(0x0538)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0538(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCFCoreUISubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsModPaidStatus_Premium;               // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsModPaidStatus_Is_Freemium;           // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsModPaidStatus_Purchased;             // 0x054A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54B[0x5];                                      // 0x054B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetIsModPaidStatus_Tier_Price;            // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetIsModPaidStatus_Currency_Symbol;       // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPremiumDetailsPlatformData            CallFunc_GetIsModPaidStatus_Platform_Data;         // 0x0568(0x0010)()
	struct FPremiumDetailsDiscount                CallFunc_GetIsModPaidStatus_Discount_Data;         // 0x0578(0x0020)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_IsModPurchased;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnClassCategoriesInfoFound
// 0x0010 (0x0010 - 0x0000)
struct BP_CFCorePluginManager_C_OnClassCategoriesInfoFound final
{
public:
	TArray<struct FCategory>                      Categories;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnClassCategoriesInfoFound;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnClassCategoriesInfoFound_Error
// 0x0038 (0x0038 - 0x0000)
struct BP_CFCorePluginManager_C_OnClassCategoriesInfoFound_Error final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnClassCategoriesInfoFound_Error;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnDiscSpaceAvailable
// 0x0020 (0x0020 - 0x0000)
struct BP_CFCorePluginManager_C_OnDiscSpaceAvailable final
{
public:
	struct FModsDirInfo                           ModsDirInfo;                                       // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnDiscSpaceAvailable;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnDiscSpaceCheckFail
// 0x0038 (0x0038 - 0x0000)
struct BP_CFCorePluginManager_C_OnDiscSpaceCheckFail final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnDiscSpaceCheckFail;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnErrorGeneratePremium
// 0x0038 (0x0038 - 0x0000)
struct BP_CFCorePluginManager_C_OnErrorGeneratePremium final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnErrorGeneratePremium;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnErrorSpaceCheck
// 0x0038 (0x0038 - 0x0000)
struct BP_CFCorePluginManager_C_OnErrorSpaceCheck final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnErrorSpaceCheck;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnErrorUpdateInstalledModProperties
// 0x0038 (0x0038 - 0x0000)
struct BP_CFCorePluginManager_C_OnErrorUpdateInstalledModProperties final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnErrorUpdateInstalledModProperties;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnFailGetMyPremiumMods
// 0x0038 (0x0038 - 0x0000)
struct BP_CFCorePluginManager_C_OnFailGetMyPremiumMods final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnFailGetMyPremiumMods;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnJoin
// 0x0008 (0x0008 - 0x0000)
struct BP_CFCorePluginManager_C_OnJoin final
{
public:
	int64                                         ServerID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnJoin;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnReportFavorite
// 0x0008 (0x0008 - 0x0000)
struct BP_CFCorePluginManager_C_OnReportFavorite final
{
public:
	int64                                         ServerID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnReportFavorite;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnSuccessGeneratePremium
// 0x0010 (0x0010 - 0x0000)
struct BP_CFCorePluginManager_C_OnSuccessGeneratePremium final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnSuccessGeneratePremium;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnSuccessGetMyPremiumMods
// 0x0010 (0x0010 - 0x0000)
struct BP_CFCorePluginManager_C_OnSuccessGetMyPremiumMods final
{
public:
	TArray<int64>                                 modIds;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnSuccessGetMyPremiumMods;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnSuccessPremiumModsCheck
// 0x0010 (0x0010 - 0x0000)
struct BP_CFCorePluginManager_C_OnSuccessPremiumModsCheck final
{
public:
	TArray<int64>                                 modIds;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnSuccessPremiumModsCheck;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.OnSuccessSpaceCheck
// 0x0020 (0x0020 - 0x0000)
struct BP_CFCorePluginManager_C_OnSuccessSpaceCheck final
{
public:
	struct FModsDirInfo                           ModsDirInfo;                                       // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_OnSuccessSpaceCheck;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.PurchaseModsWithIds
// 0x0010 (0x0010 - 0x0000)
struct BP_CFCorePluginManager_C_PurchaseModsWithIds final
{
public:
	TArray<int64>                                 PurchasedMods;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_PurchaseModsWithIds;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.PurcherseMod
// 0x0008 (0x0008 - 0x0000)
struct BP_CFCorePluginManager_C_PurcherseMod final
{
public:
	int64                                         modId;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_PurcherseMod;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.PurcherseMods
// 0x0010 (0x0010 - 0x0000)
struct BP_CFCorePluginManager_C_PurcherseMods final
{
public:
	TArray<int64>                                 ModsId;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CFCorePluginManager_C_PurcherseMods;

// Function BP_CFCorePluginManager.BP_CFCorePluginManager_C.RequestInstallMod
// 0x0538 (0x0538 - 0x0000)
struct BP_CFCorePluginManager_C_RequestInstallMod final
{
public:
