#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ServerModsLoading

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "cfcore_ui_structs.hpp"
#include "cfcore_structs.hpp"
#include "CFCoreUIWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_ServerModsLoading.BP_ServerModsLoading_C
// 0x01C0 (0x09F8 - 0x0838)
class UBP_ServerModsLoading_C final : public UCFCoreUIWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ServerModsLoading_C;             // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0840(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             DOUNLOADING_PROGGRESS;                             // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DOWNLOAD_MODS_COUNT;                               // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_177;                                         // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BackGround;                                    // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_102;                                   // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_MODS_DOWNLOAD_COUNT;                          // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PERCENT;                                      // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_ServerName;                                   // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Back_C*           UI_Button_Ark_Global_Back;                         // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Overlay_C*                          UI_Overlay;                                        // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FInstallProgressMod>            Mods_to_Download;                                  // 0x0898(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         ModIndex;                                          // 0x08A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8AC[0x4];                                      // 0x08AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              BackEvent;                                         // 0x08B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              CompetedEvent;                                     // 0x08C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              ErrorEvent;                                        // 0x08D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<int64, struct FInstallProgressMod>       ModsById;                                          // 0x08E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<int64, struct FFile>                     FileById;                                          // 0x0930(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   InstallingDots;                                    // 0x0980(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int64                                         TotalModsSize;                                     // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int64, int64>                            TempCurrentModsSize;                               // 0x0998(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int64                                         CurrentModsSize;                                   // 0x09E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Errors;                                            // 0x09F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         success;                                           // 0x09F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddToProgressSize(const int64& Key, const int64& Value);
	void AssureClientModsUpdated_OnProgress(const struct FModsUpdateProgress& UpdateProgress, const struct FLibraryProgress& ModInstallProgress, const struct FCFCoreMod& mod);
	void AssureClientModsUpdated_OnUpdatedFinished(const TArray<struct FInstalledMod>& installed_mods);
	void BndEvt__BP_ServerModsLoading_UI_Button_Ark_Global_Back_C_0_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature();
	bool BPHighlightWidgetOnStart();
	void CalculateTatalModsSize();
	void CheckIfAllDownloaded();
	void Construct();
	void ControllerAction(const struct FKey& Key, EViewState State);
	void DelayComplition();
	void Destruct();
	void DownloadAllModsByFileIDs(const class FText& serverName, TArray<int64>& ModsToDownload, TArray<struct FInstallProgressMod>& Mods_to_Download_0);
	void ExecuteUbergraph_BP_ServerModsLoading(int32 EntryPoint);
	void GetDelegate(const TDelegate<void()>& BackDelegate, const TDelegate<void()>& CompletedDelegate, const TDelegate<void()>& errorDelegate);
	void ModInstallingError(struct FCFCoreError& Error);
	void ModInstallingSuccess(struct FInstalledMod& InstalledMod);
	void OnError(const struct FCFCoreError& Error);
	void OnSuccess();
	void ParsingMods();
	void ParsingModsFile(const struct FCFCoreMod& mod);
	void PlayFadeInAnimation();
	void SetDounloadingCountText();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_Downloading_Proggress_Text(int64 modId, int64 fileId, ELibraryProgressState PregressState, int32 progress, int64 transferredBytes);
	void UpdateProgressBar();
	void UpdateTexts();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ServerModsLoading_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ServerModsLoading_C")
	}
	static class UBP_ServerModsLoading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ServerModsLoading_C>();
	}
};
DUMPER7_ASSERTS_UBP_ServerModsLoading_C;

}

