#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Buff_TekArmor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Buff_OverrideVelocity_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Buff_TekArmor.Buff_TekArmor_C
// 0x0120 (0x0D00 - 0x0BE0)
class ABuff_TekArmor_C final : public ABuff_OverrideVelocity_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AShooterCharacter*                      Ref_OwningPlayer;                                  // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EPrimalEquipmentType                          currentEquipmentSlot;                              // 0x0BF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF1[0x7];                                      // 0x0BF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      Ref_OwningPlayerController;                        // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABuff_TekArmor_C*                       SelfAsObj;                                         // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AWeapFists_C*                           FistWeapon;                                        // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPrimalItemArmor_Base_Tek_C*            Ref_ArmorPiece;                                    // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EPrimalEquipmentType                          TekBuffEquipmentType;                              // 0x0C18(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTekAbilityActive;                               // 0x0C19(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1A[0x2];                                      // 0x0C1A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TekArmorMessage_Color;                             // 0x0C1C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2C[0x4];                                      // 0x0C2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TekArmorMessage_DisplayScale;                      // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TekArmorMessage_DisplayTime;                       // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInfiniteAmmo;                                     // 0x0C40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C41[0x7];                                      // 0x0C41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATekArmor_EffectActor_C*>        SpawnedFXActors;                                   // 0x0C48(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class FName                                   TekArmorName;                                      // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             TekArmorIcon;                                      // 0x0C60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldWarpFOV;                                    // 0x0C68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C69[0x7];                                      // 0x0C69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        warpFOV_target;                                    // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        warpFOV_MAX;                                       // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        warpFOV_lag_in;                                    // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        warpFOV_lag_out;                                   // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        warpFOV_start;                                     // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ConsumeElementInterval;                            // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeSinceLastConsumeElement;                       // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPrimalEquipmentType                          preventAbilityActiveSlot;                          // 0x0CA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTekIgnoredMoveInput;                              // 0x0CA9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTekIgnoredLookInput;                              // 0x0CAA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLeftBumperHeld;                                   // 0x0CAB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWeapon;                                         // 0x0CAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAD[0x3];                                      // 0x0CAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Restricted_because_of_genesis_map_string;          // 0x0CB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        GenesisAbilityErrorRateLimitSeconds;               // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          has_set_whether_tek_abilities_are_allowed_in_genesis; // 0x0CC8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          tek_abilities_are_allowed_in_genesis;              // 0x0CC9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CCA[0x6];                                      // 0x0CCA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GenesisMapName;                                    // 0x0CD0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UClass*>                         AbilityRequiresEngrams;                            // 0x0CE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TimeSinceLastFXSpawned;                            // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfFXSpawned;                                 // 0x0CF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool AllowPostProcessEffect();
	void AreAnyTekAbilitiesActive(bool* Result);
	void BPActivated(class AActor* ForInstigator);
	void BPDeactivated(class AActor* ForInstigator);
	void BPSetupForInstigator(class AActor* ForInstigator);
	void CanUseTekAbility(bool bNotifyIfOutOfElement, bool* bResult);
	void check_genesis_restrictions_for_player(class APrimalCharacter* Player, bool* is_restricted);
	void CheckForArmorRef();
	void Client_Consume_Element_After_Time(double DeltaTime, int32 elementCost);
	void DisplayTekArmorMessage(const class FString& Message, class USoundBase* Sound);
	void Equipped_SetToMaxElement(EPrimalEquipmentType ItemSlot);
	void Equipped_TryToDecreaseElement(int32 AmountToDecreaseBy, EPrimalEquipmentType ItemSlot);
	void ExecuteUbergraph_Buff_TekArmor(int32 EntryPoint);
	void Get_DefaultTekBuff(class ABuff_TekArmor_C** ref);
	void Get_Is_Player_in_SealedSpace(bool* Result);
	void Get_Ref_Owning_PlayerController(class AShooterPlayerController** Controller);
	void Get_Ref_Owning_PlayerMovement(class UCharacterMovementComponent** Movement);
	void Get_RefOwningPlayer_Camera_Manager(class AShooterPlayerCameraManager** ref);
	void GetDefaultPlayer(class APrimalCharacter** ref);
	void GetRef_OwningPlayer(class AShooterCharacter** Player);
	void GetRelatedTekArmorRef(class UPrimalItemArmor_Base_Tek_C** tekArmorRef);
	void HasRequiredEngrams(bool* HasEngrams);
	void HideBoostIcon(bool* ShouldSet, bool* WithValue);
	void InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Gamepad_LeftShoulder_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void Is_Restricted_Because_Of_Genesis_Map(bool* restricted);
	void IsAbilityValid(bool* OutValid);
	void IsPlayerGrounded(bool* Result);
	void IsPlayerInWaterVolume(bool* Result, double* waterVolumeTopZ);
	void IsTekArmorUsingAbility_(uint8 ArmorType, bool* Result);
	void IsTekBuffDisabled(bool* bIsDisabled);
	void IsWarping_FOV(bool* Result);
	void Multi_SpawnFX(class UParticleSystem* ParticleTemplate, class USoundBase* Sound, const struct FTransform& Transform, double SoundVolume, double soundPitch);
	void RateLimitedGenesisAbilityWarning();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ResetPlayerFOV();
	void ResetTargetFOV();
	void Server_SetTekAbilityActive(bool newActive);
	void SetCastedArmorPieceRef();
	void SetJetpackOffset(const struct FTransform& AddTransform);
	void SetTekIgnoreLookInput(bool newIgnore);
	void SetTekIgnoreMoveInput(bool newIgnore);
	void Should_Damage_Actor(class AActor* Victim, bool* Result);
	void SpawnFX(class UParticleSystem* EmitterTemplate, struct FTransform& InTransform, class USoundBase* Sound, double VolumeMultiplier, double PitchMultiplier);
	void UpdatePlayerFOV(double intensityRatio, bool warpIn);

	void GetWeaponMesh(class USkeletalMeshComponent** OutMesh) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Buff_TekArmor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Buff_TekArmor_C")
	}
	static class ABuff_TekArmor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuff_TekArmor_C>();
	}
};
DUMPER7_ASSERTS_ABuff_TekArmor_C;

}

