#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Buff_DinoPackLeader

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Buff_DinoPackLeader.Buff_DinoPackLeader_C
// 0x0028 (0x0BE0 - 0x0BB8)
class ABuff_DinoPackLeader_C final : public APrimalBuff
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bDebug;                                            // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC1[0x3];                                      // 0x0BC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           packDebugColor;                                    // 0x0BC4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD4[0x4];                                      // 0x0BD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADino_Character_BP_Pack_C*              OwningPackDino;                                    // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BuffTickServer(float DeltaTime);
	void ExecuteUbergraph_Buff_DinoPackLeader(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Buff_DinoPackLeader_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Buff_DinoPackLeader_C")
	}
	static class ABuff_DinoPackLeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuff_DinoPackLeader_C>();
	}
};
DUMPER7_ASSERTS_ABuff_DinoPackLeader_C;

}

