#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Buff_BeltTorch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_structs.hpp"
#include "ShooterGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Buff_BeltTorch.Buff_BeltTorch_C
// 0x00A8 (0x0C60 - 0x0BB8)
class ABuff_BeltTorch_C final : public APrimalBuff
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NiagaraSystemFPV;                                  // 0x0BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraSystemTPV;                                  // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BeltTorchSM;                                       // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Transform;                                         // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPrimalItem*                            AssociatedTorchItem;                               // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         AssociatedTorchItemID1;                            // 0x0BF0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AssociatedTorchItemID2;                            // 0x0BF4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAreTorchIDsInitialized;                           // 0x0BF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTorchMeshInitialized;                           // 0x0BF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BFA[0x6];                                      // 0x0BFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AShooterWeapon_Melee*                   DefaultTorchWeapon;                                // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        LastTimeConsumedDurability;                        // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ItemPassiveDurabilityConsumptionMultiplier;        // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   TorchColors;                                       // 0x0C18(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	bool                                          bAreTorchColorsInitialized;                        // 0x0C28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C29[0x7];                                      // 0x0C29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 AssociatedWeaponClass;                             // 0x0C30(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFlameColorInitialized;                          // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C39[0x3];                                      // 0x0C39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FlameColorIndex;                                   // 0x0C3C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCascade;                                       // 0x0C40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitializedFromSave;                            // 0x0C41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseFPV;                                           // 0x0C42(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C43[0x5];                                      // 0x0C43(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FPVLightOffset;                                    // 0x0C48(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateVFX();
	void ApplyMeshColorization();
	void AreValidTorchIDs(int32 TorchID1, int32 TorchID2, bool* bAreValid);
	void BPDeactivated(class AActor* ForInstigator);
	TArray<struct FMultiUseEntry> BPGetMultiUseEntries(class APlayerController* ForPC, const TArray<struct FMultiUseEntry>& MultiUseEntries);
	void BPOnInputEvent(EPrimalCharacterInputType inputType);
	bool BPTryMultiUse(class APlayerController* ForPC, int32 UseIndex);
	void BuffTickClient(float DeltaTime);
	void BuffTickServer(float DeltaTime);
	void DeactivateBeltTorch(bool bEquipTorchOnDeactivation);
	void ExecuteUbergraph_Buff_BeltTorch(int32 EntryPoint);
	void InitializeAssociatedWeaponClass(class UClass* WeaponClass);
	void InitializeDefaultTorchWeapon();
	void InitializeTorchFromItem(class UPrimalItem* theItem, class UClass* WeaponClassOverride);
	void InitializeTorchIDs(class UPrimalItem* TorchItem);
	void InitializeTorchItem(bool* bInitialized);
	void InitializeTorchMesh();
	void Server_DeactivateBeltTorch();
	void SetFlameColorIndex(int32 theIndex);
	void SetTorchColorByIndex(const struct FLinearColor& theColor, int32 TheColorIndex);
	void SetTorchColorByIndex_Multicast(const struct FLinearColor& theColor, int32 theIndex);
	void SetTorchFlameColor(const struct FLinearColor& theColor);
	void SetTorchFlameColor_Multicast(const struct FLinearColor& theColor);
	void ShouldDeactivateBuff(bool* bShouldDeactivate);
	void Update_All_Torch_Colors();
	void UpdateTorchColorsArray(class UPrimalItem* ForPrimalItem);
	void UpdateTorchFlameColor();
	void UpdateTorchType(bool FPV);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Buff_BeltTorch_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Buff_BeltTorch_C")
	}
	static class ABuff_BeltTorch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuff_BeltTorch_C>();
	}
};
DUMPER7_ASSERTS_ABuff_BeltTorch_C;

}

