#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Buff_CreativeModeHelper

#include "Basic.hpp"

#include "ShooterGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Buff_Base_OnlyRelevantToOwner_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Buff_CreativeModeHelper.Buff_CreativeModeHelper_C
// 0x0090 (0x0C58 - 0x0BC8)
class ABuff_CreativeModeHelper_C final : public ABuff_Base_OnlyRelevantToOwner_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Buff_CreativeModeHelper_C;          // 0x0BC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DebugReplicationRadius;                            // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DebugServerTraceSpacing;                           // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugReplication;                                  // 0x0BE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFlying;                                          // 0x0BE1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE2[0x6];                                      // 0x0BE2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastModeChangeTime;                                // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumpPressTime;                                     // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OrigMaxFlySpeed;                                   // 0x0BF8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OrigBrakeDecelFlying;                              // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AdminBlinkWeaponItem;                              // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AdminBlinkWeaponWeap;                              // 0x0C10(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 walkstring;                                        // 0x0C38(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, TObjectPtr)
	class FString                                 flystring;                                         // 0x0C48(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, TObjectPtr)

public:
	void BPActivated(class AActor* ForInstigator);
	bool BPCheckPreventInput(EPrimalCharacterInputType inputType);
	void BPDeactivated(class AActor* ForInstigator);
	void BPDrawBuffStatusHUD(class AShooterHUD* HUD, float XPos, float YPos, float ScaleMult);
	void BPSetupForInstigator(class AActor* ForInstigator);
	void BuffTickClient(float DeltaTime);
	void BuffTickServer(float DeltaTime);
	void ClientUpdateFlightStatus(bool IsFlying_0);
	void ExecConsoleCommand(const class FString& Command);
	void ExecuteUbergraph_Buff_CreativeModeHelper(int32 EntryPoint);
	void InpActEvt_ArkGamepadFaceButtonBottom_K2Node_InputActionEvent_0(const struct FKey& Key);
	void InpActEvt_ArkGamepadLeftShoulder_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_ArkGamepadLeftShoulder_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_Ctrl_F1_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_G_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Gamepad_FaceButton_Left_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_Gamepad_RightShoulder_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_Jump_K2Node_InputActionEvent_5(const struct FKey& Key);
	void InpActEvt_Run_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_Run_K2Node_InputActionEvent_4(const struct FKey& Key);
	void IsNotRidingDino(bool* NotRidingDino);
	void MultiReplicationDebugData(const TArray<struct FHitResult>& Hits, const TArray<struct FVector>& HitStarts, const TArray<struct FVector>& HitEnds, const TArray<struct FTransform>& Chars, const struct FVector& Player);
	void NetServerDestroyStructure(class APrimalStructure* StructureToDestroy);
	void ServerRequestReplicationDebugging(bool Enabled);
	void ServerSetFlight(bool IsFlying_0);
	void ServerSetFlySpeed(double NewSpeed);
	void SetFlySpeed(double New_Speed);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Buff_CreativeModeHelper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Buff_CreativeModeHelper_C")
	}
	static class ABuff_CreativeModeHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuff_CreativeModeHelper_C>();
	}
};
DUMPER7_ASSERTS_ABuff_CreativeModeHelper_C;

}

