#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Buff_MinersHelmet

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Buff_MinersHelmet.Buff_MinersHelmet_C.BPClientDoMultiUse
// 0x0010 (0x0010 - 0x0000)
struct Buff_MinersHelmet_C_BPClientDoMultiUse final
{
public:
	class APlayerController*                      ForPC;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ClientUseIndex;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Buff_MinersHelmet_C_BPClientDoMultiUse;

// Function Buff_MinersHelmet.Buff_MinersHelmet_C.BPGetMultiUseEntries
// 0x0138 (0x0138 - 0x0000)
struct Buff_MinersHelmet_C_BPGetMultiUseEntries final
{
public:
	class APlayerController*                      ForPC;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMultiUseEntry>                 MultiUseEntries;                                   // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<struct FMultiUseEntry>                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	struct FMultiUseEntry                         K2Node_MakeStruct_MultiUseEntry;                   // 0x0028(0x0078)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwnerController_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMultiUseEntry                         K2Node_MakeStruct_MultiUseEntry_1;                 // 0x00B8(0x0078)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Buff_MinersHelmet_C_BPGetMultiUseEntries;

// Function Buff_MinersHelmet.Buff_MinersHelmet_C.BPTryMultiUse
// 0x0010 (0x0010 - 0x0000)
struct Buff_MinersHelmet_C_BPTryMultiUse final
{
public:
	class APlayerController*                      ForPC;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         UseIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Buff_MinersHelmet_C_BPTryMultiUse;

// Function Buff_MinersHelmet.Buff_MinersHelmet_C.DisableLight
// 0x0030 (0x0030 - 0x0000)
struct Buff_MinersHelmet_C_DisableLight final
{
public:
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APrimalCharacter*                       K2Node_DynamicCast_AsPrimal_Character;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimalItem*                            CallFunc_GetEquippedItemOfClass_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimalItemArmor_MinersHelmet_C*        K2Node_DynamicCast_AsPrimal_Item_Armor_Miners_Helmet; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Buff_MinersHelmet_C_DisableLight;

// Function Buff_MinersHelmet.Buff_MinersHelmet_C.EnableLight
// 0x0030 (0x0030 - 0x0000)
struct Buff_MinersHelmet_C_EnableLight final
{
public:
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APrimalCharacter*                       K2Node_DynamicCast_AsPrimal_Character;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimalItem*                            CallFunc_GetEquippedItemOfClass_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimalItemArmor_MinersHelmet_C*        K2Node_DynamicCast_AsPrimal_Item_Armor_Miners_Helmet; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Buff_MinersHelmet_C_EnableLight;

// Function Buff_MinersHelmet.Buff_MinersHelmet_C.ExecuteUbergraph_Buff_MinersHelmet
// 0x0018 (0x0018 - 0x0000)
struct Buff_MinersHelmet_C_ExecuteUbergraph_Buff_MinersHelmet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_ForPC;                                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ClientUseIndex;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Buff_MinersHelmet_C_ExecuteUbergraph_Buff_MinersHelmet;

}

