#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: cfcore_ui

#include "Basic.hpp"

#include "cfcore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum cfcore_ui.EViewState
// NumValues: 0x0007
enum class EViewState : uint8
{
	Store                                    = 0,
	ModPage                                  = 1,
	ScreenShot                               = 2,
	Dropdown                                 = 3,
	ServerMods                               = 4,
	Popup                                    = 5,
	EViewState_MAX                           = 6,
};

// Enum cfcore_ui.EGameModsEvent
// NumValues: 0x000C
enum class EGameModsEvent : uint8
{
	EGameModsEvent_ViewRegister              = 0,
	EGameModsEvent_FinishInstalling          = 1,
	EGameModsEvent_Uninstalling              = 2,
	EGameModsEvent_InstallingProgress        = 3,
	EGameModsEvent_InitInstalling            = 4,
	EGameModsEvent_InitUninstalling          = 5,
	EGameModsEvent_AlreadyInstalled          = 6,
	EGameModsEvent_FinishUpdating            = 7,
	EGameModsEvent_SearchMods                = 8,
	EGameModsEvent_MyMods                    = 9,
	EGameModsEvent_CancelInstalling          = 10,
	EGameModsEvent_MAX                       = 11,
};

// Enum cfcore_ui.EInstallStatus
// NumValues: 0x0008
enum class EInstallStatus : uint8
{
	EInstallStatus_Default                   = 0,
	EInstallStatus_Installing                = 1,
	EInstallStatus_Installed                 = 2,
	EInstallStatus_InstalledButNeedsUpdate   = 3,
	EInstallStatus_Updating                  = 4,
	EInstallStatus_Uninstalling              = 5,
	EInstallStatus_InstalledButNeedsUpdateMyMods = 6,
	EInstallStatus_MAX                       = 7,
};

// ScriptStruct cfcore_ui.CFCoreThemeRowData
// 0x00F8 (0x0100 - 0x0008)
struct FCFCoreThemeRowData final : public FTableRowBase
{
public:
	bool                                          RoundedMode;                                       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           MainFont;                                          // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SecondaryFont;                                     // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BackgroundColor;                                   // 0x002C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ClassUnderline;                                    // 0x003C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Button_SignIn;                                     // 0x004C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SideBar;                                           // 0x005C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Button_SideMenu;                                   // 0x006C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Search_SideMenu;                                   // 0x007C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ModWindow;                                         // 0x008C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Button_Install;                                    // 0x009C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Button_Uninstall;                                  // 0x00AC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Button_Update;                                     // 0x00BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ExamineBackground;                                 // 0x00CC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InfoBackground;                                    // 0x00DC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NotificationBackground;                            // 0x00EC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCFCoreThemeRowData;

// ScriptStruct cfcore_ui.ModIdentification
// 0x0010 (0x0010 - 0x0000)
struct FModIdentification final
{
public:
	int64                                         ID;                                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         mainFileId;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FModIdentification;

// ScriptStruct cfcore_ui.ScreenshotInfo
// 0x0020 (0x0020 - 0x0000)
struct FScreenshotInfo final
{
public:
	TArray<class UTexture2DDynamic*>              screenshots;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Descriptions;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FScreenshotInfo;

// ScriptStruct cfcore_ui.InstallProgressMod
// 0x0538 (0x0538 - 0x0000)
struct FInstallProgressMod final
{
public:
	struct FInstalledMod                          mod;                                               // 0x0000(0x0460)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLibraryProgress                       progress;                                          // 0x0460(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A0[0x1];                                      // 0x04A0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EInstallStatus                                installStatus;                                     // 0x04A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A2[0x6];                                      // 0x04A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      DynamicImage;                                      // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UTexture2D*, class FText>          ShowcaseImages;                                    // 0x04B0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FScreenshotInfo                        Screenshots_Info;                                  // 0x0500(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FCategory>                      Categories;                                        // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UWidget*                                ModSlotRef;                                        // 0x0530(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInstallProgressMod;

}

