#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CFCoreUIWidget_MainModShop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "cfcore_structs.hpp"


namespace SDK::Params
{

// Function CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C.DoExit
// 0x0008 (0x0008 - 0x0000)
struct CFCoreUIWidget_MainModShop_C_DoExit final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CFCoreUIWidget_MainModShop_C_DoExit;

// Function CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C.ExecuteUbergraph_CFCoreUIWidget_MainModShop
// 0x04D0 (0x04D0 - 0x0000)
struct CFCoreUIWidget_MainModShop_C_ExecuteUbergraph_CFCoreUIWidget_MainModShop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_forward;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         K2Node_Event_ForModID;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInstalledMod>                  K2Node_CustomEvent_installed_mods;                 // 0x0018(0x0010)(ConstParm, ReferenceParm)
	struct FInstalledMod                          CallFunc_Array_Get_Item;                           // 0x0028(0x0460)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C5[0x3];                                      // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CFCoreUIWidget_MainModShop_C_ExecuteUbergraph_CFCoreUIWidget_MainModShop;

// Function CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C.GamepadChangeTab
// 0x0001 (0x0001 - 0x0000)
struct CFCoreUIWidget_MainModShop_C_GamepadChangeTab final
{
public:
	bool                                          Forward;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CFCoreUIWidget_MainModShop_C_GamepadChangeTab;

// Function CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C.GamepadRequestChangeTab
// 0x0001 (0x0001 - 0x0000)
struct CFCoreUIWidget_MainModShop_C_GamepadRequestChangeTab final
{
public:
	bool                                          Forward;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CFCoreUIWidget_MainModShop_C_GamepadRequestChangeTab;

// Function CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C.GetDiscoveryRef
// 0x0008 (0x0008 - 0x0000)
struct CFCoreUIWidget_MainModShop_C_GetDiscoveryRef final
{
public:
	class UUI_Discovery_C*                        DiscoveryRef;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CFCoreUIWidget_MainModShop_C_GetDiscoveryRef;

// Function CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C.GetDiscoveryScrollBox
// 0x0008 (0x0008 - 0x0000)
struct CFCoreUIWidget_MainModShop_C_GetDiscoveryScrollBox final
{
public:
	class UScrollBox*                             NewParam;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CFCoreUIWidget_MainModShop_C_GetDiscoveryScrollBox;

// Function CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C.GetScrollBox
// 0x0010 (0x0010 - 0x0000)
struct CFCoreUIWidget_MainModShop_C_GetScrollBox final
{
public:
	class UScrollBox*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             CallFunc_GetDiscoveryScrollBox_NewParam;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CFCoreUIWidget_MainModShop_C_GetScrollBox;

// Function CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C.OnBackInstallingCheck
// 0x0010 (0x0010 - 0x0000)
struct CFCoreUIWidget_MainModShop_C_OnBackInstallingCheck final
{
public:
	TArray<struct FInstalledMod>                  installed_mods;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_CFCoreUIWidget_MainModShop_C_OnBackInstallingCheck;

// Function CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C.OnRequestedModPage
// 0x0008 (0x0008 - 0x0000)
struct CFCoreUIWidget_MainModShop_C_OnRequestedModPage final
{
public:
	int64                                         ForModID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CFCoreUIWidget_MainModShop_C_OnRequestedModPage;

// Function CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C.RequestModPage
// 0x0030 (0x0030 - 0x0000)
struct CFCoreUIWidget_MainModShop_C_RequestModPage final
{
public:
	int64                                         modId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_Int64Int64_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_ModPage_C*                          CallFunc_CreateModPageFromID_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CFCoreUIWidget_MainModShop_C_RequestModPage;

// Function CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C.WaitDeeplinkToSpotlight
// 0x0010 (0x0010 - 0x0000)
struct CFCoreUIWidget_MainModShop_C_WaitDeeplinkToSpotlight final
{
public:
	class UUI_Discovery_C*                        CallFunc_GetDiscoveryRef_DiscoveryRef;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CFCoreUIWidget_MainModShop_C_WaitDeeplinkToSpotlight;

}

