#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: cfcore

#include "Basic.hpp"

#include "cfcore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function cfcore.CFCoreBPLibrary.BreakFileSize
// 0x0018 (0x0018 - 0x0000)
struct CFCoreBPLibrary_BreakFileSize final
{
public:
	int64                                         Bytes;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCFCoreFileSize                        ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CFCoreBPLibrary_BreakFileSize;

// Function cfcore.CFCoreBPLibrary.ExtractIdFromExtraData
// 0x0028 (0x0028 - 0x0000)
struct CFCoreBPLibrary_ExtractIdFromExtraData final
{
public:
	class FString                                 InExtraData;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InFieldName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_ExtractIdFromExtraData;

// Function cfcore.CFCoreBPLibrary.FormatFileSize
// 0x0018 (0x0018 - 0x0000)
struct CFCoreBPLibrary_FormatFileSize final
{
public:
	int64                                         Bytes;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_FormatFileSize;

// Function cfcore.CFCoreBPLibrary.MakeApiRequestPagination
// 0x0010 (0x0010 - 0x0000)
struct CFCoreBPLibrary_MakeApiRequestPagination final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         page_size;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCFCoreApiRequestPagination            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_MakeApiRequestPagination;

// Function cfcore.CFCoreBPLibrary.MakeAssureServerModsUpdatedParams
// 0x0040 (0x0040 - 0x0000)
struct CFCoreBPLibrary_MakeAssureServerModsUpdatedParams final
{
public:
	TArray<int64>                                 modIds;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int64>                                 devModIds;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAssureServerModsUpdatedParams         ReturnValue;                                       // 0x0020(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_MakeAssureServerModsUpdatedParams;

// Function cfcore.CFCoreBPLibrary.MakeCreateModFileRequest
// 0x00E8 (0x00E8 - 0x0000)
struct CFCoreBPLibrary_MakeCreateModFileRequest final
{
public:
	ECFCoreChangelogMarkupType                    changelog_type;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 changelog;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int64>                                 gameVersionIds;                                    // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	ECFCoreFileReleaseType                        releaseType;                                       // 0x0048(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModFileCookingOptions                 cookingOptions;                                    // 0x0050(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          isMarkedForManualRelease;                          // 0x0068(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCreateModFileRequest                  ReturnValue;                                       // 0x0070(0x0078)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_MakeCreateModFileRequest;

// Function cfcore.CFCoreBPLibrary.MakeCreateModRequest
// 0x00C0 (0x00C0 - 0x0000)
struct CFCoreBPLibrary_MakeCreateModRequest final
{
public:
	int64                                         class_id;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 summary;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECFCoreMakrupType                             description_type;                                  // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Description;                                       // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         primary_category_id;                               // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int64>                                 game_category_ids;                                 // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          is_experimental;                                   // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCreateModRequest                      ReturnValue;                                       // 0x0060(0x0060)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_MakeCreateModRequest;

// Function cfcore.CFCoreBPLibrary.MakeExternalAuthAdditionalInfo
// 0x0020 (0x0020 - 0x0000)
struct CFCoreBPLibrary_MakeExternalAuthAdditionalInfo final
{
public:
	struct FDateTime                              eulaAcceptTime;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExternalAuthAdditionalInfo            ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_MakeExternalAuthAdditionalInfo;

// Function cfcore.CFCoreBPLibrary.MakeGetCategoriesFilter
// 0x000C (0x000C - 0x0000)
struct CFCoreBPLibrary_MakeGetCategoriesFilter final
{
public:
	int32                                         class_id;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCFCoreGetCategoriesFilter             ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_MakeGetCategoriesFilter;

// Function cfcore.CFCoreBPLibrary.MakeSettings
// 0x0188 (0x0188 - 0x0000)
struct CFCoreBPLibrary_MakeSettings final
{
public:
	class FString                                 default_language;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         game_id;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 api_key;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 mods_directory;                                    // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 user_data_directory;                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         max_concurrent_installations;                      // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCFCoreSettings                        ReturnValue;                                       // 0x0050(0x0138)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_MakeSettings;

// Function cfcore.CFCoreBPLibrary.MakeSettingsFromProjectConfig
// 0x0138 (0x0138 - 0x0000)
struct CFCoreBPLibrary_MakeSettingsFromProjectConfig final
{
public:
	struct FCFCoreSettings                        ReturnValue;                                       // 0x0000(0x0138)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_MakeSettingsFromProjectConfig;

// Function cfcore.CFCoreBPLibrary.MakeUpdateModRequest
// 0x00C0 (0x00C0 - 0x0000)
struct CFCoreBPLibrary_MakeUpdateModRequest final
{
public:
	int64                                         class_id;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 summary;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECFCoreMakrupType                             description_type;                                  // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Description;                                       // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         primary_category_id;                               // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int64>                                 game_category_ids;                                 // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          is_experimental;                                   // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUpdateModRequest                      ReturnValue;                                       // 0x0060(0x0060)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_MakeUpdateModRequest;

// Function cfcore.CFCoreBPLibrary.SplitInstalledMods
// 0x0038 (0x0038 - 0x0000)
struct CFCoreBPLibrary_SplitInstalledMods final
{
public:
	TArray<struct FInstalledMod>                  InInstalledMods;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSplitInstalledModsOptions             InOptions;                                         // 0x0010(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstalledMod>                  OutFirstInstalledMods;                             // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstalledMod>                  OutSecondInstalledMods;                            // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_SplitInstalledMods;

// Function cfcore.CFCoreBPLibrary.UpdateInstalledModsLoadOrder
// 0x0038 (0x0038 - 0x0000)
struct CFCoreBPLibrary_UpdateInstalledModsLoadOrder final
{
public:
	TArray<struct FInstalledMod>                  InInstalledMods;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InModIndexToUpdate;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InNewLoadOrder;                                    // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInstalledMod>                  OutOrderedInstalledMods;                           // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstalledModProperties>        OutOrderedInstalledModsProperties;                 // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreBPLibrary_UpdateInstalledModsLoadOrder;

// Function cfcore.CFCoreSubsystem.AnalyticsSendGamePlaySession
// 0x0048 (0x0048 - 0x0000)
struct CFCoreSubsystem_AnalyticsSendGamePlaySession final
{
public:
	struct FGamePlaySessionParams                 InParams;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnSuccess;                                         // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_AnalyticsSendGamePlaySession;

// Function cfcore.CFCoreSubsystem.AnalyticsSendModBrowsingFunnelAction
// 0x0078 (0x0078 - 0x0000)
struct CFCoreSubsystem_AnalyticsSendModBrowsingFunnelAction final
{
public:
	struct FModBrowsingFunnelParams               InParams;                                          // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnSuccess;                                         // 0x0058(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0068(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_AnalyticsSendModBrowsingFunnelAction;

// Function cfcore.CFCoreSubsystem.AnalyticsSendModBrowsingFunnelImpression
// 0x0078 (0x0078 - 0x0000)
struct CFCoreSubsystem_AnalyticsSendModBrowsingFunnelImpression final
{
public:
	struct FModBrowsingFunnelParams               InParams;                                          // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnSuccess;                                         // 0x0058(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0068(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_AnalyticsSendModBrowsingFunnelImpression;

// Function cfcore.CFCoreSubsystem.ApiEntitlementsRedeemCode
// 0x0030 (0x0030 - 0x0000)
struct CFCoreSubsystem_ApiEntitlementsRedeemCode final
{
public:
	struct FEntitlementsRedeemCodeRequest         InRequest;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FEntitlementCampaign& EntitlementCampaign)> OnSuccess;               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiEntitlementsRedeemCode;

// Function cfcore.CFCoreSubsystem.ApiFinalizePurchase
// 0x0098 (0x0098 - 0x0000)
struct CFCoreSubsystem_ApiFinalizePurchase final
{
public:
	struct FFinalizePurchaseRequest               Request;                                           // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnSuccess;                                         // 0x0078(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0088(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiFinalizePurchase;

// Function cfcore.CFCoreSubsystem.ApiGeneratePremiumCheckoutUrl
// 0x0098 (0x0098 - 0x0000)
struct CFCoreSubsystem_ApiGeneratePremiumCheckoutUrl final
{
public:
	struct FGenPremiumCheckoutUrlRequest          Request;                                           // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& URL)>     OnSuccess;                                         // 0x0078(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0088(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGeneratePremiumCheckoutUrl;

// Function cfcore.CFCoreSubsystem.ApiGenerateTempToken
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_ApiGenerateTempToken final
{
public:
	TDelegate<void(const class FString& temp_user_token)> on_result;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGenerateTempToken;

// Function cfcore.CFCoreSubsystem.ApiGetActiveCookingVersion
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_ApiGetActiveCookingVersion final
{
public:
	TDelegate<void(const int32& Version)>         OnVersion;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetActiveCookingVersion;

// Function cfcore.CFCoreSubsystem.ApiGetBlockedModsDetails
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_ApiGetBlockedModsDetails final
{
public:
	TDelegate<void(const struct FBlockedDetails& blocked_details)> on_result;                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetBlockedModsDetails;

// Function cfcore.CFCoreSubsystem.ApiGetCategories
// 0x0028 (0x0028 - 0x0000)
struct CFCoreSubsystem_ApiGetCategories final
{
public:
	struct FCFCoreGetCategoriesFilter             Filter;                                            // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<struct FCategory>& Categories)> on_results;                          // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetCategories;

// Function cfcore.CFCoreSubsystem.ApiGetFiles
// 0x0030 (0x0030 - 0x0000)
struct CFCoreSubsystem_ApiGetFiles final
{
public:
	TArray<int64>                                 fileIds;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<struct FFile>& files)> OnResults;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetFiles;

// Function cfcore.CFCoreSubsystem.ApiGetGame
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_ApiGetGame final
{
public:
	TDelegate<void(const struct FGame& Game)>     on_game;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetGame;

// Function cfcore.CFCoreSubsystem.ApiGetMe
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_ApiGetMe final
{
public:
	TDelegate<void(const struct FMe& Me)>         on_results;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetMe;

// Function cfcore.CFCoreSubsystem.ApiGetMod
// 0x0028 (0x0028 - 0x0000)
struct CFCoreSubsystem_ApiGetMod final
{
public:
	int64                                         modId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreMod& mod)> on_mod;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetMod;

// Function cfcore.CFCoreSubsystem.ApiGetModDescription
// 0x0028 (0x0028 - 0x0000)
struct CFCoreSubsystem_ApiGetModDescription final
{
public:
	int64                                         modId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& Description)> on_mod_desc;                                   // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetModDescription;

// Function cfcore.CFCoreSubsystem.ApiGetMods
// 0x0030 (0x0030 - 0x0000)
struct CFCoreSubsystem_ApiGetMods final
{
public:
	TArray<int64>                                 modIds;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<struct FCFCoreMod>& mods)> on_results;                               // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetMods;

// Function cfcore.CFCoreSubsystem.ApiGetModsHighlights
// 0x0038 (0x0038 - 0x0000)
struct CFCoreSubsystem_ApiGetModsHighlights final
{
public:
	struct FCFCoreGetModsHighlightsFilter         InFilter;                                          // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FModsHighlights& mods)> OnResults;                                   // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetModsHighlights;

// Function cfcore.CFCoreSubsystem.ApiGetModsHighlightsV2
// 0x0038 (0x0038 - 0x0000)
struct CFCoreSubsystem_ApiGetModsHighlightsV2 final
{
public:
	struct FCFCoreGetModsHighlightsFilter         InFilter;                                          // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FModsHighlightsV2& mods)> OnResults;                                 // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetModsHighlightsV2;

// Function cfcore.CFCoreSubsystem.ApiGetModsHighlightsV3
// 0x0038 (0x0038 - 0x0000)
struct CFCoreSubsystem_ApiGetModsHighlightsV3 final
{
public:
	struct FCFCoreGetModsHighlightsFilter         InFilter;                                          // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FModsHighlightsV3& mods)> OnResults;                                 // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetModsHighlightsV3;

// Function cfcore.CFCoreSubsystem.ApiGetModsSubscriptions
// 0x0028 (0x0028 - 0x0000)
struct CFCoreSubsystem_ApiGetModsSubscriptions final
{
public:
	struct FCFCoreApiRequestPagination            pagination;                                        // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<struct FCFCoreMod>& mods, const struct FCFCoreApiResponsePagination& pagination)> on_subscriptions; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetModsSubscriptions;

// Function cfcore.CFCoreSubsystem.ApiGetMyMods
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_ApiGetMyMods final
{
public:
	TDelegate<void(const TArray<struct FCFCoreMod>& mods)> on_results;                               // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetMyMods;

// Function cfcore.CFCoreSubsystem.ApiGetMyRatings
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_ApiGetMyRatings final
{
public:
	TDelegate<void(const struct FMyRatings& ratings)> on_results;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetMyRatings;

// Function cfcore.CFCoreSubsystem.ApiGetReportingReasons
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_ApiGetReportingReasons final
{
public:
	TDelegate<void(const TArray<struct FReportingReason>& reasons)> on_results;                      // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetReportingReasons;

// Function cfcore.CFCoreSubsystem.ApiGetVersions
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_ApiGetVersions final
{
public:
	TDelegate<void(const TArray<struct FGameVersionsByType>& versions)> on_results;                  // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetVersions;

// Function cfcore.CFCoreSubsystem.ApiGetVersionTypes
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_ApiGetVersionTypes final
{
public:
	TDelegate<void(const TArray<struct FGameVersionType>& version_types)> on_results;                // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiGetVersionTypes;

// Function cfcore.CFCoreSubsystem.ApiInitiatePurchase
// 0x0040 (0x0040 - 0x0000)
struct CFCoreSubsystem_ApiInitiatePurchase final
{
public:
	struct FInitiatePurchaseRequest               Request;                                           // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FPurchaseDetails& purchase_details, const class FString& token)> OnSuccess; // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiInitiatePurchase;

// Function cfcore.CFCoreSubsystem.ApiMatchPlatformFiles
// 0x0030 (0x0030 - 0x0000)
struct CFCoreSubsystem_ApiMatchPlatformFiles final
{
public:
	struct FMatchPlatformFilesFilter              Filter;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<struct FFile>& files)> OnResults;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiMatchPlatformFiles;

// Function cfcore.CFCoreSubsystem.ApiRemoveRating
// 0x0028 (0x0028 - 0x0000)
struct CFCoreSubsystem_ApiRemoveRating final
{
public:
	int64                                         modId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             on_success;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiRemoveRating;

// Function cfcore.CFCoreSubsystem.ApiReportMod
// 0x0040 (0x0040 - 0x0000)
struct CFCoreSubsystem_ApiReportMod final
{
public:
	int64                                         modId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         reasonId;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 report;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             on_reasons;                                        // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiReportMod;

// Function cfcore.CFCoreSubsystem.ApiSearchMods
// 0x0070 (0x0070 - 0x0000)
struct CFCoreSubsystem_ApiSearchMods final
{
public:
	struct FCFCoreSearchModsFilter                Filter;                                            // 0x0000(0x0048)(Parm, NativeAccessSpecifierPublic)
	struct FCFCoreApiRequestPagination            pagination;                                        // 0x0048(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<struct FCFCoreMod>& mods, const struct FCFCoreApiResponsePagination& pagination)> on_results; // 0x0050(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0060(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiSearchMods;

// Function cfcore.CFCoreSubsystem.ApiSubscribe
// 0x0028 (0x0028 - 0x0000)
struct CFCoreSubsystem_ApiSubscribe final
{
public:
	struct FSubscribeRequest                      Request;                                           // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreMod& mod)> on_success;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiSubscribe;

// Function cfcore.CFCoreSubsystem.ApiUnblockMods
// 0x0060 (0x0060 - 0x0000)
struct CFCoreSubsystem_ApiUnblockMods final
{
public:
	struct FUnblockModsRequest                    Request;                                           // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(bool success)>                 OnResult;                                          // 0x0040(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiUnblockMods;

// Function cfcore.CFCoreSubsystem.ApiUnsubscribe
// 0x0028 (0x0028 - 0x0000)
struct CFCoreSubsystem_ApiUnsubscribe final
{
public:
	struct FSubscribeRequest                      Request;                                           // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             on_success;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiUnsubscribe;

// Function cfcore.CFCoreSubsystem.ApiUpdateRating
// 0x0030 (0x0030 - 0x0000)
struct CFCoreSubsystem_ApiUpdateRating final
{
public:
	int64                                         modId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECFCoreRatingVoteDirection                    Direction;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             on_success;                                        // 0x000C(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x001C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CFCoreSubsystem_ApiUpdateRating;

// Function cfcore.CFCoreSubsystem.AssureClientModsUpdated
// 0x0040 (0x0040 - 0x0000)
struct CFCoreSubsystem_AssureClientModsUpdated final
{
public:
	TArray<int64>                                 ServerFileIds;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FModsUpdateProgress& UpdateProgress, const struct FLibraryProgress& ModInstallProgress, const struct FCFCoreMod& mod)> OnProgress; // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<struct FInstalledMod>& installed_mods)> OnUpdated;                   // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_AssureClientModsUpdated;

// Function cfcore.CFCoreSubsystem.AssureServerModsUpdated
// 0x0050 (0x0050 - 0x0000)
struct CFCoreSubsystem_AssureServerModsUpdated final
{
public:
	struct FAssureServerModsUpdatedParams         Params_0;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FModsUpdateProgress& UpdateProgress, const struct FLibraryProgress& ModInstallProgress, const struct FCFCoreMod& mod)> OnProgress; // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<struct FInstalledMod>& installed_mods)> OnUpdated;                   // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_AssureServerModsUpdated;

// Function cfcore.CFCoreSubsystem.BeginPremiumModPurchase
// 0x0010 (0x0010 - 0x0000)
struct CFCoreSubsystem_BeginPremiumModPurchase final
{
public:
	TArray<int64>                                 modIds;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_BeginPremiumModPurchase;

// Function cfcore.CFCoreSubsystem.CancelInstallation
// 0x0028 (0x0028 - 0x0000)
struct CFCoreSubsystem_CancelInstallation final
{
public:
	int64                                         mod_id;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             on_success;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_CancelInstallation;

// Function cfcore.CFCoreSubsystem.CreateCookedModFile
// 0x0070 (0x0070 - 0x0000)
struct CFCoreSubsystem_CreateCookedModFile final
{
public:
	int64                                         modId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         SourceFileId;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCreateCookedModFileRequest            CreateCookedModFileRequest;                        // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 LocalFilenameToUpload;                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int64 mod_file_request_id)>    OnCreateModFileRequestId;                          // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FFileTransferProgress& progress)> OnProgress;                        // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FUploadedModFile& uploaded_file)> OnSuccess;                         // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0060(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_CreateCookedModFile;

// Function cfcore.CFCoreSubsystem.CreateMod
// 0x0090 (0x0090 - 0x0000)
struct CFCoreSubsystem_CreateMod final
{
public:
	struct FCreateModRequest                      create_mod_request;                                // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 avatar_image_filename;                             // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreMod& mod)> on_success;                                        // 0x0070(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0080(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_CreateMod;

// Function cfcore.CFCoreSubsystem.CreateModFile
// 0x00D0 (0x00D0 - 0x0000)
struct CFCoreSubsystem_CreateModFile final
{
public:
	int64                                         modId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCreateModFileRequest                  CreateModFileRequest;                              // 0x0008(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 LocalFilenameToUpload;                             // 0x0080(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int64 mod_file_request_id)>    OnCreateModFileRequestId;                          // 0x0090(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FFileTransferProgress& progress)> OnProgress;                        // 0x00A0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FUploadedModFile& uploaded_file)> OnSuccess;                         // 0x00B0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x00C0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_CreateModFile;

// Function cfcore.CFCoreSubsystem.GenerateAuthToken
// 0x0038 (0x0038 - 0x0000)
struct CFCoreSubsystem_GenerateAuthToken final
{
public:
	class FString                                 email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         security_code;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             on_success;                                        // 0x0014(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0024(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CFCoreSubsystem_GenerateAuthToken;

// Function cfcore.CFCoreSubsystem.GenerateAuthTokenByExternalProvider
// 0x0050 (0x0050 - 0x0000)
struct CFCoreSubsystem_GenerateAuthTokenByExternalProvider final
{
public:
	ECFCoreExternalAuthProvider                   provider;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 external_token;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExternalAuthAdditionalInfo            additional_info;                                   // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             on_success;                                        // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0040(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_GenerateAuthTokenByExternalProvider;

// Function cfcore.CFCoreSubsystem.GetAuthTerms
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_GetAuthTerms final
{
public:
	TDelegate<void(const struct FTerms& Terms)>   on_success;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_GetAuthTerms;

// Function cfcore.CFCoreSubsystem.GetInstalledMods
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_GetInstalledMods final
{
public:
	TDelegate<void(const TArray<struct FInstalledMod>& installed_mods)> on_installed_mods;           // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_GetInstalledMods;

// Function cfcore.CFCoreSubsystem.GetModsDirInfo
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_GetModsDirInfo final
{
public:
	TDelegate<void(const struct FModsDirInfo& ModsDirInfo)> OnModsDirInfo;                           // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_GetModsDirInfo;

// Function cfcore.CFCoreSubsystem.GetMyPremiumMods
// 0x0020 (0x0020 - 0x0000)
struct CFCoreSubsystem_GetMyPremiumMods final
{
public:
	TDelegate<void(const TArray<int64>& modIds)>  OnSuccess;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_GetMyPremiumMods;

// Function cfcore.CFCoreSubsystem.Initialize
// 0x0168 (0x0168 - 0x0000)
struct CFCoreSubsystem_Initialize final
{
public:
	struct FCFCoreSettings                        Settings;                                          // 0x0000(0x0138)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCFCoreInitializationOptions           Options;                                           // 0x0138(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnInitialized;                                     // 0x0148(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> OnError;                                       // 0x0158(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_Initialize;

// Function cfcore.CFCoreSubsystem.InstallMod
// 0x0230 (0x0230 - 0x0000)
struct CFCoreSubsystem_InstallMod final
{
public:
	struct FCFCoreMod                             mod;                                               // 0x0000(0x0200)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLibraryProgress& progress)> on_progress;                            // 0x0200(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FInstalledMod& installed_mod)> on_installed;                         // 0x0210(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FCFCoreError& Error)> on_error;                                      // 0x0220(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CFCoreSubsystem_InstallMod;

// Function cfcore.CFCoreSubsystem.InstallModExtended
// 0x0390 (0x0390 - 0x0000)
