#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CFCoreUIWidget_MainModShop

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"
#include "cfcore_structs.hpp"
#include "Struct_CfcoreUITheme_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CFCoreUIWidget_MainModShop.CFCoreUIWidget_MainModShop_C
// 0x00D8 (0x08A0 - 0x07C8)
class UCFCoreUIWidget_MainModShop_C : public UUIMainModShop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FStruct_CfcoreUITheme                  CFcoreUITheme;                                     // 0x07D0(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int64                                         WaitingToOpen;                                     // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SpotlightDeeplinkTimerHandle;                      // 0x0850(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   StillInstallingDialogMessage;                      // 0x0858(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StillInstallingDialogTitle;                        // 0x0868(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FInstalledMod>                  CachedExitMods;                                    // 0x0878(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 MainWidgetClass;                                   // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 ManMenuMapName;                                    // 0x0890(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, TObjectPtr)

public:
	void ApplyThemeSettingsToAll();
	void DoExit();
	void EscapeClosedOverride();
	void Event_Close_Menu();
	void ExecuteUbergraph_CFCoreUIWidget_MainModShop(int32 EntryPoint);
	void GamepadChangeTab(bool Forward);
	void GamepadRequestChangeTab(bool Forward);
	void GetDiscoveryRef(class UUI_Discovery_C** DiscoveryRef);
	void GetDiscoveryScrollBox(class UScrollBox** NewParam);
	class UScrollBox* GetScrollBox();
	void OnBackInstallingCheck(const TArray<struct FInstalledMod>& installed_mods);
	void OnRequestedModPage(int64 ForModID);
	void OpenPendingModPage();
	void RequestModPage(int64 modId);
	void WaitDeeplinkToSpotlight();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CFCoreUIWidget_MainModShop_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CFCoreUIWidget_MainModShop_C")
	}
	static class UCFCoreUIWidget_MainModShop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCFCoreUIWidget_MainModShop_C>();
	}
};
DUMPER7_ASSERTS_UCFCoreUIWidget_MainModShop_C;

}

