#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosVehicles

#include "Basic.hpp"

#include "ChaosVehicles_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ChaosVehicles.ChaosVehicleMovementComponent.AddForce
// 0x0020 (0x0020 - 0x0000)
struct ChaosVehicleMovementComponent_AddForce final
{
public:
	struct FVector                                Force;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowSubstepping;                                 // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAccelChange;                                      // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_AddForce;

// Function ChaosVehicles.ChaosVehicleMovementComponent.AddForceAtPosition
// 0x0038 (0x0038 - 0x0000)
struct ChaosVehicleMovementComponent_AddForceAtPosition final
{
public:
	struct FVector                                Force;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                position;                                          // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowSubstepping;                                 // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalForce;                                     // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_AddForceAtPosition;

// Function ChaosVehicles.ChaosVehicleMovementComponent.AddImpulse
// 0x0020 (0x0020 - 0x0000)
struct ChaosVehicleMovementComponent_AddImpulse final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVelChange;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_AddImpulse;

// Function ChaosVehicles.ChaosVehicleMovementComponent.AddImpulseAtPosition
// 0x0030 (0x0030 - 0x0000)
struct ChaosVehicleMovementComponent_AddImpulseAtPosition final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                position;                                          // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_AddImpulseAtPosition;

// Function ChaosVehicles.ChaosVehicleMovementComponent.AddTorqueInRadians
// 0x0020 (0x0020 - 0x0000)
struct ChaosVehicleMovementComponent_AddTorqueInRadians final
{
public:
	struct FVector                                Torque;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowSubstepping;                                 // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAccelChange;                                      // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_AddTorqueInRadians;

// Function ChaosVehicles.ChaosVehicleMovementComponent.CalcSteeringInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_CalcSteeringInput final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_CalcSteeringInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.CalcThrottleBrakeInput
// 0x0008 (0x0008 - 0x0000)
struct ChaosVehicleMovementComponent_CalcThrottleBrakeInput final
{
public:
	float                                         ThrottleOut;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrakeOut;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_CalcThrottleBrakeInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.DecreaseThrottleInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_DecreaseThrottleInput final
{
public:
	float                                         ThrottleDelta;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_DecreaseThrottleInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.EnableSelfRighting
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_EnableSelfRighting final
{
public:
	bool                                          InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_EnableSelfRighting;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetBrakeInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_GetBrakeInput final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetBrakeInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetCenterOfMassTransform
// 0x0060 (0x0060 - 0x0000)
struct ChaosVehicleMovementComponent_GetCenterOfMassTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetCenterOfMassTransform;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct ChaosVehicleMovementComponent_GetSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetSkeletalMesh;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetStaticMesh
// 0x0008 (0x0008 - 0x0000)
struct ChaosVehicleMovementComponent_GetStaticMesh final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetStaticMesh;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetSteeringInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_GetSteeringInput final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetSteeringInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetThrottleInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_GetThrottleInput final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetThrottleInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetThrustersInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_GetThrustersInput final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetThrustersInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.IncreaseThrottleInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_IncreaseThrottleInput final
{
public:
	float                                         ThrottleDelta;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_IncreaseThrottleInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.PreTickGT
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_PreTickGT final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_PreTickGT;

// Function ChaosVehicles.ChaosVehicleMovementComponent.ServerUpdateState
// 0x0024 (0x0024 - 0x0000)
struct ChaosVehicleMovementComponent_ServerUpdateState final
{
public:
	float                                         InSteeringInput;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InThrottleInput;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InThrustersInput;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InBrakeInput;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InHandbrakeInput;                                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InCurrentGear;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InRollInput;                                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPitchInput;                                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InYawInput;                                        // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_ServerUpdateState;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetBrakeInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_SetBrakeInput final
{
public:
	float                                         Brake;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetBrakeInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetChangeDownInput
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_SetChangeDownInput final
{
public:
	bool                                          bNewGearDown;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetChangeDownInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetChangeUpInput
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_SetChangeUpInput final
{
public:
	bool                                          bNewGearUp;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetChangeUpInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetHandbrakeInput
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_SetHandbrakeInput final
{
public:
	bool                                          bNewHandbrake;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetHandbrakeInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetParked
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_SetParked final
{
public:
	bool                                          bParked;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetParked;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetPitchInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_SetPitchInput final
{
public:
	float                                         Pitch;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetPitchInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetRequiresControllerForInputs
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_SetRequiresControllerForInputs final
{
public:
	bool                                          bRequiresController;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetRequiresControllerForInputs;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetRollInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_SetRollInput final
{
public:
	float                                         Roll;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetRollInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetSleeping
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_SetSleeping final
{
public:
	bool                                          bEnableSleep;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetSleeping;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetSteeringInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_SetSteeringInput final
{
public:
	float                                         Steering;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetSteeringInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetTargetGear
// 0x0008 (0x0008 - 0x0000)
struct ChaosVehicleMovementComponent_SetTargetGear final
{
public:
	int32                                         GearNum;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImmediate;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetTargetGear;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetThrottleInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_SetThrottleInput final
{
public:
	float                                         Throttle;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetThrottleInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetThrustersInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_SetThrustersInput final
{
public:
	float                                         ThrusterInput;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetThrustersInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetUseAutomaticGears
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_SetUseAutomaticGears final
{
public:
	bool                                          bUseAuto;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetUseAutomaticGears;

// Function ChaosVehicles.ChaosVehicleMovementComponent.SetYawInput
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_SetYawInput final
{
public:
	float                                         Yaw;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_SetYawInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.UpdateSimulation_OnNonOwningClients
// 0x0018 (0x0018 - 0x0000)
struct ChaosVehicleMovementComponent_UpdateSimulation_OnNonOwningClients final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastReplicatedSteeringInput;                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 World_Ref;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_UpdateSimulation_OnNonOwningClients;

// Function ChaosVehicles.ChaosVehicleMovementComponent.CanCreateVehicle
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_CanCreateVehicle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_CanCreateVehicle;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetCurrentGear
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_GetCurrentGear final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetCurrentGear;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetForwardSpeed
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_GetForwardSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetForwardSpeed;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetForwardSpeedMPH
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_GetForwardSpeedMPH final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetForwardSpeedMPH;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetHandbrakeInput
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_GetHandbrakeInput final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetHandbrakeInput;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetMesh
// 0x0008 (0x0008 - 0x0000)
struct ChaosVehicleMovementComponent_GetMesh final
{
public:
	class UMeshComponent*                         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetMesh;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetTargetGear
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleMovementComponent_GetTargetGear final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetTargetGear;

// Function ChaosVehicles.ChaosVehicleMovementComponent.GetUseAutoGears
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_GetUseAutoGears final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_GetUseAutoGears;

// Function ChaosVehicles.ChaosVehicleMovementComponent.HasValidPhysicsState
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_HasValidPhysicsState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_HasValidPhysicsState;

// Function ChaosVehicles.ChaosVehicleMovementComponent.IsParked
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_IsParked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_IsParked;

// Function ChaosVehicles.ChaosVehicleMovementComponent.ShouldCreatePhysicsState
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleMovementComponent_ShouldCreatePhysicsState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleMovementComponent_ShouldCreatePhysicsState;

// Function ChaosVehicles.ChaosVehicleWheel.GetAxleType
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleWheel_GetAxleType final
{
public:
	EAxleType                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleWheel_GetAxleType;

// Function ChaosVehicles.ChaosVehicleWheel.GetRotationAngle
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleWheel_GetRotationAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleWheel_GetRotationAngle;

// Function ChaosVehicles.ChaosVehicleWheel.GetRotationAngularVelocity
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleWheel_GetRotationAngularVelocity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleWheel_GetRotationAngularVelocity;

// Function ChaosVehicles.ChaosVehicleWheel.GetSteerAngle
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleWheel_GetSteerAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleWheel_GetSteerAngle;

// Function ChaosVehicles.ChaosVehicleWheel.GetSuspensionAxis
// 0x0018 (0x0018 - 0x0000)
struct ChaosVehicleWheel_GetSuspensionAxis final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleWheel_GetSuspensionAxis;

// Function ChaosVehicles.ChaosVehicleWheel.GetSuspensionOffset
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleWheel_GetSuspensionOffset final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleWheel_GetSuspensionOffset;

// Function ChaosVehicles.ChaosVehicleWheel.GetWheelAngularVelocity
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleWheel_GetWheelAngularVelocity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleWheel_GetWheelAngularVelocity;

// Function ChaosVehicles.ChaosVehicleWheel.GetWheelRadius
// 0x0004 (0x0004 - 0x0000)
struct ChaosVehicleWheel_GetWheelRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleWheel_GetWheelRadius;

// Function ChaosVehicles.ChaosVehicleWheel.IsInAir
// 0x0001 (0x0001 - 0x0000)
struct ChaosVehicleWheel_IsInAir final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosVehicleWheel_IsInAir;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.BreakWheeledSnapshot
// 0x0160 (0x0160 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_BreakWheeledSnapshot final
{
public:
	struct FWheeledSnaphotData                    Snapshot;                                          // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x00B0(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinearVelocity;                                    // 0x0110(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AngularVelocity;                                   // 0x0128(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectedGear;                                      // 0x0140(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EngineRPM;                                         // 0x0144(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWheelSnapshot>                 WheelSnapshots;                                    // 0x0148(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_BreakWheeledSnapshot;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.BreakWheelSnapshot
// 0x0028 (0x0028 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_BreakWheelSnapshot final
{
public:
	struct FWheelSnapshot                         Snapshot;                                          // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SuspensionOffset;                                  // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelRotationAngle;                                // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteeringAngle;                                     // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelRadius;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelAngularVelocity;                              // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_BreakWheelSnapshot;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.BreakWheelStatus
// 0x00F8 (0x00F8 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_BreakWheelStatus final
{
public:
	struct FWheelStatus                           Status;                                            // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bInContact;                                        // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ContactPoint;                                      // 0x0090(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                      PhysMaterial;                                      // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalizedSuspensionLength;                        // 0x00B0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpringForce;                                       // 0x00B4(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlipAngle;                                         // 0x00B8(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSlipping;                                       // 0x00BC(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SlipMagnitude;                                     // 0x00C0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSkidding;                                       // 0x00C4(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SkidMagnitude;                                     // 0x00C8(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SkidNormal;                                        // 0x00D0(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DriveTorque;                                       // 0x00E8(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrakeTorque;                                       // 0x00EC(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bABSActivated;                                     // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_BreakWheelStatus;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.MakeWheeledSnapshot
// 0x0160 (0x0160 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_MakeWheeledSnapshot final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LinearVelocity;                                    // 0x0060(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AngularVelocity;                                   // 0x0078(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectedGear;                                      // 0x0090(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EngineRPM;                                         // 0x0094(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWheelSnapshot>                 WheelSnapshots;                                    // 0x0098(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWheeledSnaphotData                    ReturnValue;                                       // 0x00B0(0x00B0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_MakeWheeledSnapshot;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.MakeWheelSnapshot
// 0x0028 (0x0028 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_MakeWheelSnapshot final
{
public:
	float                                         SuspensionOffset;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelRotationAngle;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteeringAngle;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelRadius;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelAngularVelocity;                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWheelSnapshot                         ReturnValue;                                       // 0x0014(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_MakeWheelSnapshot;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.MakeWheelStatus
// 0x00F8 (0x00F8 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_MakeWheelStatus final
{
public:
	bool                                          bInContact;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ContactPoint;                                      // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                      PhysMaterial;                                      // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalizedSuspensionLength;                        // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpringForce;                                       // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlipAngle;                                         // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSlipping;                                       // 0x0034(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SlipMagnitude;                                     // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSkidding;                                       // 0x003C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SkidMagnitude;                                     // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SkidNormal;                                        // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DriveTorque;                                       // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrakeTorque;                                       // 0x0064(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bABSActivated;                                     // 0x0068(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWheelStatus                           ReturnValue;                                       // 0x0070(0x0088)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_MakeWheelStatus;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.EnableMechanicalSim
// 0x0001 (0x0001 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_EnableMechanicalSim final
{
public:
	bool                                          InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_EnableMechanicalSim;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.EnableSuspension
// 0x0001 (0x0001 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_EnableSuspension final
{
public:
	bool                                          InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_EnableSuspension;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.EnableWheelFriction
// 0x0001 (0x0001 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_EnableWheelFriction final
{
public:
	bool                                          InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_EnableWheelFriction;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.GetWheelRestingPosition
// 0x0040 (0x0040 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_GetWheelRestingPosition final
{
public:
	struct FChaosWheelSetup                       WheelSetup;                                        // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_GetWheelRestingPosition;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetABSEnabled
// 0x0008 (0x0008 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetABSEnabled final
{
public:
	int32                                         WheelIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetABSEnabled;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetAffectedByBrake
// 0x0008 (0x0008 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetAffectedByBrake final
{
public:
	int32                                         WheelIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetAffectedByBrake;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetAffectedByEngine
// 0x0008 (0x0008 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetAffectedByEngine final
{
public:
	int32                                         WheelIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetAffectedByEngine;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetAffectedByHandbrake
// 0x0008 (0x0008 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetAffectedByHandbrake final
{
public:
	int32                                         WheelIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetAffectedByHandbrake;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetAffectedBySteering
// 0x0008 (0x0008 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetAffectedBySteering final
{
public:
	int32                                         WheelIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetAffectedBySteering;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetBrakeTorque
// 0x0008 (0x0008 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetBrakeTorque final
{
public:
	float                                         BrakeTorque;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WheelIndex;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetBrakeTorque;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetDifferentialFrontRearSplit
// 0x0004 (0x0004 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetDifferentialFrontRearSplit final
{
public:
	float                                         FrontRearSlpit;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetDifferentialFrontRearSplit;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetDownforceCoefficient
// 0x0004 (0x0004 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetDownforceCoefficient final
{
public:
	float                                         DownforceCoeff;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetDownforceCoefficient;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetDragCoefficient
// 0x0004 (0x0004 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetDragCoefficient final
{
public:
	float                                         DragCoeff;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetDragCoefficient;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetDriveTorque
// 0x0008 (0x0008 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetDriveTorque final
{
public:
	float                                         DriveTorque;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WheelIndex;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetDriveTorque;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetMaxEngineTorque
// 0x0004 (0x0004 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetMaxEngineTorque final
{
public:
	float                                         Torque;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetMaxEngineTorque;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetSnapshot
// 0x00B0 (0x00B0 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetSnapshot final
{
public:
	struct FWheeledSnaphotData                    SnapshotIn;                                        // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetSnapshot;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetSuspensionParams
// 0x0018 (0x0018 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetSuspensionParams final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damping;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Preload;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRaise;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDrop;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WheelIndex;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosWheeledVehicleMovementComponent_SetSuspensionParams;

// Function ChaosVehicles.ChaosWheeledVehicleMovementComponent.SetTorqueCombineMethod
// 0x0008 (0x0008 - 0x0000)
struct ChaosWheeledVehicleMovementComponent_SetTorqueCombineMethod final
{
public:
	ETorqueCombineMethod                          InCombineMethod;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
