#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosClothAssetEngine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ClothingSystemRuntimeInterface_structs.hpp"
#include "ClothingSystemRuntimeCommon_structs.hpp"


namespace SDK
{

// Enum ChaosClothAssetEngine.EClothAssetAsyncProperties
// NumValues: 0x0008
enum class EClothAssetAsyncProperties : uint64
{
	None                                     = 0,
	RenderData                               = 1,
	ThumbnailInfo                            = 2,
	ImportedModel                            = 4,
	ClothCollection                          = 8,
	RefSkeleton                              = 16,
	All                                      = 18446744073709551615,
	EClothAssetAsyncProperties_MAX           = 17,
};

// ScriptStruct ChaosClothAssetEngine.ChaosClothAssetLodTransitionDataCache
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FChaosClothAssetLodTransitionDataCache final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChaosClothAssetLodTransitionDataCache;

// ScriptStruct ChaosClothAssetEngine.ChaosClothSimulationLodModel
// 0x01F0 (0x01F0 - 0x0000)
struct FChaosClothSimulationLodModel final
{
public:
	TArray<struct FVector3f>                      Positions;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector3f>                      Normals;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                Indices;                                           // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FClothVertBoneData>             BoneData;                                          // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint16>                                RequiredExtraBoneIndices;                          // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2f>                      PatternPositions;                                  // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                PatternIndices;                                    // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                PatternToWeldedIndices;                            // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x50];                                      // 0x00A0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClothTetherData                       TetherData;                                        // 0x00F0(0x0010)(NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0xF0];                                     // 0x0100(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChaosClothSimulationLodModel;

// ScriptStruct ChaosClothAssetEngine.ChaosClothSimulationModel
// 0x0038 (0x0038 - 0x0000)
struct FChaosClothSimulationModel final
{
public:
	TArray<struct FChaosClothSimulationLodModel>  ClothSimulationLodModels;                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           UsedBoneNames;                                     // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 UsedBoneIndices;                                   // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReferenceBoneIndex;                                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChaosClothSimulationModel;

}

