#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosCaching

#include "Basic.hpp"


namespace SDK::Params
{

// Function ChaosCaching.ChaosCacheManager.EnablePlayback
// 0x0008 (0x0008 - 0x0000)
struct ChaosCacheManager_EnablePlayback final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosCacheManager_EnablePlayback;

// Function ChaosCaching.ChaosCacheManager.EnablePlaybackByCache
// 0x000C (0x000C - 0x0000)
struct ChaosCacheManager_EnablePlaybackByCache final
{
public:
	class FName                                   InCacheName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosCacheManager_EnablePlaybackByCache;

// Function ChaosCaching.ChaosCacheManager.ResetSingleTransform
// 0x0004 (0x0004 - 0x0000)
struct ChaosCacheManager_ResetSingleTransform final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosCacheManager_ResetSingleTransform;

// Function ChaosCaching.ChaosCacheManager.SetCacheCollection
// 0x0008 (0x0008 - 0x0000)
struct ChaosCacheManager_SetCacheCollection final
{
public:
	class UChaosCacheCollection*                  InCacheCollection;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosCacheManager_SetCacheCollection;

// Function ChaosCaching.ChaosCacheManager.SetCurrentTime
// 0x0004 (0x0004 - 0x0000)
struct ChaosCacheManager_SetCurrentTime final
{
public:
	float                                         CurrentTime;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosCacheManager_SetCurrentTime;

// Function ChaosCaching.ChaosCacheManager.SetStartTime
// 0x0004 (0x0004 - 0x0000)
struct ChaosCacheManager_SetStartTime final
{
public:
	float                                         InStartTime;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosCacheManager_SetStartTime;

// Function ChaosCaching.ChaosCacheManager.TriggerComponent
// 0x0008 (0x0008 - 0x0000)
struct ChaosCacheManager_TriggerComponent final
{
public:
	class UPrimitiveComponent*                    InComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosCacheManager_TriggerComponent;

// Function ChaosCaching.ChaosCacheManager.TriggerComponentByCache
// 0x0008 (0x0008 - 0x0000)
struct ChaosCacheManager_TriggerComponentByCache final
{
public:
	class FName                                   InCacheName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosCacheManager_TriggerComponentByCache;

}

