#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterStatusReplicatedBinoculars

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct CharacterStatusReplicatedBinoculars.CharacterStatusReplicatedBinoculars
// 0x0080 (0x0080 - 0x0000)
struct FCharacterStatusReplicatedBinoculars final
{
public:
	double                                        CurrentFood_2_DC19EC034FDA37A721EED0B6ABB3E033;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxFood_4_A5F4CBDF4439E8A0FBD88A97887CC0E7;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentOxygen_6_ED78AD80404584553795B181953A9E24;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxOxygen_8_8C5113464079DCCEBBF150B3B3508FA9;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentStamina_10_8264A562485F6EE7FA3AA4967FA66581; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxStamina_12_809881BE4D89FF2D364288BF107D01CE;    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentWeight_14_DACD05BF45974965209F818EE88F10B7; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxWeight_16_0FA5802B4EF85950C2E8C5A90B56BE38;     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MeleeDamage_18_EE908D7D4D1C2F664DE9FAB35B83616B;   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovementSpeed_20_E8405D474EDF76F279B1AAAB93A7BC7C; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 StatPoints_24_F8D836C54208A73A1339E2BC104314D2;    // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 MutationPoints_28_EB803ADA4F695A6105C3398CF58EA668; // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 TamedPoints_30_37BF8933471D08E002A8E9BDFA7EB52C;   // 0x0070(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FCharacterStatusReplicatedBinoculars;

}

