#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterViewPanel_CosmeticUI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CharacterViewPanel_CosmeticUI.CharacterViewPanel_CosmeticUI_C.ExecuteUbergraph_CharacterViewPanel_CosmeticUI
// 0x0040 (0x0040 - 0x0000)
struct CharacterViewPanel_CosmeticUI_C_ExecuteUbergraph_CharacterViewPanel_CosmeticUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterViewPanel_CosmeticUI_C_ExecuteUbergraph_CharacterViewPanel_CosmeticUI;

// Function CharacterViewPanel_CosmeticUI.CharacterViewPanel_CosmeticUI_C.Tick
// 0x003C (0x003C - 0x0000)
struct CharacterViewPanel_CosmeticUI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CharacterViewPanel_CosmeticUI_C_Tick;

}

