#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatBoxUI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ChatBoxUI.ChatBoxUI_C.ExecuteUbergraph_ChatBoxUI
// 0x0008 (0x0008 - 0x0000)
struct ChatBoxUI_C_ExecuteUbergraph_ChatBoxUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGamepadActive;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChatBoxUI_C_ExecuteUbergraph_ChatBoxUI;

// Function ChatBoxUI.ChatBoxUI_C.OnGamepadActiveChangedBP
// 0x0001 (0x0001 - 0x0000)
struct ChatBoxUI_C_OnGamepadActiveChangedBP final
{
public:
	bool                                          bIsGamepadActive;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChatBoxUI_C_OnGamepadActiveChangedBP;

// Function ChatBoxUI.ChatBoxUI_C.Switch Chat Mode
// 0x0010 (0x0010 - 0x0000)
struct ChatBoxUI_C_Switch_Chat_Mode final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChatBoxUI_C_Switch_Chat_Mode;

}

