#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chooser

#include "Basic.hpp"

#include "BlendStack_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum Chooser.EBoolColumnCellValue
// NumValues: 0x0004
enum class EBoolColumnCellValue : uint8
{
	MatchFalse                               = 0,
	MatchTrue                                = 1,
	MatchAny                                 = 2,
	EBoolColumnCellValue_MAX                 = 3,
};

// Enum Chooser.EContextObjectDirection
// NumValues: 0x0004
enum class EContextObjectDirection : uint32
{
	Read                                     = 0,
	Write                                    = 1,
	ReadWrite                                = 2,
	EContextObjectDirection_MAX              = 3,
};

// Enum Chooser.EEnumColumnCellValueComparison
// NumValues: 0x0005
enum class EEnumColumnCellValueComparison : uint32
{
	MatchEqual                               = 0,
	MatchNotEqual                            = 1,
	MatchAny                                 = 2,
	Modulus                                  = 3,
	EEnumColumnCellValueComparison_MAX       = 4,
};

// Enum Chooser.EGameplayTagMatchDirection
// NumValues: 0x0003
enum class EGameplayTagMatchDirection : uint8
{
	RowValueInInput                          = 0,
	InputInRowValue                          = 1,
	EGameplayTagMatchDirection_MAX           = 2,
};

// Enum Chooser.EObjectChooserResultType
// NumValues: 0x0003
enum class EObjectChooserResultType : uint32
{
	ObjectResult                             = 0,
	ClassResult                              = 1,
	EObjectChooserResultType_MAX             = 2,
};

// Enum Chooser.EObjectClassColumnCellValueComparison
// NumValues: 0x0006
enum class EObjectClassColumnCellValueComparison : uint32
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	SubClassOf                               = 2,
	NotSubClassOf                            = 3,
	Any                                      = 4,
	EObjectClassColumnCellValueComparison_MAX = 5,
};

// Enum Chooser.EObjectColumnCellValueComparison
// NumValues: 0x0005
enum class EObjectColumnCellValueComparison : uint32
{
	MatchEqual                               = 0,
	MatchNotEqual                            = 1,
	MatchAny                                 = 2,
	Modulus                                  = 3,
	EObjectColumnCellValueComparison_MAX     = 4,
};

// Enum Chooser.EChooserEvaluationFrequency
// NumValues: 0x0005
enum class EChooserEvaluationFrequency : uint32
{
	OnInitialUpdate                          = 0,
	OnBecomeRelevant                         = 1,
	OnLoop                                   = 2,
	OnUpdate                                 = 3,
	EChooserEvaluationFrequency_MAX          = 4,
};

// ScriptStruct Chooser.ChooserParameterBase
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FChooserParameterBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChooserParameterBase;

// ScriptStruct Chooser.ChooserParameterBoolBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterBoolBase : public FChooserParameterBase
{
};
DUMPER7_ASSERTS_FChooserParameterBoolBase;

// ScriptStruct Chooser.ChooserPropertyBinding
// 0x0028 (0x0028 - 0x0000)
struct FChooserPropertyBinding
{
public:
	TArray<class FName>                           PropertyBindingChain;                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ContextIndex;                                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBoundToRoot;                                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x13];                                      // 0x0015(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChooserPropertyBinding;

// ScriptStruct Chooser.BoolContextProperty
// 0x0038 (0x0040 - 0x0008)
struct FBoolContextProperty final : public FChooserParameterBoolBase
{
public:
	TArray<class FName>                           PropertyBindingChain;                              // 0x0008(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	struct FChooserPropertyBinding                Binding;                                           // 0x0018(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBoolContextProperty;

// ScriptStruct Chooser.ChooserColumnBase
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FChooserColumnBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChooserColumnBase;

// ScriptStruct Chooser.BoolColumn
// 0x0020 (0x0028 - 0x0008)
struct FBoolColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<EBoolColumnCellValue>                  RowValuesWithAny;                                  // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBoolColumn;

// ScriptStruct Chooser.ChooserEnumPropertyBinding
// 0x0000 (0x0028 - 0x0028)
struct FChooserEnumPropertyBinding final : public FChooserPropertyBinding
{
};
DUMPER7_ASSERTS_FChooserEnumPropertyBinding;

// ScriptStruct Chooser.ChooserObjectPropertyBinding
// 0x0000 (0x0028 - 0x0028)
struct FChooserObjectPropertyBinding final : public FChooserPropertyBinding
{
};
DUMPER7_ASSERTS_FChooserObjectPropertyBinding;

// ScriptStruct Chooser.ChooserStructPropertyBinding
// 0x0000 (0x0028 - 0x0028)
struct FChooserStructPropertyBinding final : public FChooserPropertyBinding
{
};
DUMPER7_ASSERTS_FChooserStructPropertyBinding;

// ScriptStruct Chooser.ContextObjectTypeBase
// 0x0004 (0x0004 - 0x0000)
struct FContextObjectTypeBase
{
public:
	EContextObjectDirection                       Direction;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FContextObjectTypeBase;

// ScriptStruct Chooser.ContextObjectTypeClass
// 0x000C (0x0010 - 0x0004)
struct FContextObjectTypeClass final : public FContextObjectTypeBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    Class;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FContextObjectTypeClass;

// ScriptStruct Chooser.ContextObjectTypeStruct
// 0x000C (0x0010 - 0x0004)
struct FContextObjectTypeStruct final : public FContextObjectTypeBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          Struct;                                            // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FContextObjectTypeStruct;

// ScriptStruct Chooser.ChooserParameterEnumBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterEnumBase : public FChooserParameterBase
{
};
DUMPER7_ASSERTS_FChooserParameterEnumBase;

// ScriptStruct Chooser.EnumContextProperty
// 0x0038 (0x0040 - 0x0008)
struct FEnumContextProperty final : public FChooserParameterEnumBase
{
public:
	TArray<class FName>                           PropertyBindingChain;                              // 0x0008(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	struct FChooserEnumPropertyBinding            Binding;                                           // 0x0018(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEnumContextProperty;

// ScriptStruct Chooser.ChooserEnumRowData
// 0x0008 (0x0008 - 0x0000)
struct FChooserEnumRowData final
{
public:
	EEnumColumnCellValueComparison                Comparison;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Value;                                             // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChooserEnumRowData;

// ScriptStruct Chooser.EnumColumnBase
// 0x0000 (0x0008 - 0x0008)
struct FEnumColumnBase : public FChooserColumnBase
{
};
DUMPER7_ASSERTS_FEnumColumnBase;

// ScriptStruct Chooser.EnumColumn
// 0x0020 (0x0028 - 0x0008)
struct FEnumColumn final : public FEnumColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FChooserEnumRowData>            RowValues;                                         // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEnumColumn;

// ScriptStruct Chooser.ChooserFloatDistanceRowData
// 0x0004 (0x0004 - 0x0000)
struct FChooserFloatDistanceRowData final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChooserFloatDistanceRowData;

// ScriptStruct Chooser.FloatDistanceColumn
// 0x0040 (0x0048 - 0x0008)
struct FFloatDistanceColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	double                                        MaxDistance;                                       // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CostMultiplier;                                    // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFilterOverMaxDistance;                            // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWrapInput;                                        // 0x0025(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinValue;                                          // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MaxValue;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChooserFloatDistanceRowData>   RowValues;                                         // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFloatDistanceColumn;

// ScriptStruct Chooser.ChooserParameterFloatBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterFloatBase : public FChooserParameterBase
{
};
DUMPER7_ASSERTS_FChooserParameterFloatBase;

// ScriptStruct Chooser.FloatContextProperty
// 0x0038 (0x0040 - 0x0008)
struct FFloatContextProperty final : public FChooserParameterFloatBase
{
public:
	TArray<class FName>                           PropertyBindingChain;                              // 0x0008(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	struct FChooserPropertyBinding                Binding;                                           // 0x0018(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFloatContextProperty;

// ScriptStruct Chooser.ChooserFloatRangeRowData
// 0x000C (0x000C - 0x0000)
struct FChooserFloatRangeRowData final
{
public:
	float                                         min_0;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         max_0;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoMin;                                            // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoMax;                                            // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChooserFloatRangeRowData;

// ScriptStruct Chooser.FloatRangeColumn
// 0x0038 (0x0040 - 0x0008)
struct FFloatRangeColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	bool                                          bWrapInput;                                        // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinValue;                                          // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MaxValue;                                          // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChooserFloatRangeRowData>      RowValues;                                         // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFloatRangeColumn;

// ScriptStruct Chooser.ChooserParameterGameplayTagBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterGameplayTagBase : public FChooserParameterBase
{
};
DUMPER7_ASSERTS_FChooserParameterGameplayTagBase;

// ScriptStruct Chooser.GameplayTagContextProperty
// 0x0038 (0x0040 - 0x0008)
struct FGameplayTagContextProperty final : public FChooserParameterGameplayTagBase
{
public:
	TArray<class FName>                           PropertyBindingChain;                              // 0x0008(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	struct FChooserPropertyBinding                Binding;                                           // 0x0018(0x0028)(Edit, NoClear, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameplayTagContextProperty;

// ScriptStruct Chooser.GameplayTagColumn
// 0x0028 (0x0030 - 0x0008)
struct FGameplayTagColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
	EGameplayContainerMatchType                   TagMatchType;                                      // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayTagMatchDirection                    TagMatchDirection;                                 // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchExact;                                       // 0x001A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvertMatchingLogic;                              // 0x001B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTagContainer>          RowValues;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameplayTagColumn;

// ScriptStruct Chooser.ChooserParameterObjectBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterObjectBase : public FChooserParameterBase
{
};
DUMPER7_ASSERTS_FChooserParameterObjectBase;

// ScriptStruct Chooser.ChooserRandomizationContext
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FChooserRandomizationContext final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChooserRandomizationContext;

// ScriptStruct Chooser.ChooserParameterRandomizeBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterRandomizeBase : public FChooserParameterBase
{
};
DUMPER7_ASSERTS_FChooserParameterRandomizeBase;

// ScriptStruct Chooser.ChooserParameterStructBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterStructBase : public FChooserParameterBase
{
};
DUMPER7_ASSERTS_FChooserParameterStructBase;

// ScriptStruct Chooser.ChooserEvaluationInputObject
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FChooserEvaluationInputObject final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChooserEvaluationInputObject;

// ScriptStruct Chooser.ChooserEvaluationContext
// 0x0078 (0x0078 - 0x0000)
struct alignas(0x08) FChooserEvaluationContext final
{
public:
	uint8                                         Pad_0[0x78];                                       // 0x0000(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChooserEvaluationContext;

// ScriptStruct Chooser.ObjectChooserBase
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FObjectChooserBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FObjectChooserBase;

// ScriptStruct Chooser.ChooserMultiEnumRowData
// 0x0004 (0x0004 - 0x0000)
struct FChooserMultiEnumRowData final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChooserMultiEnumRowData;

// ScriptStruct Chooser.MultiEnumColumn
// 0x0020 (0x0028 - 0x0008)
struct FMultiEnumColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FChooserMultiEnumRowData>       RowValues;                                         // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMultiEnumColumn;

// ScriptStruct Chooser.AssetChooser
// 0x0008 (0x0010 - 0x0008)
struct FAssetChooser final : public FObjectChooserBase
{
public:
	class UObject*                                Asset;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FAssetChooser;

// ScriptStruct Chooser.SoftAssetChooser
// 0x0028 (0x0030 - 0x0008)
struct FSoftAssetChooser final : public FObjectChooserBase
{
public:
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSoftAssetChooser;

// ScriptStruct Chooser.ClassChooser
// 0x0008 (0x0010 - 0x0008)
struct FClassChooser final : public FObjectChooserBase
{
public:
	TSubclassOf<class UObject>                    Class;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FClassChooser;

// ScriptStruct Chooser.ChooserObjectClassRowData
// 0x0010 (0x0010 - 0x0000)
struct FChooserObjectClassRowData final
{
public:
	EObjectClassColumnCellValueComparison         Comparison;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    Value;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FChooserObjectClassRowData;

// ScriptStruct Chooser.ObjectClassColumn
// 0x0020 (0x0028 - 0x0008)
struct FObjectClassColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FChooserObjectClassRowData>     RowValues;                                         // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FObjectClassColumn;

// ScriptStruct Chooser.ObjectContextProperty
// 0x0028 (0x0030 - 0x0008)
struct FObjectContextProperty final : public FChooserParameterObjectBase
{
public:
	struct FChooserObjectPropertyBinding          Binding;                                           // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FObjectContextProperty;

// ScriptStruct Chooser.ChooserObjectRowData
// 0x0030 (0x0030 - 0x0000)
struct FChooserObjectRowData final
{
public:
	EObjectColumnCellValueComparison              Comparison;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 Value;                                             // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChooserObjectRowData;

// ScriptStruct Chooser.ObjectColumn
// 0x0020 (0x0028 - 0x0008)
struct FObjectColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FChooserObjectRowData>          RowValues;                                         // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FObjectColumn;

// ScriptStruct Chooser.OutputBoolColumn
// 0x0028 (0x0030 - 0x0008)
struct FOutputBoolColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	bool                                          bFallbackValue;                                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  RowValues;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOutputBoolColumn;

// ScriptStruct Chooser.ChooserOutputEnumRowData
// 0x0001 (0x0001 - 0x0000)
struct FChooserOutputEnumRowData final
{
public:
	uint8                                         Value;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChooserOutputEnumRowData;

// ScriptStruct Chooser.OutputEnumColumn
// 0x0028 (0x0030 - 0x0008)
struct FOutputEnumColumn final : public FEnumColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	struct FChooserOutputEnumRowData              FallbackValue;                                     // 0x0018(0x0001)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChooserOutputEnumRowData>      RowValues;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOutputEnumColumn;

// ScriptStruct Chooser.OutputFloatColumn
// 0x0028 (0x0030 - 0x0008)
struct FOutputFloatColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
	double                                        FallbackValue;                                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<double>                                RowValues;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOutputFloatColumn;

// ScriptStruct Chooser.ChooserOutputObjectRowData
// 0x0010 (0x0010 - 0x0000)
struct FChooserOutputObjectRowData final
{
public:
	struct FInstancedStruct                       Value;                                             // 0x0000(0x0010)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChooserOutputObjectRowData;

// ScriptStruct Chooser.OutputObjectColumn
// 0x0030 (0x0038 - 0x0008)
struct FOutputObjectColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FChooserOutputObjectRowData>    RowValues;                                         // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FChooserOutputObjectRowData            FallbackValue;                                     // 0x0028(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOutputObjectColumn;

// ScriptStruct Chooser.StructContextProperty
// 0x0028 (0x0030 - 0x0008)
struct FStructContextProperty final : public FChooserParameterStructBase
{
public:
	struct FChooserStructPropertyBinding          Binding;                                           // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStructContextProperty;

// ScriptStruct Chooser.OutputStructColumn
// 0x0030 (0x0038 - 0x0008)
struct FOutputStructColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       FallbackValue;                                     // 0x0018(0x0010)(NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               RowValues;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOutputStructColumn;

// ScriptStruct Chooser.RandomizeContextProperty
// 0x0028 (0x0030 - 0x0008)
struct FRandomizeContextProperty final : public FChooserParameterRandomizeBase
{
public:
	struct FChooserPropertyBinding                Binding;                                           // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRandomizeContextProperty;

// ScriptStruct Chooser.RandomizeColumn
// 0x0028 (0x0030 - 0x0008)
struct FRandomizeColumn final : public FChooserColumnBase
{
public:
	struct FInstancedStruct                       InputValue;                                        // 0x0008(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	float                                         RepeatProbabilityMultiplier;                       // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EqualCostThreshold;                                // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 RowValues;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRandomizeColumn;

// ScriptStruct Chooser.AnimCurveOverride
// 0x000C (0x000C - 0x0000)
struct FAnimCurveOverride final
{
public:
	class FName                                   CurveName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurveValue;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAnimCurveOverride;

// ScriptStruct Chooser.AnimCurveOverrideList
// 0x0018 (0x0018 - 0x0000)
struct FAnimCurveOverrideList final
{
public:
	TArray<struct FAnimCurveOverride>             Values;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        Hash;                                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimCurveOverrideList;

// ScriptStruct Chooser.ChooserPlayerSettings
// 0x0040 (0x0040 - 0x0000)
struct FChooserPlayerSettings final
{
public:
	bool                                          bMirror;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceLooping;                                     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackRate;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimCurveOverrideList                 CurveOverrides;                                    // 0x0010(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          BlendProfile;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	EAlphaBlendOption                             BlendOption;                                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseInertialBlend;                                 // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChooserPlayerSettings;

// ScriptStruct Chooser.AnimNode_ChooserPlayer
// 0x0188 (0x0248 - 0x00C0)
struct FAnimNode_ChooserPlayer final : public FAnimNode_BlendStack_Standalone
{
public:
	uint8                                         Pad_C0[0x20];                                      // 0x00C0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	EChooserEvaluationFrequency                   EvaluationFrequency;                               // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       Chooser;                                           // 0x00E8(0x0010)(Edit, NativeAccessSpecifierPublic)
	class UMirrorDataTable*                       MirrorDataTable;                                   // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	float                                         BlendSpaceX;                                       // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendSpaceY;                                       // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChooserPlayerSettings                 DefaultSettings;                                   // 0x0110(0x0040)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ChooserContextDefinition;                          // 0x0150(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bStartFromMatchingPose;                            // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0xE7];                                     // 0x0161(0x00E7)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_ChooserPlayer;

// ScriptStruct Chooser.NestedChooser
// 0x0008 (0x0010 - 0x0008)
struct FNestedChooser final : public FObjectChooserBase
{
public:
	class UChooserTable*                          Chooser;                                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FNestedChooser;

// ScriptStruct Chooser.EvaluateChooser
// 0x0008 (0x0010 - 0x0008)
struct FEvaluateChooser final : public FObjectChooserBase
{
public:
	class UChooserTable*                          Chooser;                                           // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FEvaluateChooser;

}

