#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chooser

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Chooser_structs.hpp"


namespace SDK::Params
{

// Function Chooser.ChooserTable.ResultAssetFilter
// 0x0070 (0x0070 - 0x0000)
struct ChooserTable_ResultAssetFilter final
{
public:
	struct FAssetData                             AssetData;                                         // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChooserTable_ResultAssetFilter;

// Function Chooser.ChooserFunctionLibrary.AddChooserObjectInput
// 0x0080 (0x0080 - 0x0000)
struct ChooserFunctionLibrary_AddChooserObjectInput final
{
public:
	struct FChooserEvaluationContext              Context;                                           // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0078(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChooserFunctionLibrary_AddChooserObjectInput;

// Function Chooser.ChooserFunctionLibrary.AddChooserStructInput
// 0x0080 (0x0080 - 0x0000)
struct ChooserFunctionLibrary_AddChooserStructInput final
{
public:
	struct FChooserEvaluationContext              Context;                                           // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0078(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChooserFunctionLibrary_AddChooserStructInput;

// Function Chooser.ChooserFunctionLibrary.EvaluateChooser
// 0x0020 (0x0020 - 0x0000)
struct ChooserFunctionLibrary_EvaluateChooser final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UChooserTable*                    ChooserTable;                                      // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ObjectClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChooserFunctionLibrary_EvaluateChooser;

// Function Chooser.ChooserFunctionLibrary.EvaluateChooserMulti
// 0x0028 (0x0028 - 0x0000)
struct ChooserFunctionLibrary_EvaluateChooserMulti final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UChooserTable*                    ChooserTable;                                      // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ObjectClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChooserFunctionLibrary_EvaluateChooserMulti;

// Function Chooser.ChooserFunctionLibrary.EvaluateObjectChooserBase
// 0x00A0 (0x00A0 - 0x0000)
struct ChooserFunctionLibrary_EvaluateObjectChooserBase final
{
public:
	struct FChooserEvaluationContext              Context;                                           // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ObjectChooser;                                     // 0x0078(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ObjectClass;                                       // 0x0088(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResultIsClass;                                    // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChooserFunctionLibrary_EvaluateObjectChooserBase;

// Function Chooser.ChooserFunctionLibrary.EvaluateObjectChooserBaseMulti
// 0x00A8 (0x00A8 - 0x0000)
struct ChooserFunctionLibrary_EvaluateObjectChooserBaseMulti final
{
public:
	struct FChooserEvaluationContext              Context;                                           // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ObjectChooser;                                     // 0x0078(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ObjectClass;                                       // 0x0088(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResultIsClass;                                    // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        ReturnValue;                                       // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChooserFunctionLibrary_EvaluateObjectChooserBaseMulti;

// Function Chooser.ChooserFunctionLibrary.GetChooserStructOutput
// 0x0080 (0x0080 - 0x0000)
struct ChooserFunctionLibrary_GetChooserStructOutput final
{
public:
	struct FChooserEvaluationContext              Context;                                           // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0078(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x007C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChooserFunctionLibrary_GetChooserStructOutput;

// Function Chooser.ChooserFunctionLibrary.MakeChooserEvaluationContext
// 0x0078 (0x0078 - 0x0000)
struct ChooserFunctionLibrary_MakeChooserEvaluationContext final
{
public:
	struct FChooserEvaluationContext              ReturnValue;                                       // 0x0000(0x0078)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChooserFunctionLibrary_MakeChooserEvaluationContext;

// Function Chooser.ChooserFunctionLibrary.MakeEvaluateChooser
// 0x0018 (0x0018 - 0x0000)
struct ChooserFunctionLibrary_MakeEvaluateChooser final
{
public:
	class UChooserTable*                          Chooser;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChooserFunctionLibrary_MakeEvaluateChooser;

}

