#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chooser

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Chooser_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Chooser.ChooserParameterBool_ContextProperty
// 0x0018 (0x0040 - 0x0028)
class UChooserParameterBool_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserParameterBool_ContextProperty")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserParameterBool_ContextProperty")
	}
	static class UChooserParameterBool_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterBool_ContextProperty>();
	}
};
DUMPER7_ASSERTS_UChooserParameterBool_ContextProperty;

// Class Chooser.ChooserColumnBool
// 0x0028 (0x0050 - 0x0028)
class UChooserColumnBool final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterBool> InputValue;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                  RowValues;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserColumnBool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserColumnBool")
	}
	static class UChooserColumnBool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnBool>();
	}
};
DUMPER7_ASSERTS_UChooserColumnBool;

// Class Chooser.ChooserParameterEnum_ContextProperty
// 0x0018 (0x0040 - 0x0028)
class UChooserParameterEnum_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserParameterEnum_ContextProperty")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserParameterEnum_ContextProperty")
	}
	static class UChooserParameterEnum_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterEnum_ContextProperty>();
	}
};
DUMPER7_ASSERTS_UChooserParameterEnum_ContextProperty;

// Class Chooser.ChooserColumnEnum
// 0x0028 (0x0050 - 0x0028)
class UChooserColumnEnum final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterEnum> InputValue;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChooserEnumRowData>            RowValues;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserColumnEnum")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserColumnEnum")
	}
	static class UChooserColumnEnum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnEnum>();
	}
};
DUMPER7_ASSERTS_UChooserColumnEnum;

// Class Chooser.FloatAutoPopulator
// 0x0000 (0x0028 - 0x0028)
class UFloatAutoPopulator final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FloatAutoPopulator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FloatAutoPopulator")
	}
	static class UFloatAutoPopulator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatAutoPopulator>();
	}
};
DUMPER7_ASSERTS_UFloatAutoPopulator;

// Class Chooser.ChooserParameterFloat_ContextProperty
// 0x0018 (0x0040 - 0x0028)
class UChooserParameterFloat_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserParameterFloat_ContextProperty")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserParameterFloat_ContextProperty")
	}
	static class UChooserParameterFloat_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterFloat_ContextProperty>();
	}
};
DUMPER7_ASSERTS_UChooserParameterFloat_ContextProperty;

// Class Chooser.ChooserColumnFloatRange
// 0x0028 (0x0050 - 0x0028)
class UChooserColumnFloatRange final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterFloat> InputValue;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChooserFloatRangeRowData>      RowValues;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserColumnFloatRange")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserColumnFloatRange")
	}
	static class UChooserColumnFloatRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnFloatRange>();
	}
};
DUMPER7_ASSERTS_UChooserColumnFloatRange;

// Class Chooser.ChooserParameterGameplayTag_ContextProperty
// 0x0018 (0x0040 - 0x0028)
class UChooserParameterGameplayTag_ContextProperty final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PropertyBindingChain;                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserParameterGameplayTag_ContextProperty")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserParameterGameplayTag_ContextProperty")
	}
	static class UChooserParameterGameplayTag_ContextProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserParameterGameplayTag_ContextProperty>();
	}
};
DUMPER7_ASSERTS_UChooserParameterGameplayTag_ContextProperty;

// Class Chooser.ChooserColumnGameplayTag
// 0x0030 (0x0058 - 0x0028)
class UChooserColumnGameplayTag final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IChooserParameterGameplayTag> InputValue;                                 // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayContainerMatchType                   TagMatchType;                                      // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTagContainer>          RowValues;                                         // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserColumnGameplayTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserColumnGameplayTag")
	}
	static class UChooserColumnGameplayTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnGameplayTag>();
	}
};
DUMPER7_ASSERTS_UChooserColumnGameplayTag;

// Class Chooser.ChooserColumn
// 0x0000 (0x0000 - 0x0000)
class IChooserColumn final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserColumn")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserColumn")
	}
	static class IChooserColumn* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserColumn>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IChooserColumn;

// Class Chooser.ChooserParameterBool
// 0x0000 (0x0000 - 0x0000)
class IChooserParameterBool final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserParameterBool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserParameterBool")
	}
	static class IChooserParameterBool* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterBool>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IChooserParameterBool;

// Class Chooser.ChooserParameterEnum
// 0x0000 (0x0000 - 0x0000)
class IChooserParameterEnum final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserParameterEnum")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserParameterEnum")
	}
	static class IChooserParameterEnum* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterEnum>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IChooserParameterEnum;

// Class Chooser.ChooserParameterFloat
// 0x0000 (0x0000 - 0x0000)
class IChooserParameterFloat final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserParameterFloat")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserParameterFloat")
	}
	static class IChooserParameterFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterFloat>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IChooserParameterFloat;

// Class Chooser.ChooserParameterGameplayTag
// 0x0000 (0x0000 - 0x0000)
class IChooserParameterGameplayTag final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserParameterGameplayTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserParameterGameplayTag")
	}
	static class IChooserParameterGameplayTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterGameplayTag>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IChooserParameterGameplayTag;

// Class Chooser.HasContextClass
// 0x0000 (0x0000 - 0x0000)
class IHasContextClass final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HasContextClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HasContextClass")
	}
	static class IHasContextClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHasContextClass>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IHasContextClass;

// Class Chooser.ObjectChooser
// 0x0000 (0x0000 - 0x0000)
class IObjectChooser final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectChooser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectChooser")
	}
	static class IObjectChooser* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectChooser>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IObjectChooser;

// Class Chooser.ObjectChooser_Asset
// 0x0010 (0x0038 - 0x0028)
class UObjectChooser_Asset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Asset;                                             // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectChooser_Asset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectChooser_Asset")
	}
	static class UObjectChooser_Asset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectChooser_Asset>();
	}
};
DUMPER7_ASSERTS_UObjectChooser_Asset;

// Class Chooser.ChooserTable
// 0x0078 (0x00A0 - 0x0028)
class UChooserTable final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UChooserTable*                          RootChooser;                                       // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FInstancedStruct                       FallbackResult;                                    // 0x0050(0x0010)(NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               CookedResults;                                     // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ColumnsStructs;                                    // 0x0070(0x0010)(Edit, ZeroConstructor, NoClear, NativeAccessSpecifierPublic)
	EObjectChooserResultType                      ResultType;                                        // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    OutputObjectType;                                  // 0x0088(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<struct FInstancedStruct>               ContextData;                                       // 0x0090(0x0010)(Edit, ZeroConstructor, NoClear, NativeAccessSpecifierPublic)

public:
	bool ResultAssetFilter(const struct FAssetData& AssetData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserTable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserTable")
	}
	static class UChooserTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserTable>();
	}
};
DUMPER7_ASSERTS_UChooserTable;

// Class Chooser.ObjectChooser_EvaluateChooser
// 0x0010 (0x0038 - 0x0028)
class UObjectChooser_EvaluateChooser final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UChooserTable*                          Chooser;                                           // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectChooser_EvaluateChooser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectChooser_EvaluateChooser")
	}
	static class UObjectChooser_EvaluateChooser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectChooser_EvaluateChooser>();
	}
};
DUMPER7_ASSERTS_UObjectChooser_EvaluateChooser;

// Class Chooser.ChooserColumnMenuContext
// 0x0018 (0x0040 - 0x0028)
class UChooserColumnMenuContext final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserColumnMenuContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserColumnMenuContext")
	}
	static class UChooserColumnMenuContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserColumnMenuContext>();
	}
};
DUMPER7_ASSERTS_UChooserColumnMenuContext;

// Class Chooser.ChooserFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UChooserFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddChooserObjectInput(struct FChooserEvaluationContext& Context, class UObject* Object);
	static void AddChooserStructInput(struct FChooserEvaluationContext& Context, int32 Value);
	static class UObject* EvaluateChooser(const class UObject* ContextObject, const class UChooserTable* ChooserTable, TSubclassOf<class UObject> ObjectClass);
	static TArray<class UObject*> EvaluateChooserMulti(const class UObject* ContextObject, const class UChooserTable* ChooserTable, TSubclassOf<class UObject> ObjectClass);
	static class UObject* EvaluateObjectChooserBase(struct FChooserEvaluationContext& Context, const struct FInstancedStruct& ObjectChooser, TSubclassOf<class UObject> ObjectClass, bool bResultIsClass);
	static TArray<class UObject*> EvaluateObjectChooserBaseMulti(struct FChooserEvaluationContext& Context, const struct FInstancedStruct& ObjectChooser, TSubclassOf<class UObject> ObjectClass, bool bResultIsClass);
	static void GetChooserStructOutput(struct FChooserEvaluationContext& Context, int32 Index_0, int32* Value);
	static struct FChooserEvaluationContext MakeChooserEvaluationContext();
	static struct FInstancedStruct MakeEvaluateChooser(class UChooserTable* Chooser);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChooserFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChooserFunctionLibrary")
	}
	static class UChooserFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChooserFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UChooserFunctionLibrary;

}

