#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CineCameraRigs

#include "Basic.hpp"

#include "AnimationCore_structs.hpp"
#include "CineCameraRigs_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CineCameraRigs.CineCameraAttachMount.GetConstraint
// 0x0008 (0x0008 - 0x0000)
struct CineCameraAttachMount_GetConstraint final
{
public:
	class UTickableParentConstraint*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraAttachMount_GetConstraint;

// Function CineCameraRigs.CineCameraAttachMount.SetEnableLocationLag
// 0x0001 (0x0001 - 0x0000)
struct CineCameraAttachMount_SetEnableLocationLag final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraAttachMount_SetEnableLocationLag;

// Function CineCameraRigs.CineCameraAttachMount.SetEnableRotationLag
// 0x0001 (0x0001 - 0x0000)
struct CineCameraAttachMount_SetEnableRotationLag final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraAttachMount_SetEnableRotationLag;

// Function CineCameraRigs.CineCameraAttachMount.SetLocationLagSpeed
// 0x0004 (0x0004 - 0x0000)
struct CineCameraAttachMount_SetLocationLagSpeed final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraAttachMount_SetLocationLagSpeed;

// Function CineCameraRigs.CineCameraAttachMount.SetRotationLagSpeed
// 0x0004 (0x0004 - 0x0000)
struct CineCameraAttachMount_SetRotationLagSpeed final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraAttachMount_SetRotationLagSpeed;

// Function CineCameraRigs.CineCameraAttachMount.SetTransformFilter
// 0x0009 (0x0009 - 0x0000)
struct CineCameraAttachMount_SetTransformFilter final
{
public:
	struct FTransformFilter                       InFilter;                                          // 0x0000(0x0009)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraAttachMount_SetTransformFilter;

// Function CineCameraRigs.CineCameraRigRail.IsSequencerDriven
// 0x0001 (0x0001 - 0x0000)
struct CineCameraRigRail_IsSequencerDriven final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraRigRail_IsSequencerDriven;

// Function CineCameraRigs.CineCameraRigRail.SetAbsolutePositionOnRail
// 0x0004 (0x0004 - 0x0000)
struct CineCameraRigRail_SetAbsolutePositionOnRail final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraRigRail_SetAbsolutePositionOnRail;

// Function CineCameraRigs.CineCameraRigRail.SetDisplaySpeedHeatmap
// 0x0001 (0x0001 - 0x0000)
struct CineCameraRigRail_SetDisplaySpeedHeatmap final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraRigRail_SetDisplaySpeedHeatmap;

// Function CineCameraRigs.CineCameraRigRail.SetDriveMode
// 0x0001 (0x0001 - 0x0000)
struct CineCameraRigRail_SetDriveMode final
{
public:
	ECineCameraRigRailDriveMode                   InMode;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraRigRail_SetDriveMode;

// Function CineCameraRigs.CineCameraRigRail.SetSplineMeshMaterial
// 0x0008 (0x0008 - 0x0000)
struct CineCameraRigRail_SetSplineMeshMaterial final
{
public:
	class UMaterialInterface*                     InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraRigRail_SetSplineMeshMaterial;

// Function CineCameraRigs.CineCameraRigRail.SetSplineMeshTexture
// 0x0008 (0x0008 - 0x0000)
struct CineCameraRigRail_SetSplineMeshTexture final
{
public:
	class UTexture2D*                             InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraRigRail_SetSplineMeshTexture;

// Function CineCameraRigs.CineCameraRigRail.GetCineSplineComponent
// 0x0008 (0x0008 - 0x0000)
struct CineCameraRigRail_GetCineSplineComponent final
{
public:
	class UCineSplineComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraRigRail_GetCineSplineComponent;

// Function CineCameraRigs.CineCameraRigRail.GetVelocityAtPosition
// 0x0020 (0x0020 - 0x0000)
struct CineCameraRigRail_GetVelocityAtPosition final
{
public:
	float                                         InPosition;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delta;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineCameraRigRail_GetVelocityAtPosition;

// Function CineCameraRigs.CineCameraRigRailHelpers.CreateOrUpdateSplineHeatmapTexture
// 0x0028 (0x0028 - 0x0000)
struct CineCameraRigRailHelpers_CreateOrUpdateSplineHeatmapTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 DataValues;                                        // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         LowValue;                                          // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AverageValue;                                      // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HighValue;                                         // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CineCameraRigRailHelpers_CreateOrUpdateSplineHeatmapTexture;

// Function CineCameraRigs.CineSplineComponent.AddSplineDataAtPosition
// 0x0048 (0x0048 - 0x0000)
struct CineSplineComponent_AddSplineDataAtPosition final
{
public:
	float                                         InPosition;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCineSplinePointData                   InPointData;                                       // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_AddSplineDataAtPosition;

// Function CineCameraRigs.CineSplineComponent.SetAbsolutePositionAtSplinePoint
// 0x0008 (0x0008 - 0x0000)
struct CineSplineComponent_SetAbsolutePositionAtSplinePoint final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_SetAbsolutePositionAtSplinePoint;

// Function CineCameraRigs.CineSplineComponent.SetApertureAtSplinePoint
// 0x0008 (0x0008 - 0x0000)
struct CineSplineComponent_SetApertureAtSplinePoint final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_SetApertureAtSplinePoint;

// Function CineCameraRigs.CineSplineComponent.SetFocalLengthAtSplinePoint
// 0x0008 (0x0008 - 0x0000)
struct CineSplineComponent_SetFocalLengthAtSplinePoint final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_SetFocalLengthAtSplinePoint;

// Function CineCameraRigs.CineSplineComponent.SetFocusDistanceAtSplinePoint
// 0x0008 (0x0008 - 0x0000)
struct CineSplineComponent_SetFocusDistanceAtSplinePoint final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_SetFocusDistanceAtSplinePoint;

// Function CineCameraRigs.CineSplineComponent.SetPointRotationAtSplinePoint
// 0x0030 (0x0030 - 0x0000)
struct CineSplineComponent_SetPointRotationAtSplinePoint final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Value;                                             // 0x0010(0x0020)(ConstParm, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_SetPointRotationAtSplinePoint;

// Function CineCameraRigs.CineSplineComponent.UpdateSplineDataAtIndex
// 0x0048 (0x0048 - 0x0000)
struct CineSplineComponent_UpdateSplineDataAtIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCineSplinePointData                   InPointData;                                       // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_UpdateSplineDataAtIndex;

// Function CineCameraRigs.CineSplineComponent.FindSplineDataAtPosition
// 0x0010 (0x0010 - 0x0000)
struct CineSplineComponent_FindSplineDataAtPosition final
{
public:
	float                                         InPosition;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutIndex;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Tolerance;                                         // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CineSplineComponent_FindSplineDataAtPosition;

// Function CineCameraRigs.CineSplineComponent.GetInputKeyAtPosition
// 0x0008 (0x0008 - 0x0000)
struct CineSplineComponent_GetInputKeyAtPosition final
{
public:
	float                                         InPosition;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_GetInputKeyAtPosition;

// Function CineCameraRigs.CineSplineComponent.GetPointRotationAtSplineInputKey
// 0x0030 (0x0030 - 0x0000)
struct CineSplineComponent_GetPointRotationAtSplineInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_GetPointRotationAtSplineInputKey;

// Function CineCameraRigs.CineSplineComponent.GetPointRotationAtSplinePoint
// 0x0030 (0x0030 - 0x0000)
struct CineSplineComponent_GetPointRotationAtSplinePoint final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_GetPointRotationAtSplinePoint;

// Function CineCameraRigs.CineSplineComponent.GetPositionAtInputKey
// 0x0008 (0x0008 - 0x0000)
struct CineSplineComponent_GetPositionAtInputKey final
{
public:
	float                                         InKey;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_GetPositionAtInputKey;

// Function CineCameraRigs.CineSplineComponent.GetSplineDataAtPosition
// 0x0048 (0x0048 - 0x0000)
struct CineSplineComponent_GetSplineDataAtPosition final
{
public:
	float                                         InPosition;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCineSplinePointData                   ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CineSplineComponent_GetSplineDataAtPosition;

}

