#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CineCameraRigs

#include "Basic.hpp"

#include "AnimationCore_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CineCameraRigs_structs.hpp"
#include "CinematicCamera_classes.hpp"


namespace SDK
{

// Class CineCameraRigs.CineCameraAttachMount
// 0x0058 (0x04D8 - 0x0480)
class ACineCameraAttachMount final : public AActor
{
public:
	TSoftObjectPtr<class AActor>                  TargetActor;                                       // 0x0480(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetSocket;                                      // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransformFilter                       TransformFilter;                                   // 0x04B0(0x0009)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpringArmComponent*                    SpringArmComponent;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	bool                                          bEnableLocationLag;                                // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableRotationLag;                                // 0x04C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4CA[0x2];                                      // 0x04CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LocationLagSpeed;                                  // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationLagSpeed;                                  // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UTickableParentConstraint* GetConstraint();
	void ResetLocationOffset();
	void ResetRotationOffset();
	void SetEnableLocationLag(bool bEnabled);
	void SetEnableRotationLag(bool bEnabled);
	void SetLocationLagSpeed(float Speed);
	void SetRotationLagSpeed(float Speed);
	void SetTransformFilter(const struct FTransformFilter& InFilter);
	void ZeroRoll();
	void ZeroTilt();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CineCameraAttachMount")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CineCameraAttachMount")
	}
	static class ACineCameraAttachMount* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACineCameraAttachMount>();
	}
};
DUMPER7_ASSERTS_ACineCameraAttachMount;

// Class CineCameraRigs.CineCameraRigRail
// 0x0060 (0x0500 - 0x04A0)
class ACineCameraRigRail final : public ACameraRig_Rail
{
public:
	bool                                          bUseAbsolutePosition;                              // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AbsolutePositionOnRail;                            // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePointRotation;                                 // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     SplineMeshMaterial;                                // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<class UMaterialInstanceDynamic*>       SplineMeshMIDs;                                    // 0x04B8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UTexture2D*                             SplineMeshTexture;                                 // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	bool                                          bDisplaySpeedHeatmap;                              // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpeedSampleCountPerSegment;                        // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachLocationX;                                  // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachLocationY;                                  // 0x04D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachLocationZ;                                  // 0x04DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachRotationX;                                  // 0x04DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachRotationY;                                  // 0x04DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachRotationZ;                                  // 0x04DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInheritFocalLength;                               // 0x04DE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInheritAperture;                                  // 0x04DF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInheritFocusDistance;                             // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECineCameraRigRailDriveMode                   DriveMode;                                         // 0x04E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E2[0x2];                                      // 0x04E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlay;                                             // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverse;                                          // 0x04E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x04EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompensateTimeScale;                              // 0x04EB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineSplineComponent*                   CineSplineComponent;                               // 0x04F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_4F8[0x8];                                      // 0x04F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsSequencerDriven();
	void SetAbsolutePositionOnRail(float Value);
	void SetDisplaySpeedHeatmap(bool bEnable);
	void SetDriveMode(ECineCameraRigRailDriveMode InMode);
	void SetSplineMeshMaterial(class UMaterialInterface* InMaterial);
	void SetSplineMeshTexture(class UTexture2D* InTexture);

	class UCineSplineComponent* GetCineSplineComponent() const;
	struct FVector GetVelocityAtPosition(const float InPosition, const float Delta) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CineCameraRigRail")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CineCameraRigRail")
	}
	static class ACineCameraRigRail* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACineCameraRigRail>();
	}
};
DUMPER7_ASSERTS_ACineCameraRigRail;

// Class CineCameraRigs.CineCameraRigRailHelpers
// 0x0000 (0x0028 - 0x0028)
class UCineCameraRigRailHelpers final : public UBlueprintFunctionLibrary
{
public:
	static void CreateOrUpdateSplineHeatmapTexture(class UTexture2D*& Texture, const TArray<float>& DataValues, const float LowValue, const float AverageValue, const float HighValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CineCameraRigRailHelpers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CineCameraRigRailHelpers")
	}
	static class UCineCameraRigRailHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCineCameraRigRailHelpers>();
	}
};
DUMPER7_ASSERTS_UCineCameraRigRailHelpers;

// Class CineCameraRigs.CineCameraRigRailSettings
// 0x0078 (0x00A0 - 0x0028)
class UCineCameraRigRailSettings final : public UObject
{
public:
	TSoftObjectPtr<class UMaterialInterface>      DefaultSplineMeshMaterial;                         // 0x0028(0x0028)(Edit, BlueprintVisible, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              DefaultSplineMeshTexture;                          // 0x0050(0x0028)(Edit, BlueprintVisible, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              SpeedModeSplineMeshTexture;                        // 0x0078(0x0028)(Edit, BlueprintVisible, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CineCameraRigRailSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CineCameraRigRailSettings")
	}
	static class UCineCameraRigRailSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCineCameraRigRailSettings>();
	}
};
DUMPER7_ASSERTS_UCineCameraRigRailSettings;

// Class CineCameraRigs.CineSplineComponent
// 0x0060 (0x0710 - 0x06B0)
class UCineSplineComponent final : public USplineComponent
{
public:
	struct FCineSplineCurveDefaults               CameraSplineDefaults;                              // 0x06B0(0x0030)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	class UCineSplineMetadata*                    CineSplineMetadata;                                // 0x06E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_6E8[0x18];                                     // 0x06E8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSplineEdited_BP;                                 // 0x0700(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void AddSplineDataAtPosition(const float InPosition, const struct FCineSplinePointData& InPointData);
	void SetAbsolutePositionAtSplinePoint(const int32 PointIndex, const float Value);
	void SetApertureAtSplinePoint(const int32 PointIndex, const float Value);
	void SetFocalLengthAtSplinePoint(const int32 PointIndex, const float Value);
	void SetFocusDistanceAtSplinePoint(const int32 PointIndex, const float Value);
	void SetPointRotationAtSplinePoint(const int32 PointIndex, const struct FQuat& Value);
	void UpdateSplineDataAtIndex(const int32 InIndex, const struct FCineSplinePointData& InPointData);

	bool FindSplineDataAtPosition(const float InPosition, int32* OutIndex, const float Tolerance) const;
	float GetInputKeyAtPosition(const float InPosition) const;
	struct FQuat GetPointRotationAtSplineInputKey(float InKey) const;
	struct FQuat GetPointRotationAtSplinePoint(int32 Index_0) const;
	float GetPositionAtInputKey(const float InKey) const;
	struct FCineSplinePointData GetSplineDataAtPosition(const float InPosition) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CineSplineComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CineSplineComponent")
	}
	static class UCineSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCineSplineComponent>();
	}
};
DUMPER7_ASSERTS_UCineSplineComponent;

// Class CineCameraRigs.CineSplineMetadata
// 0x0078 (0x00A0 - 0x0028)
class UCineSplineMetadata final : public USplineMetadata
{
public:
	struct FInterpCurveFloat                      AbsolutePosition;                                  // 0x0028(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      FocalLength;                                       // 0x0040(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      Aperture;                                          // 0x0058(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      FocusDistance;                                     // 0x0070(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveQuat                       PointRotation;                                     // 0x0088(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CineSplineMetadata")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CineSplineMetadata")
	}
	static class UCineSplineMetadata* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCineSplineMetadata>();
	}
};
DUMPER7_ASSERTS_UCineSplineMetadata;

}

