#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClampSliderPercentWIdget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ClampSliderPercentWIdget.ClampSliderPercentWIdget_C.ExecuteUbergraph_ClampSliderPercentWIdget
// 0x0018 (0x0018 - 0x0000)
struct ClampSliderPercentWIdget_C_ExecuteUbergraph_ClampSliderPercentWIdget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ClampSliderPercentWIdget_C_ExecuteUbergraph_ClampSliderPercentWIdget;

// Function ClampSliderPercentWIdget.ClampSliderPercentWIdget_C.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct ClampSliderPercentWIdget_C_SetEnabled final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ClampSliderPercentWIdget_C_SetEnabled;

}

