#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Climbing_ImpactEffect

#include "Basic.hpp"

#include "ShooterGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Climbing_ImpactEffect.Climbing_ImpactEffect_C
// 0x0050 (0x04D0 - 0x0480)
class AClimbing_ImpactEffect_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow3;                                            // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ImpactSound;                                       // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBiomeZoneVolumeEffect>         Effects;                                           // 0x04B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        EffectDuration;                                    // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ImpactSoundCue;                                    // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void DeactivateImpactEffect();
	void DestroyImpactEffect();
	void ExecuteUbergraph_Climbing_ImpactEffect(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Climbing_ImpactEffect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Climbing_ImpactEffect_C")
	}
	static class AClimbing_ImpactEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AClimbing_ImpactEffect_C>();
	}
};
DUMPER7_ASSERTS_AClimbing_ImpactEffect_C;

}

