#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Concert

#include "Basic.hpp"

#include "ConcertTransport_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum Concert.EConcertConnectionStatus
// NumValues: 0x0005
enum class EConcertConnectionStatus : uint8
{
	Connecting                               = 0,
	Connected                                = 1,
	Disconnecting                            = 2,
	Disconnected                             = 3,
	EConcertConnectionStatus_MAX             = 4,
};

// Enum Concert.EConcertConnectionResult
// NumValues: 0x0005
enum class EConcertConnectionResult : uint8
{
	None                                     = 0,
	ConnectionAccepted                       = 1,
	ConnectionRefused                        = 2,
	AlreadyConnected                         = 3,
	EConcertConnectionResult_MAX             = 4,
};

// Enum Concert.EConcertClientStatus
// NumValues: 0x0005
enum class EConcertClientStatus : uint8
{
	Connected                                = 0,
	Disconnected                             = 1,
	Updated                                  = 2,
	Count                                    = 3,
	EConcertClientStatus_MAX                 = 4,
};

// Enum Concert.EConcertSendReceiveState
// NumValues: 0x0004
enum class EConcertSendReceiveState : uint8
{
	Default                                  = 0,
	SendOnly                                 = 1,
	ReceiveOnly                              = 2,
	EConcertSendReceiveState_MAX             = 3,
};

// Enum Concert.EConcertSessionResponseCode
// NumValues: 0x0004
enum class EConcertSessionResponseCode : uint8
{
	Success                                  = 0,
	Failed                                   = 1,
	InvalidRequest                           = 2,
	EConcertSessionResponseCode_MAX          = 3,
};

// Enum Concert.EConcertSessionRepositoryMountResponseCode
// NumValues: 0x0005
enum class EConcertSessionRepositoryMountResponseCode : uint8
{
	None                                     = 0,
	Mounted                                  = 1,
	AlreadyMounted                           = 2,
	NotFound                                 = 3,
	EConcertSessionRepositoryMountResponseCode_MAX = 4,
};

// Enum Concert.EBatchSessionDeletionFlags
// NumValues: 0x0003
enum class EBatchSessionDeletionFlags : uint32
{
	Strict                                   = 0,
	SkipForbiddenSessions                    = 1,
	EBatchSessionDeletionFlags_MAX           = 2,
};

// Enum Concert.EConcertServerFlags
// NumValues: 0x0003
enum class EConcertServerFlags : uint8
{
	None                                     = 0,
	IgnoreSessionRequirement                 = 1,
	EConcertServerFlags_MAX                  = 2,
};

// Enum Concert.EConcertSessionState
// NumValues: 0x0003
enum class EConcertSessionState : uint8
{
	Normal                                   = 0,
	Transient                                = 1,
	EConcertSessionState_MAX                 = 2,
};

// Enum Concert.EConcertPayloadCompressionType
// NumValues: 0x0004
enum class EConcertPayloadCompressionType : uint8
{
	None                                     = 0,
	Heuristic                                = 1,
	Always                                   = 2,
	EConcertPayloadCompressionType_MAX       = 3,
};

// Enum Concert.EConcertCompressionDetails
// NumValues: 0x0006
enum class EConcertCompressionDetails : uint8
{
	Uncompressed                             = 0,
	Compressed                               = 1,
	CompressWithOodle                        = 2,
	CompressForSpeed                         = 4,
	CompressForSize                          = 8,
	EConcertCompressionDetails_MAX           = 9,
};

// Enum Concert.EConcertPayloadSerializationMethod
// NumValues: 0x0003
enum class EConcertPayloadSerializationMethod : uint8
{
	Standard                                 = 0,
	Cbor                                     = 1,
	EConcertPayloadSerializationMethod_MAX   = 2,
};

// Enum Concert.EConcertLogMessageAction
// NumValues: 0x000D
enum class EConcertLogMessageAction : uint8
{
	None                                     = 0,
	Send                                     = 1,
	Publish                                  = 2,
	Receive                                  = 3,
	Queue                                    = 4,
	Discard                                  = 5,
	Duplicate                                = 6,
	TimeOut                                  = 7,
	Process                                  = 8,
	EndpointDiscovery                        = 9,
	EndpointTimeOut                          = 10,
	EndpointClosure                          = 11,
	EConcertLogMessageAction_MAX             = 12,
};

// ScriptStruct Concert.ConcertAdmin_DiscoverServersEvent
// 0x0030 (0x0068 - 0x0038)
struct FConcertAdmin_DiscoverServersEvent final : public FConcertEndpointDiscoveryEvent
{
public:
	class FString                                 RequiredRole;                                      // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RequiredVersion;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientAuthenticationKey;                           // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_DiscoverServersEvent;

// ScriptStruct Concert.ConcertInstanceInfo
// 0x0030 (0x0030 - 0x0000)
struct FConcertInstanceInfo final
{
public:
	struct FGuid                                  InstanceId;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstanceName;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstanceType;                                      // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertInstanceInfo;

// ScriptStruct Concert.ConcertAdmin_ServerDiscoveredEvent
// 0x0048 (0x0080 - 0x0038)
struct FConcertAdmin_ServerDiscoveredEvent final : public FConcertEndpointDiscoveryEvent
{
public:
	class FString                                 serverName;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertInstanceInfo                   InstanceInfo;                                      // 0x0048(0x0030)(Edit, EditConst, NativeAccessSpecifierPublic)
	EConcertServerFlags                           ServerFlags;                                       // 0x0078(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertAdmin_ServerDiscoveredEvent;

// ScriptStruct Concert.ConcertSessionRepositoryInfo
// 0x0014 (0x0014 - 0x0000)
struct FConcertSessionRepositoryInfo final
{
public:
	struct FGuid                                  RepositoryId;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMounted;                                          // 0x0010(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertSessionRepositoryInfo;

// ScriptStruct Concert.ConcertAdmin_MountSessionRepositoryRequest
// 0x0028 (0x0058 - 0x0030)
struct FConcertAdmin_MountSessionRepositoryRequest final : public FConcertRequestData
{
public:
	struct FGuid                                  RepositoryId;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RepositoryRootDir;                                 // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsServerDefault;                                  // 0x0050(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateIfNotExist;                                 // 0x0051(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertAdmin_MountSessionRepositoryRequest;

// ScriptStruct Concert.ConcertAdmin_MountSessionRepositoryResponse
// 0x0008 (0x0060 - 0x0058)
struct FConcertAdmin_MountSessionRepositoryResponse final : public FConcertResponseData
{
public:
	EConcertSessionRepositoryMountResponseCode    MountStatus;                                       // 0x0058(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertAdmin_MountSessionRepositoryResponse;

// ScriptStruct Concert.ConcertAdmin_GetSessionRepositoriesRequest
// 0x0000 (0x0030 - 0x0030)
struct FConcertAdmin_GetSessionRepositoriesRequest final : public FConcertRequestData
{
};
DUMPER7_ASSERTS_FConcertAdmin_GetSessionRepositoriesRequest;

// ScriptStruct Concert.ConcertAdmin_GetSessionRepositoriesResponse
// 0x0010 (0x0068 - 0x0058)
struct FConcertAdmin_GetSessionRepositoriesResponse final : public FConcertResponseData
{
public:
	TArray<struct FConcertSessionRepositoryInfo>  SessionRepositories;                               // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_GetSessionRepositoriesResponse;

// ScriptStruct Concert.ConcertAdmin_DropSessionRepositoriesRequest
// 0x0010 (0x0040 - 0x0030)
struct FConcertAdmin_DropSessionRepositoriesRequest final : public FConcertRequestData
{
public:
	TArray<struct FGuid>                          RepositoryIds;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_DropSessionRepositoriesRequest;

// ScriptStruct Concert.ConcertAdmin_DropSessionRepositoriesResponse
// 0x0010 (0x0068 - 0x0058)
struct FConcertAdmin_DropSessionRepositoriesResponse final : public FConcertResponseData
{
public:
	TArray<struct FGuid>                          DroppedRepositoryIds;                              // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_DropSessionRepositoriesResponse;

// ScriptStruct Concert.ConcertAdmin_GetAllSessionsRequest
// 0x0000 (0x0030 - 0x0030)
struct FConcertAdmin_GetAllSessionsRequest final : public FConcertRequestData
{
};
DUMPER7_ASSERTS_FConcertAdmin_GetAllSessionsRequest;

// ScriptStruct Concert.ConcertSessionSettings
// 0x0028 (0x0028 - 0x0000)
struct FConcertSessionSettings final
{
public:
	class FString                                 ProjectName;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        BaseRevision;                                      // 0x0010(0x0004)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ArchiveNameOverride;                               // 0x0018(0x0010)(Edit, ZeroConstructor, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSessionSettings;

// ScriptStruct Concert.ConcertFileVersionInfo
// 0x000C (0x000C - 0x0000)
struct FConcertFileVersionInfo final
{
public:
	int32                                         FileVersion;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FileVersionUE5;                                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FileVersionLicensee;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertFileVersionInfo;

// ScriptStruct Concert.ConcertEngineVersionInfo
// 0x000C (0x000C - 0x0000)
struct FConcertEngineVersionInfo final
{
public:
	uint16                                        Major;                                             // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        Minor;                                             // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        Patch;                                             // 0x0004(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        Changelist;                                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertEngineVersionInfo;

// ScriptStruct Concert.ConcertCustomVersionInfo
// 0x001C (0x001C - 0x0000)
struct FConcertCustomVersionInfo final
{
public:
	class FName                                   FriendlyName;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Key;                                               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Version;                                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertCustomVersionInfo;

// ScriptStruct Concert.ConcertSessionVersionInfo
// 0x0028 (0x0028 - 0x0000)
struct FConcertSessionVersionInfo final
{
public:
	struct FConcertFileVersionInfo                FileVersion;                                       // 0x0000(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FConcertEngineVersionInfo              EngineVersion;                                     // 0x000C(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FConcertCustomVersionInfo>      CustomVersions;                                    // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSessionVersionInfo;

// ScriptStruct Concert.ConcertSessionInfo
// 0x00B8 (0x00B8 - 0x0000)
struct FConcertSessionInfo final
{
public:
	struct FGuid                                  ServerInstanceId;                                  // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ServerEndpointId;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OwnerInstanceId;                                   // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SessionId;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionName;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OwnerUserName;                                     // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OwnerDeviceName;                                   // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertSessionSettings                Settings;                                          // 0x0070(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FConcertSessionVersionInfo>     VersionInfos;                                      // 0x0098(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EConcertSessionState                          State;                                             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         LastModifiedTicks;                                 // 0x00B0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FConcertSessionInfo;

// ScriptStruct Concert.ConcertAdmin_GetAllSessionsResponse
// 0x0020 (0x0078 - 0x0058)
struct FConcertAdmin_GetAllSessionsResponse final : public FConcertResponseData
{
public:
	TArray<struct FConcertSessionInfo>            LiveSessions;                                      // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FConcertSessionInfo>            ArchivedSessions;                                  // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_GetAllSessionsResponse;

// ScriptStruct Concert.ConcertAdmin_GetLiveSessionsRequest
// 0x0000 (0x0030 - 0x0030)
struct FConcertAdmin_GetLiveSessionsRequest final : public FConcertRequestData
{
};
DUMPER7_ASSERTS_FConcertAdmin_GetLiveSessionsRequest;

// ScriptStruct Concert.ConcertAdmin_GetArchivedSessionsRequest
// 0x0000 (0x0030 - 0x0030)
struct FConcertAdmin_GetArchivedSessionsRequest final : public FConcertRequestData
{
};
DUMPER7_ASSERTS_FConcertAdmin_GetArchivedSessionsRequest;

// ScriptStruct Concert.ConcertAdmin_GetSessionsResponse
// 0x0010 (0x0068 - 0x0058)
struct FConcertAdmin_GetSessionsResponse final : public FConcertResponseData
{
public:
	TArray<struct FConcertSessionInfo>            Sessions;                                          // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_GetSessionsResponse;

// ScriptStruct Concert.ConcertClientInfo
// 0x00B8 (0x00B8 - 0x0000)
struct FConcertClientInfo final
{
public:
	struct FConcertInstanceInfo                   InstanceInfo;                                      // 0x0000(0x0030)(Edit, EditConst, NativeAccessSpecifierPublic)
	class FString                                 DeviceName;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlatformName;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 username;                                          // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AvatarColor;                                       // 0x0070(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DesktopAvatarActorClass;                           // 0x0080(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VRAvatarActorClass;                                // 0x0090(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags;                                              // 0x00A0(0x0010)(Edit, ZeroConstructor, EditConst, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bHasEditorData;                                    // 0x00B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequiresCookedData;                               // 0x00B1(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertClientInfo;

// ScriptStruct Concert.ConcertAdmin_CreateSessionRequest
// 0x0118 (0x0148 - 0x0030)
struct FConcertAdmin_CreateSessionRequest final : public FConcertRequestData
{
public:
	class FString                                 SessionName;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertClientInfo                     OwnerClientInfo;                                   // 0x0040(0x00B8)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FConcertSessionSettings                SessionSettings;                                   // 0x00F8(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FConcertSessionVersionInfo             VersionInfo;                                       // 0x0120(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_CreateSessionRequest;

// ScriptStruct Concert.ConcertAdmin_FindSessionRequest
// 0x0118 (0x0148 - 0x0030)
struct FConcertAdmin_FindSessionRequest final : public FConcertRequestData
{
public:
	struct FGuid                                  SessionId;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertClientInfo                     OwnerClientInfo;                                   // 0x0040(0x00B8)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FConcertSessionSettings                SessionSettings;                                   // 0x00F8(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FConcertSessionVersionInfo             VersionInfo;                                       // 0x0120(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_FindSessionRequest;

// ScriptStruct Concert.ConcertSessionFilter
// 0x0038 (0x0038 - 0x0000)
struct FConcertSessionFilter final
{
public:
	int64                                         ActivityIdLowerBound;                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ActivityIdUpperBound;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int64>                                 ActivityIdsToExclude;                              // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int64>                                 ActivityIdsToInclude;                              // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bOnlyLiveData;                                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMetaDataOnly;                                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeIgnoredActivities;                         // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertSessionFilter;

// ScriptStruct Concert.ConcertAdmin_CopySessionRequest
// 0x0168 (0x0198 - 0x0030)
struct FConcertAdmin_CopySessionRequest final : public FConcertRequestData
{
public:
	struct FGuid                                  SessionId;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionName;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertClientInfo                     OwnerClientInfo;                                   // 0x0050(0x00B8)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FConcertSessionSettings                SessionSettings;                                   // 0x0108(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FConcertSessionVersionInfo             VersionInfo;                                       // 0x0130(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FConcertSessionFilter                  SessionFilter;                                     // 0x0158(0x0038)(Edit, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_190[0x8];                                      // 0x0190(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertAdmin_CopySessionRequest;

// ScriptStruct Concert.ConcertAdmin_SessionInfoResponse
// 0x00B8 (0x0110 - 0x0058)
struct FConcertAdmin_SessionInfoResponse final : public FConcertResponseData
{
public:
	struct FConcertSessionInfo                    SessionInfo;                                       // 0x0058(0x00B8)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_SessionInfoResponse;

// ScriptStruct Concert.ConcertAdmin_ArchiveSessionRequest
// 0x0078 (0x00A8 - 0x0030)
struct FConcertAdmin_ArchiveSessionRequest final : public FConcertRequestData
{
public:
	struct FGuid                                  SessionId;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ArchiveNameOverride;                               // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 username;                                          // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceName;                                        // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertSessionFilter                  SessionFilter;                                     // 0x0070(0x0038)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_ArchiveSessionRequest;

// ScriptStruct Concert.ConcertAdmin_ArchiveSessionResponse
// 0x0040 (0x0098 - 0x0058)
struct FConcertAdmin_ArchiveSessionResponse final : public FConcertResponseData
{
public:
	struct FGuid                                  SessionId;                                         // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionName;                                       // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ArchiveId;                                         // 0x0078(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ArchiveName;                                       // 0x0088(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_ArchiveSessionResponse;

// ScriptStruct Concert.ConcertAdmin_RenameSessionRequest
// 0x0040 (0x0070 - 0x0030)
struct FConcertAdmin_RenameSessionRequest final : public FConcertRequestData
{
public:
	struct FGuid                                  SessionId;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewName;                                           // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 username;                                          // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceName;                                        // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_RenameSessionRequest;

// ScriptStruct Concert.ConcertAdmin_RenameSessionResponse
// 0x0020 (0x0078 - 0x0058)
struct FConcertAdmin_RenameSessionResponse final : public FConcertResponseData
{
public:
	struct FGuid                                  SessionId;                                         // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OldName;                                           // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_RenameSessionResponse;

// ScriptStruct Concert.ConcertAdmin_DeleteSessionRequest
// 0x0030 (0x0060 - 0x0030)
struct FConcertAdmin_DeleteSessionRequest final : public FConcertRequestData
{
public:
	struct FGuid                                  SessionId;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 username;                                          // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceName;                                        // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_DeleteSessionRequest;

// ScriptStruct Concert.ConcertAdmin_DeleteSessionResponse
// 0x0020 (0x0078 - 0x0058)
struct FConcertAdmin_DeleteSessionResponse final : public FConcertResponseData
{
public:
	struct FGuid                                  SessionId;                                         // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionName;                                       // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_DeleteSessionResponse;

// ScriptStruct Concert.ConcertAdmin_BatchDeleteSessionRequest
// 0x0078 (0x00A8 - 0x0030)
struct FConcertAdmin_BatchDeleteSessionRequest final : public FConcertRequestData
{
public:
	TSet<struct FGuid>                            SessionIds;                                        // 0x0030(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	EBatchSessionDeletionFlags                    Flags;                                             // 0x0080(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 username;                                          // 0x0088(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceName;                                        // 0x0098(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_BatchDeleteSessionRequest;

// ScriptStruct Concert.DeletedSessionInfo
// 0x0020 (0x0020 - 0x0000)
struct FDeletedSessionInfo final
{
public:
	struct FGuid                                  SessionId;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionName;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDeletedSessionInfo;

// ScriptStruct Concert.ConcertAdmin_BatchDeleteSessionResponse
// 0x0020 (0x0078 - 0x0058)
struct FConcertAdmin_BatchDeleteSessionResponse final : public FConcertResponseData
{
public:
	TArray<struct FDeletedSessionInfo>            DeletedItems;                                      // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FDeletedSessionInfo>            NotOwnedByClient;                                  // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_BatchDeleteSessionResponse;

// ScriptStruct Concert.ConcertAdmin_GetSessionClientsRequest
// 0x0010 (0x0040 - 0x0030)
struct FConcertAdmin_GetSessionClientsRequest final : public FConcertRequestData
{
public:
	struct FGuid                                  SessionId;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_GetSessionClientsRequest;

// ScriptStruct Concert.ConcertSessionClientInfo
// 0x00C8 (0x00C8 - 0x0000)
struct FConcertSessionClientInfo final
{
public:
	struct FGuid                                  ClientEndpointId;                                  // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertClientInfo                     ClientInfo;                                        // 0x0010(0x00B8)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSessionClientInfo;

// ScriptStruct Concert.ConcertAdmin_GetSessionClientsResponse
// 0x0010 (0x0068 - 0x0058)
struct FConcertAdmin_GetSessionClientsResponse final : public FConcertResponseData
{
public:
	TArray<struct FConcertSessionClientInfo>      SessionClients;                                    // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_GetSessionClientsResponse;

// ScriptStruct Concert.ConcertAdmin_GetSessionActivitiesRequest
// 0x0028 (0x0058 - 0x0030)
struct FConcertAdmin_GetSessionActivitiesRequest final : public FConcertRequestData
{
public:
	struct FGuid                                  SessionId;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         FromActivityId;                                    // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ActivityCount;                                     // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeDetails;                                   // 0x0050(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertAdmin_GetSessionActivitiesRequest;

// ScriptStruct Concert.ConcertByteArray
// 0x0010 (0x0010 - 0x0000)
struct FConcertByteArray final
{
public:
	TArray<uint8>                                 Bytes;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertByteArray;

// ScriptStruct Concert.ConcertSessionSerializedPayload
// 0x0020 (0x0020 - 0x0000)
struct FConcertSessionSerializedPayload final
{
public:
	class FName                                   PayloadTypeName;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertPayloadSerializationMethod            SerializationMethod;                               // 0x0008(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertCompressionDetails                    PayloadCompressionDetails;                         // 0x0009(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PayloadSize;                                       // 0x000C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertByteArray                      PayloadBytes;                                      // 0x0010(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSessionSerializedPayload;

// ScriptStruct Concert.ConcertAdmin_GetSessionActivitiesResponse
// 0x0060 (0x00B8 - 0x0058)
struct FConcertAdmin_GetSessionActivitiesResponse final : public FConcertResponseData
{
public:
	TArray<struct FConcertSessionSerializedPayload> Activities;                                      // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FConcertClientInfo> EndpointClientInfoMap;                             // 0x0068(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAdmin_GetSessionActivitiesResponse;

// ScriptStruct Concert.ConcertSession_DiscoverAndJoinSessionEvent
// 0x00C8 (0x0100 - 0x0038)
struct FConcertSession_DiscoverAndJoinSessionEvent final : public FConcertEndpointDiscoveryEvent
{
public:
	struct FGuid                                  SessionServerEndpointId;                           // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertClientInfo                     ClientInfo;                                        // 0x0048(0x00B8)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSession_DiscoverAndJoinSessionEvent;

// ScriptStruct Concert.ConcertSession_JoinSessionResultEvent
// 0x0028 (0x0060 - 0x0038)
struct FConcertSession_JoinSessionResultEvent final : public FConcertEndpointDiscoveryEvent
{
public:
	struct FGuid                                  SessionServerEndpointId;                           // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertConnectionResult                      ConnectionResult;                                  // 0x0048(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConcertSessionClientInfo>      SessionClients;                                    // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSession_JoinSessionResultEvent;

// ScriptStruct Concert.ConcertSession_LeaveSessionEvent
// 0x0010 (0x0040 - 0x0030)
struct FConcertSession_LeaveSessionEvent final : public FConcertEventData
{
public:
	struct FGuid                                  SessionServerEndpointId;                           // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSession_LeaveSessionEvent;

// ScriptStruct Concert.ConcertSession_UpdateClientInfoEvent
// 0x00C8 (0x00F8 - 0x0030)
struct FConcertSession_UpdateClientInfoEvent final : public FConcertEventData
{
public:
	struct FConcertSessionClientInfo              SessionClient;                                     // 0x0030(0x00C8)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSession_UpdateClientInfoEvent;

// ScriptStruct Concert.ConcertSession_ClientListUpdatedEvent
// 0x0010 (0x0040 - 0x0030)
struct FConcertSession_ClientListUpdatedEvent final : public FConcertEventData
{
public:
	TArray<struct FConcertSessionClientInfo>      SessionClients;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSession_ClientListUpdatedEvent;

// ScriptStruct Concert.ConcertSession_SessionRenamedEvent
// 0x0010 (0x0040 - 0x0030)
struct FConcertSession_SessionRenamedEvent final : public FConcertEventData
{
public:
	class FString                                 NewName;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSession_SessionRenamedEvent;

// ScriptStruct Concert.ConcertSession_CustomEvent
// 0x0040 (0x0070 - 0x0030)
struct FConcertSession_CustomEvent final : public FConcertEventData
{
public:
	struct FGuid                                  SourceEndpointId;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          DestinationEndpointIds;                            // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FConcertSessionSerializedPayload       SerializedPayload;                                 // 0x0050(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSession_CustomEvent;

// ScriptStruct Concert.ConcertSession_CustomRequest
// 0x0040 (0x0070 - 0x0030)
struct FConcertSession_CustomRequest final : public FConcertRequestData
{
public:
	struct FGuid                                  SourceEndpointId;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  DestinationEndpointId;                             // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertSessionSerializedPayload       SerializedPayload;                                 // 0x0050(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSession_CustomRequest;

// ScriptStruct Concert.ConcertSession_CustomResponse
// 0x0020 (0x0078 - 0x0058)
struct FConcertSession_CustomResponse final : public FConcertResponseData
{
public:
	struct FConcertSessionSerializedPayload       SerializedPayload;                                 // 0x0058(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSession_CustomResponse;

// ScriptStruct Concert.ConcertServerInfo
// 0x0058 (0x0058 - 0x0000)
struct FConcertServerInfo final
{
public:
	struct FGuid                                  AdminEndpointId;                                   // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 serverName;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertInstanceInfo                   InstanceInfo;                                      // 0x0020(0x0030)(Edit, EditConst, NativeAccessSpecifierPublic)
	EConcertServerFlags                           ServerFlags;                                       // 0x0050(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertServerInfo;

// ScriptStruct Concert.ConcertLog
// 0x0090 (0x0090 - 0x0000)
struct FConcertLog final
{
public:
	uint64                                        Frame;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  MessageId;                                         // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        MessageOrderIndex;                                 // 0x0018(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        ChannelId;                                         // 0x001A(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              Timestamp;                                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertLogMessageAction                      MessageAction;                                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MessageTypeName;                                   // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OriginEndpointId;                                  // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  DestinationEndpointId;                             // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CustomPayloadTypename;                             // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomPayloadUncompressedByteSize;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StringPayload;                                     // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertSessionSerializedPayload       SerializedPayload;                                 // 0x0070(0x0020)(Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertLog;

}

