#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConcertSyncCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Concert_structs.hpp"
#include "ConcertTransport_structs.hpp"


namespace SDK
{

// Enum ConcertSyncCore.EConcertReplicationChangeClientReason
// NumValues: 0x0003
enum class EConcertReplicationChangeClientReason : uint8
{
	Unknown                                  = 0,
	PutRequest                               = 1,
	EConcertReplicationChangeClientReason_MAX = 2,
};

// Enum ConcertSyncCore.EConcertReplicationChangeFrequencyFlags
// NumValues: 0x0003
enum class EConcertReplicationChangeFrequencyFlags : uint8
{
	None                                     = 0,
	SetDefaults                              = 1,
	EConcertReplicationChangeFrequencyFlags_MAX = 2,
};

// Enum ConcertSyncCore.EConcertPutObjectErrorCode
// NumValues: 0x0004
enum class EConcertPutObjectErrorCode : uint8
{
	UnresolvedStream                         = 0,
	MissingData                              = 1,
	Count                                    = 2,
	EConcertPutObjectErrorCode_MAX           = 3,
};

// Enum ConcertSyncCore.EConcertChangeObjectFrequencyErrorCode
// NumValues: 0x0004
enum class EConcertChangeObjectFrequencyErrorCode : uint8
{
	NotRegistered                            = 0,
	InvalidReplicationRate                   = 1,
	Count                                    = 2,
	EConcertChangeObjectFrequencyErrorCode_MAX = 3,
};

// Enum ConcertSyncCore.EConcertChangeStreamFrequencyErrorCode
// NumValues: 0x0004
enum class EConcertChangeStreamFrequencyErrorCode : uint8
{
	UnknownStream                            = 0,
	InvalidReplicationRate                   = 1,
	Count                                    = 2,
	EConcertChangeStreamFrequencyErrorCode_MAX = 3,
};

// Enum ConcertSyncCore.EConcertQueryClientStreamFlags
// NumValues: 0x0006
enum class EConcertQueryClientStreamFlags : uint8
{
	None                                     = 0,
	SkipStreamInfo                           = 1,
	SkipProperties                           = 2,
	SkipAuthority                            = 4,
	SkipFrequency                            = 8,
	EConcertQueryClientStreamFlags_MAX       = 9,
};

// Enum ConcertSyncCore.EConcertDataStoreResultCode
// NumValues: 0x0007
enum class EConcertDataStoreResultCode : uint8
{
	Added                                    = 0,
	Fetched                                  = 1,
	Exchanged                                = 2,
	NotFound                                 = 3,
	TypeMismatch                             = 4,
	UnexpectedError                          = 5,
	EConcertDataStoreResultCode_MAX          = 6,
};

// Enum ConcertSyncCore.EPresenceModeType
// NumValues: 0x0003
enum class EPresenceModeType : uint32
{
	Desktop                                  = 0,
	VRMode                                   = 1,
	EPresenceModeType_MAX                    = 2,
};

// Enum ConcertSyncCore.EConcertMovieScenePlayerStatus
// NumValues: 0x0007
enum class EConcertMovieScenePlayerStatus : uint8
{
	Stopped                                  = 0,
	Playing                                  = 1,
	Scrubbing                                = 2,
	Jumping                                  = 3,
	Stepping                                 = 4,
	Paused                                   = 5,
	MAX                                      = 6,
};

// Enum ConcertSyncCore.EConcertSequencerPreloadStatus
// NumValues: 0x0004
enum class EConcertSequencerPreloadStatus : uint8
{
	Pending                                  = 0,
	Succeeded                                = 1,
	Failed                                   = 2,
	EConcertSequencerPreloadStatus_MAX       = 3,
};

// Enum ConcertSyncCore.EShowPresenceInGame
// NumValues: 0x0004
enum class EShowPresenceInGame : uint32
{
	NotVisibleInGame                         = 0,
	VisibleInGameOnlyEditor                  = 1,
	VisibleInGameAlways                      = 2,
	EShowPresenceInGame_MAX                  = 3,
};

// Enum ConcertSyncCore.ETransactionFilterResult
// NumValues: 0x0005
enum class ETransactionFilterResult : uint8
{
	IncludeObject                            = 0,
	ExcludeObject                            = 1,
	ExcludeTransaction                       = 2,
	UseDefault                               = 3,
	ETransactionFilterResult_MAX             = 4,
};

// Enum ConcertSyncCore.EConcertPackageUpdateType
// NumValues: 0x0007
enum class EConcertPackageUpdateType : uint8
{
	Dummy                                    = 0,
	Added                                    = 1,
	Saved                                    = 2,
	Renamed                                  = 3,
	Deleted                                  = 4,
	Count                                    = 5,
	EConcertPackageUpdateType_MAX            = 6,
};

// Enum ConcertSyncCore.EConcertResourceLockType
// NumValues: 0x0004
enum class EConcertResourceLockType : uint8
{
	None                                     = 0,
	Lock                                     = 1,
	Unlock                                   = 2,
	EConcertResourceLockType_MAX             = 3,
};

// Enum ConcertSyncCore.EConcertPlaySessionEventType
// NumValues: 0x0005
enum class EConcertPlaySessionEventType : uint8
{
	None                                     = 0,
	BeginPlay                                = 1,
	SwitchPlay                               = 2,
	EndPlay                                  = 3,
	EConcertPlaySessionEventType_MAX         = 4,
};

// Enum ConcertSyncCore.EReplicationResponseErrorCode
// NumValues: 0x0003
enum class EReplicationResponseErrorCode : uint8
{
	Timeout                                  = 0,
	Handled                                  = 1,
	EReplicationResponseErrorCode_MAX        = 2,
};

// Enum ConcertSyncCore.EJoinReplicationErrorCode
// NumValues: 0x000B
enum class EJoinReplicationErrorCode : uint8
{
	Success                                  = 0,
	NetworkError                             = 1,
	Cancelled                                = 2,
	AlreadyInProgress                        = 3,
	NotInAnyConcertSession                   = 4,
	AlreadyInSession                         = 5,
	InvalidClass                             = 6,
	DuplicateStreamId                        = 7,
	FailedToUnpackStream                     = 8,
	MaxPlusOne                               = 9,
	Max                                      = 8,
};

// Enum ConcertSyncCore.EConcertReplicationMuteOption
// NumValues: 0x0003
enum class EConcertReplicationMuteOption : uint8
{
	OnlyObject                               = 0,
	ObjectAndSubobjects                      = 1,
	EConcertReplicationMuteOption_MAX        = 2,
};

// Enum ConcertSyncCore.EConcertReplicationMuteRequestFlags
// NumValues: 0x0003
enum class EConcertReplicationMuteRequestFlags : uint8
{
	None                                     = 0,
	ClearMuteState                           = 1,
	EConcertReplicationMuteRequestFlags_MAX  = 2,
};

// Enum ConcertSyncCore.EConcertReplicationMuteErrorCode
// NumValues: 0x0004
enum class EConcertReplicationMuteErrorCode : uint8
{
	Timeout                                  = 0,
	Accepted                                 = 1,
	Rejected                                 = 2,
	EConcertReplicationMuteErrorCode_MAX     = 3,
};

// Enum ConcertSyncCore.EConcertReplicationPutStateFlags
// NumValues: 0x0004
enum class EConcertReplicationPutStateFlags : uint8
{
	None                                     = 0,
	SkipDisconnectedClients                  = 1,
	Default                                  = 1,
	EConcertReplicationPutStateFlags_MAX     = 2,
};

// Enum ConcertSyncCore.EConcertReplicationPutStateResponseCode
// NumValues: 0x0008
enum class EConcertReplicationPutStateResponseCode : uint8
{
	Timeout                                  = 0,
	Success                                  = 1,
	FeatureDisabled                          = 2,
	ClientUnknown                            = 3,
	StreamError                              = 4,
	AuthorityConflict                        = 5,
	MuteError                                = 6,
	EConcertReplicationPutStateResponseCode_MAX = 7,
};

// Enum ConcertSyncCore.EConcertSyncReplicationActivityType
// NumValues: 0x0005
enum class EConcertSyncReplicationActivityType : uint8
{
	None                                     = 0,
	LeaveReplication                         = 1,
	Mute                                     = 2,
	Count                                    = 3,
	EConcertSyncReplicationActivityType_MAX  = 4,
};

// Enum ConcertSyncCore.EConcertObjectReplicationMode
// NumValues: 0x0004
enum class EConcertObjectReplicationMode : uint8
{
	SpecifiedRate                            = 0,
	Realtime                                 = 1,
	Count                                    = 2,
	EConcertObjectReplicationMode_MAX        = 3,
};

// Enum ConcertSyncCore.EConcertReplicationRestoreContentFlags
// NumValues: 0x0009
enum class EConcertReplicationRestoreContentFlags : uint8
{
	None                                     = 0,
	RestoreOnTop                             = 1,
	ValidateUniqueClient                     = 2,
	RestoreAuthority                         = 4,
	SendNewState                             = 8,
	RestoreMute                              = 16,
	StreamsAndAuthority                      = 4,
	All                                      = 20,
	EConcertReplicationRestoreContentFlags_MAX = 32,
};

// Enum ConcertSyncCore.EConcertReplicationAuthorityRestoreMode
// NumValues: 0x0004
enum class EConcertReplicationAuthorityRestoreMode : uint8
{
	ExcludeAlreadyOwnedObjectPropertiesFromStream = 0,
	IncludeAlreadyOwnedObjectPropertiesInStream = 1,
	AllOrNothing                             = 2,
	EConcertReplicationAuthorityRestoreMode_MAX = 3,
};

// Enum ConcertSyncCore.EConcertReplicationRestoreErrorCode
// NumValues: 0x0008
enum class EConcertReplicationRestoreErrorCode : uint8
{
	Timeout                                  = 0,
	Success                                  = 1,
	Invalid                                  = 2,
	NotSupported                             = 3,
	NoSuchActivity                           = 4,
	NameConflict                             = 5,
	AuthorityConflict                        = 6,
	EConcertReplicationRestoreErrorCode_MAX  = 7,
};

// Enum ConcertSyncCore.EConcertSyncConnectionEventType
// NumValues: 0x0003
enum class EConcertSyncConnectionEventType : uint8
{
	Connected                                = 0,
	Disconnected                             = 1,
	EConcertSyncConnectionEventType_MAX      = 2,
};

// Enum ConcertSyncCore.EConcertSyncLockEventType
// NumValues: 0x0003
enum class EConcertSyncLockEventType : uint8
{
	Locked                                   = 0,
	Unlocked                                 = 1,
	EConcertSyncLockEventType_MAX            = 2,
};

// Enum ConcertSyncCore.EConcertSyncActivityEventType
// NumValues: 0x0008
enum class EConcertSyncActivityEventType : uint8
{
	None                                     = 0,
	Connection                               = 1,
	Lock                                     = 2,
	Transaction                              = 3,
	Package                                  = 4,
	Replication                              = 5,
	Count                                    = 6,
	EConcertSyncActivityEventType_MAX        = 7,
};

// Enum ConcertSyncCore.EConcertSyncTransactionActivitySummaryType
// NumValues: 0x0005
enum class EConcertSyncTransactionActivitySummaryType : uint8
{
	Added                                    = 0,
	Updated                                  = 1,
	Renamed                                  = 2,
	Deleted                                  = 3,
	EConcertSyncTransactionActivitySummaryType_MAX = 4,
};

// Enum ConcertSyncCore.EConcertSyncActivityFlags
// NumValues: 0x0003
enum class EConcertSyncActivityFlags : uint8
{
	None                                     = 0,
	Muted                                    = 1,
	EConcertSyncActivityFlags_MAX            = 2,
};

// ScriptStruct ConcertSyncCore.ConcertReplicationRemappingData_Actor
// 0x0030 (0x0030 - 0x0000)
struct FConcertReplicationRemappingData_Actor final
{
public:
	class FString                                 Label;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         Class;                                             // 0x0010(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplicationRemappingData_Actor;

// ScriptStruct ConcertSyncCore.ConcertReplicationRemappingData
// 0x0050 (0x0050 - 0x0000)
struct FConcertReplicationRemappingData final
{
public:
	TMap<struct FSoftObjectPath, struct FConcertReplicationRemappingData_Actor> ActorData;           // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplicationRemappingData;

// ScriptStruct ConcertSyncCore.ConcertPackageInfo
// 0x0048 (0x0048 - 0x0000)
struct FConcertPackageInfo final
{
public:
	class FName                                   PackageName;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewPackageName;                                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetClass;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PackageFileExtension;                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertPackageUpdateType                     PackageUpdateType;                                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         TransactionEventIdAtSave;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreSave;                                          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSave;                                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanSkipHotReload;                                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertPackageInfo;

// ScriptStruct ConcertSyncCore.ConcertPackage
// 0x0068 (0x0068 - 0x0000)
struct FConcertPackage final
{
public:
	struct FConcertPackageInfo                    Info;                                              // 0x0000(0x0048)(NativeAccessSpecifierPublic)
	struct FConcertByteArray                      PackageData;                                       // 0x0048(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 fileId;                                            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertPackage;

// ScriptStruct ConcertSyncCore.ConcertSyncPackageEvent
// 0x0070 (0x0070 - 0x0000)
struct FConcertSyncPackageEvent final
{
public:
	int64                                         PackageRevision;                                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertPackage                        Package;                                           // 0x0008(0x0068)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSyncPackageEvent;

// ScriptStruct ConcertSyncCore.ConcertSyncActivity
// 0x0058 (0x0058 - 0x0000)
struct FConcertSyncActivity
{
public:
	int64                                         ActivityId;                                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnored;                                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertSyncActivityFlags                     Flags;                                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  EndpointId;                                        // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              EventTime;                                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertSyncActivityEventType                 EventType;                                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         EventId;                                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertSessionSerializedPayload       EventSummary;                                      // 0x0038(0x0020)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSyncActivity;

// ScriptStruct ConcertSyncCore.ConcertSyncPackageActivity
// 0x0070 (0x00C8 - 0x0058)
struct FConcertSyncPackageActivity final : public FConcertSyncActivity
{
public:
	struct FConcertSyncPackageEvent               EventData;                                         // 0x0058(0x0070)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSyncPackageActivity;

// ScriptStruct ConcertSyncCore.ConcertObjectInStreamID
// 0x0030 (0x0030 - 0x0000)
struct FConcertObjectInStreamID
{
public:
	struct FGuid                                  StreamId;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        Object;                                            // 0x0010(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertObjectInStreamID;

// ScriptStruct ConcertSyncCore.ConcertReplicatedObjectId
// 0x0010 (0x0040 - 0x0030)
struct FConcertReplicatedObjectId final : public FConcertObjectInStreamID
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertReplicatedObjectId;

// ScriptStruct ConcertSyncCore.ConcertAuthorityConflict
// 0x0070 (0x0070 - 0x0000)
struct FConcertAuthorityConflict final
{
public:
	struct FConcertObjectInStreamID               AttemptedObject;                                   // 0x0000(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertReplicatedObjectId             ConflictingObject;                                 // 0x0030(0x0040)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAuthorityConflict;

// ScriptStruct ConcertSyncCore.ConcertObjectId
// 0x002C (0x002C - 0x0000)
struct FConcertObjectId final
{
public:
	class FName                                   ObjectClassPathName;                               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectPackageName;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectName;                                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectOuterPathName;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObjectExternalPackageName;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ObjectPersistentFlags;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertObjectId;

// ScriptStruct ConcertSyncCore.ConcertSerializedObjectData
// 0x0058 (0x0058 - 0x0000)
struct FConcertSerializedObjectData final
{
public:
	bool                                          bAllowCreate;                                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetExisting;                                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPendingKill;                                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NewPackageName;                                    // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewName;                                           // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewOuterPathName;                                  // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewExternalPackageName;                            // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        SourceObject;                                      // 0x0028(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 SerializedData;                                    // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSerializedObjectData;

// ScriptStruct ConcertSyncCore.ConcertSerializedPropertyData
// 0x0018 (0x0018 - 0x0000)
struct FConcertSerializedPropertyData final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 SerializedData;                                    // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSerializedPropertyData;

// ScriptStruct ConcertSyncCore.ConcertExportedObject
// 0x00B0 (0x00B0 - 0x0000)
struct FConcertExportedObject final
{
public:
	struct FConcertObjectId                       ObjectID;                                          // 0x0000(0x002C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ObjectPathDepth;                                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasLevelInstanceObject;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConcertSerializedObjectData           ObjectData;                                        // 0x0038(0x0058)(NativeAccessSpecifierPublic)
	TArray<struct FConcertSerializedPropertyData> PropertyDatas;                                     // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 SerializedAnnotationData;                          // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertExportedObject;

// ScriptStruct ConcertSyncCore.ConcertTransactionEventBase
// 0x0088 (0x0088 - 0x0000)
struct FConcertTransactionEventBase
{
public:
	struct FGuid                                  transactionId;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OperationId;                                       // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  TransactionEndpointId;                             // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TransactionUpdateIndex;                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VersionIndex;                                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ModifiedPackages;                                  // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FConcertObjectId                       PrimaryObjectId;                                   // 0x0048(0x002C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConcertExportedObject>         ExportedObjects;                                   // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertTransactionEventBase;

// ScriptStruct ConcertSyncCore.ConcertTransactionFinalizedEvent
// 0x0020 (0x00A8 - 0x0088)
struct FConcertTransactionFinalizedEvent final : public FConcertTransactionEventBase
{
public:
	struct FConcertLocalIdentifierState           LocalIdentifierState;                              // 0x0088(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0098(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertTransactionFinalizedEvent;

// ScriptStruct ConcertSyncCore.ConcertSyncTransactionEvent
// 0x00A8 (0x00A8 - 0x0000)
struct FConcertSyncTransactionEvent final
{
public:
	struct FConcertTransactionFinalizedEvent      Transaction;                                       // 0x0000(0x00A8)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSyncTransactionEvent;

// ScriptStruct ConcertSyncCore.ConcertAuthorityConflictArray
// 0x0010 (0x0010 - 0x0000)
struct FConcertAuthorityConflictArray final
{
public:
	TArray<struct FConcertAuthorityConflict>      Conflicts;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAuthorityConflictArray;

// ScriptStruct ConcertSyncCore.ConcertSyncActivitySummary
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FConcertSyncActivitySummary
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertSyncActivitySummary;

// ScriptStruct ConcertSyncCore.ConcertSyncPackageActivitySummary
// 0x0018 (0x0020 - 0x0008)
struct FConcertSyncPackageActivitySummary final : public FConcertSyncActivitySummary
{
public:
	class FName                                   PackageName;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewPackageName;                                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConcertPackageUpdateType                     PackageUpdateType;                                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSave;                                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreSave;                                          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertSyncPackageActivitySummary;

// ScriptStruct ConcertSyncCore.ConcertStreamArray
// 0x0010 (0x0010 - 0x0000)
struct FConcertStreamArray final
{
public:
	TArray<struct FGuid>                          StreamIds;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertStreamArray;

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeAuthority_Request
// 0x00A0 (0x00A0 - 0x0000)
struct FConcertReplication_ChangeAuthority_Request final
{
public:
	TMap<struct FSoftObjectPath, struct FConcertStreamArray> TakeAuthority;                          // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, struct FConcertStreamArray> ReleaseAuthority;                       // 0x0050(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplication_ChangeAuthority_Request;

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeSyncControl
// 0x0050 (0x0050 - 0x0000)
struct FConcertReplication_ChangeSyncControl final
{
public:
	TMap<struct FConcertObjectInStreamID, bool>   NewControlStates;                                  // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplication_ChangeSyncControl;

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeAuthority_Response
// 0x00A8 (0x00A8 - 0x0000)
struct FConcertReplication_ChangeAuthority_Response final
{
public:
	EReplicationResponseErrorCode                 ErrorCode;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSoftObjectPath, struct FConcertStreamArray> RejectedObjects;                        // 0x0008(0x0050)(NativeAccessSpecifierPublic)
	struct FConcertReplication_ChangeSyncControl  SyncControl;                                       // 0x0058(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplication_ChangeAuthority_Response;

// ScriptStruct ConcertSyncCore.ConcertPropertyChain
// 0x0010 (0x0010 - 0x0000)
struct FConcertPropertyChain final
{
public:
	TArray<class FName>                           PathToProperty;                                    // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FConcertPropertyChain;

// ScriptStruct ConcertSyncCore.ConcertPropertySelection
// 0x0050 (0x0050 - 0x0000)
struct FConcertPropertySelection final
{
public:
	TSet<struct FConcertPropertyChain>            ReplicatedProperties;                              // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertPropertySelection;

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeStream_PutObject
// 0x0070 (0x0070 - 0x0000)
struct FConcertReplication_ChangeStream_PutObject final
{
public:
	struct FConcertPropertySelection              Properties;                                        // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	struct FSoftClassPath                         ClassPath;                                         // 0x0050(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplication_ChangeStream_PutObject;

// ScriptStruct ConcertSyncCore.ConcertObjectReplicationSettings
// 0x0002 (0x0002 - 0x0000)
struct FConcertObjectReplicationSettings final
{
public:
	EConcertObjectReplicationMode                 ReplicationMode;                                   // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReplicationRate;                                   // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertObjectReplicationSettings;

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeStream_Frequency
// 0x00F8 (0x00F8 - 0x0000)
struct FConcertReplication_ChangeStream_Frequency final
{
public:
	TMap<struct FSoftObjectPath, struct FConcertObjectReplicationSettings> OverridesToPut;           // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TSet<struct FSoftObjectPath>                  OverridesToRemove;                                 // 0x0050(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, struct FConcertObjectReplicationSettings> OverridesToAdd;           // 0x00A0(0x0050)(NativeAccessSpecifierPublic)
	struct FConcertObjectReplicationSettings      NewDefaults;                                       // 0x00F0(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	EConcertReplicationChangeFrequencyFlags       Flags;                                             // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertReplication_ChangeStream_Frequency;

// ScriptStruct ConcertSyncCore.ConcertReplicatedObjectInfo
// 0x0070 (0x0070 - 0x0000)
struct FConcertReplicatedObjectInfo final
{
public:
	struct FSoftClassPath                         ClassPath;                                         // 0x0000(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertPropertySelection              PropertySelection;                                 // 0x0020(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplicatedObjectInfo;

// ScriptStruct ConcertSyncCore.ConcertObjectReplicationMap
// 0x0050 (0x0050 - 0x0000)
struct FConcertObjectReplicationMap final
{
public:
	TMap<struct FSoftObjectPath, struct FConcertReplicatedObjectInfo> ReplicatedObjects;             // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertObjectReplicationMap;

// ScriptStruct ConcertSyncCore.ConcertStreamFrequencySettings
// 0x0058 (0x0058 - 0x0000)
struct FConcertStreamFrequencySettings final
{
public:
	struct FConcertObjectReplicationSettings      Defaults;                                          // 0x0000(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSoftObjectPath, struct FConcertObjectReplicationSettings> ObjectOverrides;          // 0x0008(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertStreamFrequencySettings;

// ScriptStruct ConcertSyncCore.ConcertBaseStreamInfo
// 0x00B8 (0x00B8 - 0x0000)
struct FConcertBaseStreamInfo final
{
public:
	struct FGuid                                  Identifier;                                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertObjectReplicationMap           ReplicationMap;                                    // 0x0010(0x0050)(NativeAccessSpecifierPublic)
	struct FConcertStreamFrequencySettings        FrequencySettings;                                 // 0x0060(0x0058)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertBaseStreamInfo;

// ScriptStruct ConcertSyncCore.ConcertReplicationStream
// 0x00B8 (0x00B8 - 0x0000)
struct FConcertReplicationStream final
{
public:
	struct FConcertBaseStreamInfo                 BaseDescription;                                   // 0x0000(0x00B8)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplicationStream;

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeStream_Request
// 0x0150 (0x0150 - 0x0000)
struct FConcertReplication_ChangeStream_Request final
{
public:
	TSet<struct FConcertObjectInStreamID>         ObjectsToRemove;                                   // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FConcertObjectInStreamID, struct FConcertReplication_ChangeStream_PutObject> ObjectsToPut; // 0x0050(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FConcertReplication_ChangeStream_Frequency> FrequencyChanges;          // 0x00A0(0x0050)(NativeAccessSpecifierPublic)
	TArray<struct FConcertReplicationStream>      StreamsToAdd;                                      // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<struct FGuid>                            StreamsToRemove;                                   // 0x0100(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplication_ChangeStream_Request;

// ScriptStruct ConcertSyncCore.ConcertReplication_ClientChangeData
// 0x0240 (0x0240 - 0x0000)
struct FConcertReplication_ClientChangeData final
{
public:
	struct FConcertReplication_ChangeStream_Request StreamChange;                                    // 0x0000(0x0150)(NativeAccessSpecifierPublic)
	struct FConcertReplication_ChangeAuthority_Request AuthorityChange;                              // 0x0150(0x00A0)(NativeAccessSpecifierPublic)
	struct FConcertReplication_ChangeSyncControl  SyncControlChange;                                 // 0x01F0(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplication_ClientChangeData;

// ScriptStruct ConcertSyncCore.ConcertSyncLockActivitySummary
// 0x0018 (0x0020 - 0x0008)
struct FConcertSyncLockActivitySummary final : public FConcertSyncActivitySummary
{
public:
	EConcertSyncLockEventType                     LockEventType;                                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PrimaryResourceName;                               // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PrimaryPackageName;                                // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumResources;                                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertSyncLockActivitySummary;

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeClientEvent
// 0x0248 (0x0248 - 0x0000)
struct FConcertReplication_ChangeClientEvent final
{
public:
	EConcertReplicationChangeClientReason         Reason;                                            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConcertReplication_ClientChangeData   ChangeData;                                        // 0x0008(0x0240)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplication_ChangeClientEvent;

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeStream_FrequencyResponse
// 0x00A0 (0x00A0 - 0x0000)
struct FConcertReplication_ChangeStream_FrequencyResponse final
{
public:
	TMap<struct FConcertObjectInStreamID, EConcertChangeObjectFrequencyErrorCode> OverrideFailures;  // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FGuid, EConcertChangeStreamFrequencyErrorCode> DefaultFailures;                      // 0x0050(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplication_ChangeStream_FrequencyResponse;

// ScriptStruct ConcertSyncCore.ConcertReplication_ChangeStream_Response
// 0x0198 (0x0198 - 0x0000)
struct FConcertReplication_ChangeStream_Response final
{
public:
	EReplicationResponseErrorCode                 ErrorCode;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FConcertObjectInStreamID, struct FConcertReplicatedObjectId> AuthorityConflicts;     // 0x0008(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FConcertObjectInStreamID, EConcertPutObjectErrorCode> ObjectsToPutSemanticErrors;    // 0x0058(0x0050)(NativeAccessSpecifierPublic)
	TSet<struct FGuid>                            FailedStreamCreation;                              // 0x00A8(0x0050)(NativeAccessSpecifierPublic)
	struct FConcertReplication_ChangeStream_FrequencyResponse FrequencyErrors;                       // 0x00F8(0x00A0)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplication_ChangeStream_Response;

// ScriptStruct ConcertSyncCore.ConcertAuthorityClientInfo
// 0x0020 (0x0020 - 0x0000)
struct FConcertAuthorityClientInfo final
{
public:
	struct FGuid                                  StreamId;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                AuthoredObjects;                                   // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertAuthorityClientInfo;

// ScriptStruct ConcertSyncCore.ConcertQueriedClientInfo
// 0x0020 (0x0020 - 0x0000)
struct FConcertQueriedClientInfo final
{
public:
	TArray<struct FConcertBaseStreamInfo>         Streams;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FConcertAuthorityClientInfo>    Authority;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertQueriedClientInfo;

// ScriptStruct ConcertSyncCore.ConcertReplication_QueryReplicationInfo_Request
// 0x0058 (0x0058 - 0x0000)
struct FConcertReplication_QueryReplicationInfo_Request final
{
public:
	TSet<struct FGuid>                            ClientEndpointIds;                                 // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	EConcertQueryClientStreamFlags                QueryFlags;                                        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertReplication_QueryReplicationInfo_Request;

// ScriptStruct ConcertSyncCore.ConcertReplication_QueryReplicationInfo_Response
// 0x0058 (0x0058 - 0x0000)
struct FConcertReplication_QueryReplicationInfo_Response final
{
public:
	EReplicationResponseErrorCode                 ErrorCode;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, struct FConcertQueriedClientInfo> ClientInfo;                                 // 0x0008(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertReplication_QueryReplicationInfo_Response;

// ScriptStruct ConcertSyncCore.ConcertDataStore_Integer
// 0x0008 (0x0008 - 0x0000)
struct FConcertDataStore_Integer final
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertDataStore_Integer;

// ScriptStruct ConcertSyncCore.ConcertDataStore_Double
// 0x0008 (0x0008 - 0x0000)
struct FConcertDataStore_Double final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertDataStore_Double;

// ScriptStruct ConcertSyncCore.ConcertDataStore_String
// 0x0010 (0x0010 - 0x0000)
struct FConcertDataStore_String final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertDataStore_String;

// ScriptStruct ConcertSyncCore.ConcertDataStore_Text
// 0x0010 (0x0010 - 0x0000)
struct FConcertDataStore_Text final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0010)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertDataStore_Text;

// ScriptStruct ConcertSyncCore.ConcertDataStore_StoreValue
// 0x0030 (0x0030 - 0x0000)
struct FConcertDataStore_StoreValue final
{
public:
	class FName                                   TypeName;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Version;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConcertSessionSerializedPayload       SerializedValue;                                   // 0x0010(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertDataStore_StoreValue;

// ScriptStruct ConcertSyncCore.ConcertDataStore_KeyValuePair
// 0x0038 (0x0038 - 0x0000)
struct FConcertDataStore_KeyValuePair final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertDataStore_StoreValue           Value;                                             // 0x0008(0x0030)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertDataStore_KeyValuePair;

// ScriptStruct ConcertSyncCore.ConcertDataStore_ReplicateEvent
// 0x0010 (0x0010 - 0x0000)
struct FConcertDataStore_ReplicateEvent final
{
public:
	TArray<struct FConcertDataStore_KeyValuePair> Values;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertDataStore_ReplicateEvent;

// ScriptStruct ConcertSyncCore.ConcertDataStore_Request
// 0x0010 (0x0010 - 0x0000)
struct FConcertDataStore_Request
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TypeName;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertDataStore_Request;

// ScriptStruct ConcertSyncCore.ConcertDataStore_FetchOrAddRequest
// 0x0020 (0x0030 - 0x0010)
struct FConcertDataStore_FetchOrAddRequest final : public FConcertDataStore_Request
{
public:
	struct FConcertSessionSerializedPayload       SerializedValue;                                   // 0x0010(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertDataStore_FetchOrAddRequest;

// ScriptStruct ConcertSyncCore.ConcertDataStore_CompareExchangeRequest
// 0x0048 (0x0058 - 0x0010)
struct FConcertDataStore_CompareExchangeRequest final : public FConcertDataStore_Request
{
public:
	uint32                                        ExpectedVersion;                                   // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConcertSessionSerializedPayload       Expected;                                          // 0x0018(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FConcertSessionSerializedPayload       Desired;                                           // 0x0038(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertDataStore_CompareExchangeRequest;

// ScriptStruct ConcertSyncCore.ConcertDataStore_Response
// 0x0038 (0x0038 - 0x0000)
struct FConcertDataStore_Response final
{
public:
	EConcertDataStoreResultCode                   ResultCode;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConcertDataStore_StoreValue           Value;                                             // 0x0008(0x0030)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertDataStore_Response;

// ScriptStruct ConcertSyncCore.ConcertClientPresenceEventBase
// 0x0004 (0x0004 - 0x0000)
struct FConcertClientPresenceEventBase
{
public:
	uint32                                        TransactionUpdateIndex;                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertClientPresenceEventBase;

// ScriptStruct ConcertSyncCore.ConcertClientPresenceVisibilityUpdateEvent
// 0x0014 (0x0014 - 0x0000)
struct FConcertClientPresenceVisibilityUpdateEvent final
{
public:
	struct FGuid                                  ModifiedEndpointId;                                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibility;                                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertClientPresenceVisibilityUpdateEvent;

// ScriptStruct ConcertSyncCore.ConcertClientPresenceInVREvent
// 0x0008 (0x0008 - 0x0000)
struct FConcertClientPresenceInVREvent final
{
public:
	class FName                                   VRDevice;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertClientPresenceInVREvent;

// ScriptStruct ConcertSyncCore.ConcertClientPresenceDataUpdateEvent
// 0x005C (0x0060 - 0x0004)
struct FConcertClientPresenceDataUpdateEvent final : public FConcertClientPresenceEventBase
{
public:
	class FName                                   WorldPath;                                         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                position;                                          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Orientation;                                       // 0x0030(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPresenceModeType                             PresenceType;                                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertClientPresenceDataUpdateEvent;

// ScriptStruct ConcertSyncCore.ConcertClientDesktopPresenceUpdateEvent
// 0x003C (0x0040 - 0x0004)
struct FConcertClientDesktopPresenceUpdateEvent final : public FConcertClientPresenceEventBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TraceStart;                                        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TraceEnd;                                          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMovingCamera;                                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConcertClientDesktopPresenceUpdateEvent;

// ScriptStruct ConcertSyncCore.ConcertLaserData
// 0x0030 (0x0030 - 0x0000)
struct FConcertLaserData final
{
public:
	struct FVector                                LaserStart;                                        // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LaserEnd;                                          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertLaserData;

// ScriptStruct ConcertSyncCore.ConcertClientVRPresenceUpdateEvent
// 0x00DC (0x00E0 - 0x0004)
struct FConcertClientVRPresenceUpdateEvent final : public FConcertClientPresenceEventBase
{
public:
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LeftMotionControllerPosition;                      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  LeftMotionControllerOrientation;                   // 0x0020(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RightMotionControllerPosition;                     // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RightMotionControllerOrientation;                  // 0x0060(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertLaserData                      Lasers[0x2];                                       // 0x0080(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConcertClientVRPresenceUpdateEvent;

// ScriptStruct ConcertSyncCore.ConcertSequencerState
