#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConcertSyncCore

#include "Basic.hpp"

#include "ConcertSyncCore_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ConcertSyncCore.ConcertSyncConfig
// 0x0070 (0x0098 - 0x0028)
class UConcertSyncConfig final : public UObject
{
public:
	bool                                          bInteractiveHotReload;                             // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowPresenceInPIE;                                // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	EShowPresenceInGame                           ShowPresenceInGame;                                // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeAnnotationObjectChanges;                   // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SnapshotTransactionsPerSecond;                     // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransactionClassFilter>        IncludeObjectClassFilters;                         // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FTransactionClassFilter>        ExcludeTransactionClassFilters;                    // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<TFieldPath<class FProperty>>           AllowedTransientProperties;                        // 0x0058(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<TFieldPath<class FProperty>>           ExcludedProperties;                                // 0x0068(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           ExcludedPropertyTypes;                             // 0x0078(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FPackageClassFilter>            ExcludePackageClassFilters;                        // 0x0088(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConcertSyncConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConcertSyncConfig")
	}
	static class UConcertSyncConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConcertSyncConfig>();
	}
};
DUMPER7_ASSERTS_UConcertSyncConfig;

}

