#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConsoleCommand

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ConsoleCommand.ConsoleCommand_C.BPCycleHighlighted
// 0x0001 (0x0001 - 0x0000)
struct ConsoleCommand_C_BPCycleHighlighted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ConsoleCommand_C_BPCycleHighlighted;

// Function ConsoleCommand.ConsoleCommand_C.BPHighlightWidgetOnStart
// 0x0001 (0x0001 - 0x0000)
struct ConsoleCommand_C_BPHighlightWidgetOnStart final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ConsoleCommand_C_BPHighlightWidgetOnStart;

// Function ConsoleCommand.ConsoleCommand_C.ExecuteUbergraph_ConsoleCommand
// 0x0040 (0x0040 - 0x0000)
struct ConsoleCommand_C_ExecuteUbergraph_ConsoleCommand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ConsoleCommand_C_ExecuteUbergraph_ConsoleCommand;

// Function ConsoleCommand.ConsoleCommand_C.Tick
// 0x003C (0x003C - 0x0000)
struct ConsoleCommand_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ConsoleCommand_C_Tick;

}

