#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Constraints

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum Constraints.EHandleEvent
// NumValues: 0x0005
enum class EHandleEvent : uint8
{
	LocalTransformUpdated                    = 0,
	GlobalTransformUpdated                   = 1,
	ComponentUpdated                         = 2,
	UpperDependencyUpdated                   = 3,
	Max                                      = 4,
};

// ScriptStruct Constraints.MovieSceneConstraintChannel
// 0x0000 (0x0108 - 0x0108)
struct FMovieSceneConstraintChannel final : public FMovieSceneBoolChannel
{
};
DUMPER7_ASSERTS_FMovieSceneConstraintChannel;

// ScriptStruct Constraints.ConstraintAndActiveChannel
// 0x0110 (0x0110 - 0x0000)
struct FConstraintAndActiveChannel final
{
public:
	struct FMovieSceneConstraintChannel           ActiveChannel;                                     // 0x0000(0x0108)(NativeAccessSpecifierPublic)
	class UTickableConstraint*                    ConstraintCopyToSpawn;                             // 0x0108(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FConstraintAndActiveChannel;

// ScriptStruct Constraints.ConstraintsInWorld
// 0x0028 (0x0028 - 0x0000)
struct FConstraintsInWorld final
{
public:
	TWeakObjectPtr<class UWorld>                  World;                                             // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class UTickableConstraint>> Constraints;                                   // 0x0008(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConstraintsInWorld;

// ScriptStruct Constraints.ConstraintTickFunction
// 0x0018 (0x0040 - 0x0028)
struct FConstraintTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FConstraintTickFunction;

}

