#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConsoleCommand

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConsoleCommand.ConsoleCommand_C
// 0x0028 (0x0840 - 0x0818)
class UConsoleCommand_C final : public UUI_ConsoleCommand
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0818(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bracket_SmallText;                                 // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UASAUIWidget_Button_Style1A_C*          CloseButton;                                       // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UASAUIWidget_Button_Style1A_C*          EditButton;                                        // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       TextBox;                                           // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__ConsoleCommand_CloseButton_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature();
	bool BPCycleHighlighted();
	bool BPHighlightWidgetOnStart();
	void ExecuteUbergraph_ConsoleCommand(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ConsoleCommand_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConsoleCommand_C")
	}
	static class UConsoleCommand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConsoleCommand_C>();
	}
};
DUMPER7_ASSERTS_UConsoleCommand_C;

}

