#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "Engine_structs.hpp"
#include "RigVM_structs.hpp"


namespace SDK::Params
{

// Function ControlRig.ControlRigShapeLibraryLink.SetShapeLibrary
// 0x0028 (0x0028 - 0x0000)
struct ControlRigShapeLibraryLink_SetShapeLibrary final
{
public:
	TSoftObjectPtr<class UControlRigShapeLibrary> InShapeLibrary;                                    // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRigShapeLibraryLink_SetShapeLibrary;

// Function ControlRig.ControlRigShapeLibraryLink.GetShapeLibrary
// 0x0028 (0x0028 - 0x0000)
struct ControlRigShapeLibraryLink_GetShapeLibrary final
{
public:
	TSoftObjectPtr<class UControlRigShapeLibrary> ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRigShapeLibraryLink_GetShapeLibrary;

// Function ControlRig.ControlRig.FindControlRigs
// 0x0020 (0x0020 - 0x0000)
struct ControlRig_FindControlRigs final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UControlRig>                OptionalClass;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UControlRig*>                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_FindControlRigs;

// Function ControlRig.ControlRig.AddPhysicsSolver
// 0x001C (0x001C - 0x0000)
struct ControlRig_AddPhysicsSolver final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintPythonCommand;                               // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigPhysicsSolverID                    ReturnValue;                                       // 0x000C(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_AddPhysicsSolver;

// Function ControlRig.ControlRig.ClearControlSelection
// 0x0001 (0x0001 - 0x0000)
struct ControlRig_ClearControlSelection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_ClearControlSelection;

// Function ControlRig.ControlRig.GetHierarchy
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_GetHierarchy final
{
public:
	class URigHierarchy*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_GetHierarchy;

// Function ControlRig.ControlRig.SelectControl
// 0x000C (0x000C - 0x0000)
struct ControlRig_SelectControl final
{
public:
	class FName                                   InControlName;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelect;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ControlRig_SelectControl;

// Function ControlRig.ControlRig.SetInteractionRig
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_SetInteractionRig final
{
public:
	class UControlRig*                            InInteractionRig;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_SetInteractionRig;

// Function ControlRig.ControlRig.SetInteractionRigClass
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_SetInteractionRigClass final
{
public:
	TSubclassOf<class UControlRig>                InInteractionRigClass;                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_SetInteractionRigClass;

// Function ControlRig.ControlRig.CreateTransformableControlHandle
// 0x0010 (0x0010 - 0x0000)
struct ControlRig_CreateTransformableControlHandle final
{
public:
	class FName                                   ControlName;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTransformableControlHandle*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_CreateTransformableControlHandle;

// Function ControlRig.ControlRig.CurrentControlSelection
// 0x0010 (0x0010 - 0x0000)
struct ControlRig_CurrentControlSelection final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_CurrentControlSelection;

// Function ControlRig.ControlRig.GetHostingActor
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_GetHostingActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_GetHostingActor;

// Function ControlRig.ControlRig.GetInteractionRig
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_GetInteractionRig final
{
public:
	class UControlRig*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_GetInteractionRig;

// Function ControlRig.ControlRig.GetInteractionRigClass
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_GetInteractionRigClass final
{
public:
	TSubclassOf<class UControlRig>                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_GetInteractionRigClass;

// Function ControlRig.ControlRig.IsControlSelected
// 0x000C (0x000C - 0x0000)
struct ControlRig_IsControlSelected final
{
public:
	class FName                                   InControlName;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ControlRig_IsControlSelected;

// Function ControlRig.ControlRig.SupportsBackwardsSolve
// 0x0001 (0x0001 - 0x0000)
struct ControlRig_SupportsBackwardsSolve final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ControlRig_SupportsBackwardsSolve;

// Function ControlRig.RigHierarchy.GetEulerTransformFromControlValue
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_GetEulerTransformFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEulerTransform                        ReturnValue;                                       // 0x0088(0x0048)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_GetEulerTransformFromControlValue;

// Function ControlRig.RigHierarchy.GetFloatFromControlValue
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_GetFloatFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0084(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_GetFloatFromControlValue;

// Function ControlRig.RigHierarchy.GetIntFromControlValue
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_GetIntFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0084(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_GetIntFromControlValue;

// Function ControlRig.RigHierarchy.GetRotatorFromControlValue
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_GetRotatorFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x0088(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_GetRotatorFromControlValue;

// Function ControlRig.RigHierarchy.GetTransformFromControlValue
// 0x00F0 (0x00F0 - 0x0000)
struct RigHierarchy_GetTransformFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0090(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_GetTransformFromControlValue;

// Function ControlRig.RigHierarchy.GetTransformNoScaleFromControlValue
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_GetTransformNoScaleFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformNoScale                      ReturnValue;                                       // 0x0090(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_GetTransformNoScaleFromControlValue;

// Function ControlRig.RigHierarchy.GetVector2DFromControlValue
// 0x0098 (0x0098 - 0x0000)
struct RigHierarchy_GetVector2DFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ReturnValue;                                       // 0x0088(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_GetVector2DFromControlValue;

// Function ControlRig.RigHierarchy.GetVectorFromControlValue
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_GetVectorFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0088(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_GetVectorFromControlValue;

// Function ControlRig.RigHierarchy.MakeControlValueFromBool
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_MakeControlValueFromBool final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigControlValue                       ReturnValue;                                       // 0x0004(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_MakeControlValueFromBool;

// Function ControlRig.RigHierarchy.MakeControlValueFromEulerTransform
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_MakeControlValueFromEulerTransform final
{
public:
	struct FEulerTransform                        InValue;                                           // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0048(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_MakeControlValueFromEulerTransform;

// Function ControlRig.RigHierarchy.MakeControlValueFromFloat
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_MakeControlValueFromFloat final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0004(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_MakeControlValueFromFloat;

// Function ControlRig.RigHierarchy.MakeControlValueFromInt
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_MakeControlValueFromInt final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0004(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_MakeControlValueFromInt;

// Function ControlRig.RigHierarchy.MakeControlValueFromRotator
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_MakeControlValueFromRotator final
{
public:
	struct FRotator                               InValue;                                           // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0018(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_MakeControlValueFromRotator;

// Function ControlRig.RigHierarchy.MakeControlValueFromTransform
// 0x00F0 (0x00F0 - 0x0000)
struct RigHierarchy_MakeControlValueFromTransform final
{
public:
	struct FTransform                             InValue;                                           // 0x0000(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0060(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0xC];                                       // 0x00E4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_MakeControlValueFromTransform;

// Function ControlRig.RigHierarchy.MakeControlValueFromTransformNoScale
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_MakeControlValueFromTransformNoScale final
{
public:
	struct FTransformNoScale                      InValue;                                           // 0x0000(0x0040)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0040(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_MakeControlValueFromTransformNoScale;

// Function ControlRig.RigHierarchy.MakeControlValueFromVector
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_MakeControlValueFromVector final
{
public:
	struct FVector                                InValue;                                           // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0018(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_MakeControlValueFromVector;

// Function ControlRig.RigHierarchy.MakeControlValueFromVector2D
// 0x0098 (0x0098 - 0x0000)
struct RigHierarchy_MakeControlValueFromVector2D final
{
public:
	struct FVector2D                              InValue;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0010(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_MakeControlValueFromVector2D;

// Function ControlRig.RigHierarchy.CopyHierarchy
// 0x0008 (0x0008 - 0x0000)
struct RigHierarchy_CopyHierarchy final
{
public:
	class URigHierarchy*                          InHierarchy;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_CopyHierarchy;

// Function ControlRig.RigHierarchy.CopyPose
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_CopyPose final
{
public:
	class URigHierarchy*                          InHierarchy;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCurrent;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeights;                                          // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchPoseInGlobalIfNeeded;                        // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_CopyPose;

// Function ControlRig.RigHierarchy.GetController
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_GetController final
{
public:
	bool                                          bCreateIfNeeded;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URigHierarchyController*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_GetController;

// Function ControlRig.RigHierarchy.GetRuleManager
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_GetRuleManager final
{
public:
	bool                                          bCreateIfNeeded;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UModularRigRuleManager*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_GetRuleManager;

// Function ControlRig.RigHierarchy.RemoveAllMetadata
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_RemoveAllMetadata final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_RemoveAllMetadata;

// Function ControlRig.RigHierarchy.RemoveMetadata
// 0x0018 (0x0018 - 0x0000)
struct RigHierarchy_RemoveMetadata final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InMetadataName;                                    // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_RemoveMetadata;

// Function ControlRig.RigHierarchy.ResetPoseToInitial
// 0x0001 (0x0001 - 0x0000)
struct RigHierarchy_ResetPoseToInitial final
{
public:
	ERigElementType                               InTypeFilter;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_ResetPoseToInitial;

// Function ControlRig.RigHierarchy.RestoreConnectorsFromStates
// 0x0028 (0x0028 - 0x0000)
struct RigHierarchy_RestoreConnectorsFromStates final
{
public:
	TArray<struct FRigConnectorState>             InStates;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bSetupUndoRedo;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_RestoreConnectorsFromStates;

// Function ControlRig.RigHierarchy.RestoreSocketsFromStates
// 0x0028 (0x0028 - 0x0000)
struct RigHierarchy_RestoreSocketsFromStates final
{
public:
	TArray<struct FRigSocketState>                InStates;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bSetupUndoRedo;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RigHierarchy_RestoreSocketsFromStates;

// Function ControlRig.RigHierarchy.SendAutoKeyEvent
// 0x0014 (0x0014 - 0x0000)
struct RigHierarchy_SendAutoKeyEvent final
{
public:
	struct FRigElementKey                         InElement;                                         // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InOffsetInSeconds;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsynchronous;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SendAutoKeyEvent;

// Function ControlRig.RigHierarchy.SetBoolArrayMetadata
// 0x0030 (0x0030 - 0x0000)
struct RigHierarchy_SetBoolArrayMetadata final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InMetadataName;                                    // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  InValue;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetBoolArrayMetadata;

// Function ControlRig.RigHierarchy.SetBoolMetadata
// 0x0018 (0x0018 - 0x0000)
struct RigHierarchy_SetBoolMetadata final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InMetadataName;                                    // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InValue;                                           // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetBoolMetadata;

// Function ControlRig.RigHierarchy.SetConnectorSettings
// 0x0040 (0x0040 - 0x0000)
struct RigHierarchy_SetConnectorSettings final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigConnectorSettings                  InSettings;                                        // 0x0010(0x0028)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0039(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintPythonCommands;                              // 0x003A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetConnectorSettings;

// Function ControlRig.RigHierarchy.SetConnectorSettingsByIndex
// 0x0038 (0x0038 - 0x0000)
struct RigHierarchy_SetConnectorSettingsByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigConnectorSettings                  InSettings;                                        // 0x0008(0x0028)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintPythonCommands;                              // 0x0032(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetConnectorSettingsByIndex;

// Function ControlRig.RigHierarchy.SetControlOffsetTransform
// 0x0080 (0x0080 - 0x0000)
struct RigHierarchy_SetControlOffsetTransform final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InTransform;                                       // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectChildren;                                   // 0x0071(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0072(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintPythonCommands;                              // 0x0073(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlOffsetTransform;

// Function ControlRig.RigHierarchy.SetControlOffsetTransformByIndex
// 0x0080 (0x0080 - 0x0000)
struct RigHierarchy_SetControlOffsetTransformByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InTransform;                                       // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectChildren;                                   // 0x0071(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0072(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintPythonCommands;                              // 0x0073(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlOffsetTransformByIndex;

// Function ControlRig.RigHierarchy.SetControlPreferredEulerAngles
// 0x0030 (0x0030 - 0x0000)
struct RigHierarchy_SetControlPreferredEulerAngles final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InEulerAngles;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEulerRotationOrder                           InRotationOrder;                                   // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixEulerFlips;                                    // 0x002A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlPreferredEulerAngles;

// Function ControlRig.RigHierarchy.SetControlPreferredEulerAnglesByIndex
// 0x0028 (0x0028 - 0x0000)
struct RigHierarchy_SetControlPreferredEulerAnglesByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InEulerAngles;                                     // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEulerRotationOrder                           InRotationOrder;                                   // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixEulerFlips;                                    // 0x0022(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlPreferredEulerAnglesByIndex;

// Function ControlRig.RigHierarchy.SetControlPreferredRotationOrder
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_SetControlPreferredRotationOrder final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEulerRotationOrder                           InRotationOrder;                                   // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlPreferredRotationOrder;

// Function ControlRig.RigHierarchy.SetControlPreferredRotationOrderByIndex
// 0x0008 (0x0008 - 0x0000)
struct RigHierarchy_SetControlPreferredRotationOrderByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEulerRotationOrder                           InRotationOrder;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlPreferredRotationOrderByIndex;

// Function ControlRig.RigHierarchy.SetControlPreferredRotator
// 0x0030 (0x0030 - 0x0000)
struct RigHierarchy_SetControlPreferredRotator final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InRotator;                                         // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixEulerFlips;                                    // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlPreferredRotator;

// Function ControlRig.RigHierarchy.SetControlPreferredRotatorByIndex
// 0x0028 (0x0028 - 0x0000)
struct RigHierarchy_SetControlPreferredRotatorByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               InRotator;                                         // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixEulerFlips;                                    // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlPreferredRotatorByIndex;

// Function ControlRig.RigHierarchy.SetControlSettings
// 0x01D0 (0x01D0 - 0x0000)
struct RigHierarchy_SetControlSettings final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigControlSettings                    InSettings;                                        // 0x0010(0x01B8)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x01C8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x01C9(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintPythonCommands;                              // 0x01CA(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CB[0x5];                                      // 0x01CB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlSettings;

// Function ControlRig.RigHierarchy.SetControlSettingsByIndex
// 0x01C8 (0x01C8 - 0x0000)
struct RigHierarchy_SetControlSettingsByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigControlSettings                    InSettings;                                        // 0x0008(0x01B8)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x01C0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x01C1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintPythonCommands;                              // 0x01C2(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlSettingsByIndex;

// Function ControlRig.RigHierarchy.SetControlShapeTransform
// 0x0080 (0x0080 - 0x0000)
struct RigHierarchy_SetControlShapeTransform final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InTransform;                                       // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0071(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0xE];                                       // 0x0072(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlShapeTransform;

// Function ControlRig.RigHierarchy.SetControlShapeTransformByIndex
// 0x0080 (0x0080 - 0x0000)
struct RigHierarchy_SetControlShapeTransformByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InTransform;                                       // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0071(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0xE];                                       // 0x0072(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlShapeTransformByIndex;

// Function ControlRig.RigHierarchy.SetControlValue
// 0x0094 (0x0094 - 0x0000)
struct RigHierarchy_SetControlValue final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       InValue;                                           // 0x000C(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	ERigControlValueType                          InValueType;                                       // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0091(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintPythonCommands;                              // 0x0092(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlValue;

// Function ControlRig.RigHierarchy.SetControlValueByIndex
// 0x008C (0x008C - 0x0000)
struct RigHierarchy_SetControlValueByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       InValue;                                           // 0x0004(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	ERigControlValueType                          InValueType;                                       // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0089(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintPythonCommands;                              // 0x008A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlValueByIndex;

// Function ControlRig.RigHierarchy.SetControlVisibility
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_SetControlVisibility final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibility;                                       // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlVisibility;

// Function ControlRig.RigHierarchy.SetControlVisibilityByIndex
// 0x0008 (0x0008 - 0x0000)
struct RigHierarchy_SetControlVisibilityByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibility;                                       // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetControlVisibilityByIndex;

// Function ControlRig.RigHierarchy.SetCurveValue
// 0x0014 (0x0014 - 0x0000)
struct RigHierarchy_SetCurveValue final
{
public:
	struct FRigElementKey                         InKey;                                             // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetCurveValue;

// Function ControlRig.RigHierarchy.SetCurveValueByIndex
// 0x000C (0x000C - 0x0000)
struct RigHierarchy_SetCurveValueByIndex final
{
public:
	int32                                         InElementIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RigHierarchy_SetCurveValueByIndex;

// Function ControlRig.RigHierarchy.SetFloatArrayMetadata
// 0x0030 (0x0030 - 0x0000)
struct RigHierarchy_SetFloatArrayMetadata final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
