#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CropPlotBaseBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CropPlotBaseBP.CropPlotBaseBP_C
// 0x0078 (0x1418 - 0x13A0)
class ACropPlotBaseBP_C final : public APrimalStructureItemContainer_CropPlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x13A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   CropGestationMonitor;                              // 0x13A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       StasisComponent;                                   // 0x13B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         TilledMaximumCount;                                // 0x13B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TilledCurrentCount;                                // 0x13BC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, ExperimentalAlwaysOverriden)
	double                                        TilledBonusYieldMultiplier_AtOneTill;              // 0x13C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TilledBonusYieldMultiplier_AtMaxTilled;            // 0x13C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TilledBonusGrowthRateMultiplier_AtOneTill;         // 0x13D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TilledBonusGrowthRateMultiplier_AtMaxTilled;       // 0x13D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TillVFXEmitterOffset;                              // 0x13E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     Spawned_Emitter_VFX;                               // 0x13F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 Destroy_Emitter_After_name;                        // 0x1400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, TObjectPtr)
	float                                         duration_after_emitter_deactivation_do_destroy;    // 0x1410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	int32 BPAdjustCropYield_Max(int32 ItemsToGenerateBeforeAdjustment);
	int32 BPAdjustCropYield_SingleRefresh(int32 ItemsToGenerateBeforeAdjustment);
	float BPGetAdditionalGrowthMultiplier();
	bool BPGetCustomBlueprintData(class FName DataName, const struct FBPNetExecParams& InData, struct FBPNetExecParams* OutData);
	int32 BPIsAllowedToBuild(const struct FPlacementData& OutPlacementData, int32 CurrentAllowedReason);
	bool BPLocalExecCommand(class FName CommandName, const struct FBPNetExecParams& ExecParams);
	void BPOnCropPhaseDecrease(int32 CropPhase);
	void BPOnFertilizerItemUsedUp();
	void BPOnRemovedCrop();
	void BPOnUpdateCropVisuals();
	class FString BPOverrideCantBuildReasonString(int32 CantBuildReason);
	bool BPServerHandleNetExecCommand(class APlayerController* FromPC, class FName CommandName, const struct FBPNetExecParams& ExecParams);
	void BPUnstasis();
	void Can_Currently_be_Tilled(bool* Can_Currently_be_Tilled_0);
	bool CanAttachToExosuit(class AShooterPlayerController* ForPC);
	bool CanBeStoredByExosuit(class AShooterPlayerController* ForPC);
	void Destroy_Emitter_After();
	void ExecuteUbergraph_CropPlotBaseBP(int32 EntryPoint);
	double GetCropGrowthTillMultiplier();
	double GetCropYieldTillMultipler();
	void GetCurrentStackCount(int32 MaxCount, class APrimalStructure* PlacingOn, int32* StackCount);
	TArray<struct FTooltipTextInfo> GetTooltipStructureInfoBP(class AShooterPlayerController* PlayerOwner);
	void HasSoilTillingEnabled(bool* CanEverBeTilled);
	void Interface_CropPlot_Get_Current_Plant_Phase(uint8* Current_Plant_Phase);
	void Interface_CropPlot_Remove_Planted_Crop(bool* success);
	void Interface_CropPlot_Spawn_Creature_From_Plant(class APrimalDinoCharacter** Creature_Ref);
	void IsOverStackLimit(const struct FPlacementData& PlacementData, bool* IsOverLimit);
	void On_Fertilizer_Removed();
	void ReceiveBeginPlay();
	void ResetTilledState();
	void TillSoil();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CropPlotBaseBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CropPlotBaseBP_C")
	}
	static class ACropPlotBaseBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACropPlotBaseBP_C>();
	}
};
DUMPER7_ASSERTS_ACropPlotBaseBP_C;

}

