#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CryopodInventoryTooltipWidget

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CryopodInventoryTooltipWidget.CryopodInventoryTooltipWidget_C
// 0x0028 (0x0618 - 0x05F0)
class UCryopodInventoryTooltipWidget_C final : public UPrimalCryopodTooltipWidget
{
public:
	class UImage*                                 DinoIcon;                                          // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FatherIcon;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GenderIcon;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MotherIcon;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UToolTipWidgetPrimalItem_Inventory_C*   TooltipEmptyCryopod;                               // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CryopodInventoryTooltipWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CryopodInventoryTooltipWidget_C")
	}
	static class UCryopodInventoryTooltipWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCryopodInventoryTooltipWidget_C>();
	}
};
DUMPER7_ASSERTS_UCryopodInventoryTooltipWidget_C;

}

