#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowNodes

#include "Basic.hpp"

#include "Chaos_structs.hpp"
#include "DataflowEnginePlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DataflowCore_structs.hpp"


namespace SDK
{

// ScriptStruct DataflowNodes.DataflowFunctionProperty
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FDataflowFunctionProperty final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataflowFunctionProperty;

// ScriptStruct DataflowNodes.ScalarVertexPropertyGroup
// 0x0008 (0x0008 - 0x0000)
struct FScalarVertexPropertyGroup final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FScalarVertexPropertyGroup;

// ScriptStruct DataflowNodes.DataflowCollectionAddScalarVertexPropertyNode
// 0x00F8 (0x0290 - 0x0198)
struct FDataflowCollectionAddScalarVertexPropertyNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x0198(0x00B0)(NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0248(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCollectionAttributeKey                AttributeKey;                                      // 0x0258(0x0020)(NativeAccessSpecifierPublic)
	TArray<float>                                 VertexWeights;                                     // 0x0278(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FScalarVertexPropertyGroup             TargetGroup;                                       // 0x0288(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataflowCollectionAddScalarVertexPropertyNode;

// ScriptStruct DataflowNodes.MakeAttributeKeyDataflowNode
// 0x0040 (0x01D8 - 0x0198)
struct FMakeAttributeKeyDataflowNode final : public FDataflowNode
{
public:
	class FString                                 GroupIn;                                           // 0x0198(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AttributeIn;                                       // 0x01A8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCollectionAttributeKey                AttributeKeyOut;                                   // 0x01B8(0x0020)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMakeAttributeKeyDataflowNode;

// ScriptStruct DataflowNodes.BreakAttributeKeyDataflowNode
// 0x0040 (0x01D8 - 0x0198)
struct FBreakAttributeKeyDataflowNode final : public FDataflowNode
{
public:
	struct FCollectionAttributeKey                AttributeKeyIn;                                    // 0x0198(0x0020)(NativeAccessSpecifierPublic)
	class FString                                 AttributeOut;                                      // 0x01B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GroupOut;                                          // 0x01C8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBreakAttributeKeyDataflowNode;

// ScriptStruct DataflowNodes.FloatOverrideDataflowNode
// 0x0018 (0x01B0 - 0x0198)
struct FFloatOverrideDataflowNode final : public FDataflowNode
{
public:
	class FName                                   PropertyName;                                      // 0x0198(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   KeyName;                                           // 0x01A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValueOut;                                          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFloatOverrideDataflowNode;

// ScriptStruct DataflowNodes.SelectionSetDataflowNode
// 0x0020 (0x01B8 - 0x0198)
struct FSelectionSetDataflowNode final : public FDataflowNode
{
public:
	class FString                                 Indices;                                           // 0x0198(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 IndicesOut;                                        // 0x01A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSelectionSetDataflowNode;

// ScriptStruct DataflowNodes.GetSkeletalMeshDataflowNode
// 0x0010 (0x01A8 - 0x0198)
struct FGetSkeletalMeshDataflowNode final : public FDataflowNode
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0198(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class FName                                   PropertyName;                                      // 0x01A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGetSkeletalMeshDataflowNode;

// ScriptStruct DataflowNodes.GetSkeletonDataflowNode
// 0x0010 (0x01A8 - 0x0198)
struct FGetSkeletonDataflowNode final : public FDataflowNode
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0198(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class FName                                   PropertyName;                                      // 0x01A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGetSkeletonDataflowNode;

// ScriptStruct DataflowNodes.SkeletalMeshBoneDataflowNode
// 0x0020 (0x01B8 - 0x0198)
struct FSkeletalMeshBoneDataflowNode final : public FDataflowNode
{
public:
	class FName                                   BoneName;                                          // 0x0198(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	int32                                         BoneIndexOut;                                      // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x01AC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSkeletalMeshBoneDataflowNode;

// ScriptStruct DataflowNodes.SkeletalMeshReferenceTransformDataflowNode
// 0x0078 (0x0210 - 0x0198)
struct FSkeletalMeshReferenceTransformDataflowNode final : public FDataflowNode
{
public:
	class USkeletalMesh*                          SkeletalMeshIn;                                    // 0x0198(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	int32                                         BoneIndexIn;                                       // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0xC];                                      // 0x01A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TransformOut;                                      // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSkeletalMeshReferenceTransformDataflowNode;

// ScriptStruct DataflowNodes.GetStaticMeshDataflowNode
// 0x0010 (0x01A8 - 0x0198)
struct FGetStaticMeshDataflowNode final : public FDataflowNode
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0198(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class FName                                   PropertyName;                                      // 0x01A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGetStaticMeshDataflowNode;

}

