#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataListButtonHairLength_Widget_ASA

#include "Basic.hpp"

#include "ShooterGame_structs.hpp"


namespace SDK::Params
{

// Function DataListButtonHairLength_Widget_ASA.DataListButtonHairLength_Widget_ASA_C.ExecuteUbergraph_DataListButtonHairLength_Widget_ASA
// 0x0038 (0x0038 - 0x0000)
struct DataListButtonHairLength_Widget_ASA_C_ExecuteUbergraph_DataListButtonHairLength_Widget_ASA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_HairIndex;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsFemale;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USliderClamp_Widget_C*                  K2Node_DynamicCast_AsSlider_Clamp_Widget;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetQuantityMeshes_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_SetupTextValue_ReturnText;                // 0x0028(0x0010)()
};
DUMPER7_ASSERTS_DataListButtonHairLength_Widget_ASA_C_ExecuteUbergraph_DataListButtonHairLength_Widget_ASA;

// Function DataListButtonHairLength_Widget_ASA.DataListButtonHairLength_Widget_ASA_C.ExtraSetupWidget
// 0x0020 (0x0020 - 0x0000)
struct DataListButtonHairLength_Widget_ASA_C_ExtraSetupWidget final
{
public:
	class UPrimalUserWidget*                      UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuantityMeshes_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USliderClamp_Widget_C*                  K2Node_DynamicCast_AsSlider_Clamp_Widget;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataListButtonHairLength_Widget_ASA_C_ExtraSetupWidget;

// Function DataListButtonHairLength_Widget_ASA.DataListButtonHairLength_Widget_ASA_C.GetQuantityMeshes
// 0x0050 (0x0050 - 0x0000)
struct DataListButtonHairLength_Widget_ASA_C_GetQuantityMeshes final
{
public:
	int32                                         ReturnValue_0;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHairStyleDefinition>           DefinitionsLocal;                                  // 0x0008(0x0010)(Edit, BlueprintVisible)
	class UPrimalGameData*                        CallFunc_BPGetGameData_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHairStyleDefinition>           CallFunc_GetAllSelectableFacialHairDefinitions_ReturnValue; // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHairStyleDefinition>           CallFunc_GetAllSelectableHeadHairDefinitions_ReturnValue; // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataListButtonHairLength_Widget_ASA_C_GetQuantityMeshes;

// Function DataListButtonHairLength_Widget_ASA.DataListButtonHairLength_Widget_ASA_C.RefreshHairData
// 0x0008 (0x0008 - 0x0000)
struct DataListButtonHairLength_Widget_ASA_C_RefreshHairData final
{
public:
	int32                                         HairIndex_0;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFemale_0;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataListButtonHairLength_Widget_ASA_C_RefreshHairData;

// Function DataListButtonHairLength_Widget_ASA.DataListButtonHairLength_Widget_ASA_C.SetupTextValue
// 0x0048 (0x0048 - 0x0000)
struct DataListButtonHairLength_Widget_ASA_C_SetupTextValue final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ReturnText;                                        // 0x0010(0x0010)(Parm, OutParm)
	TArray<struct FHairStyleDefinition>           DefinitionsLocal;                                  // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_GetQuantityMeshes_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SetupTextValue_ReturnText;                // 0x0038(0x0010)()
};
DUMPER7_ASSERTS_DataListButtonHairLength_Widget_ASA_C_SetupTextValue;

}

