#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowEngine

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "DataflowEngine_structs.hpp"


namespace SDK
{

// Class DataflowEngine.Dataflow
// 0x0060 (0x00C0 - 0x0060)
class UDataflow final : public UEdGraph
{
public:
	uint8                                         Pad_60[0x38];                                      // 0x0060(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bActive;                                           // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Targets;                                           // 0x00A0(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UMaterial*                              Material;                                          // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	EDataflowType                                 Type;                                              // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Dataflow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Dataflow")
	}
	static class UDataflow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflow>();
	}
};
DUMPER7_ASSERTS_UDataflow;

// Class DataflowEngine.DataflowBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UDataflowBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void EvaluateTerminalNodeByName(class UDataflow* Dataflow, class FName TerminalNodeName, class UObject* ResultAsset);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataflowBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataflowBlueprintLibrary")
	}
	static class UDataflowBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UDataflowBlueprintLibrary;

// Class DataflowEngine.DataflowContentOwner
// 0x0000 (0x0000 - 0x0000)
class IDataflowContentOwner final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataflowContentOwner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataflowContentOwner")
	}
	static class IDataflowContentOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDataflowContentOwner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IDataflowContentOwner;

// Class DataflowEngine.DataflowContextObject
// 0x0050 (0x0078 - 0x0028)
class UDataflowContextObject : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataflowEdNode*                        SelectedNode;                                      // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataflow*                              DataflowGraph;                                     // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataflowContextObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataflowContextObject")
	}
	static class UDataflowContextObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowContextObject>();
	}
};
DUMPER7_ASSERTS_UDataflowContextObject;

// Class DataflowEngine.DataflowBaseContent
// 0x0030 (0x00A8 - 0x0078)
class UDataflowBaseContent : public UDataflowContextObject
{
public:
	class FString                                 DataflowTerminal;                                  // 0x0078(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                TerminalAsset;                                     // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsConstructionDirty;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSimulationDirty;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9A[0xE];                                       // 0x009A(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataflowBaseContent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataflowBaseContent")
	}
	static class UDataflowBaseContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowBaseContent>();
	}
};
DUMPER7_ASSERTS_UDataflowBaseContent;

// Class DataflowEngine.DataflowSkeletalContent
// 0x0018 (0x00C0 - 0x00A8)
class UDataflowSkeletalContent final : public UDataflowBaseContent
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x00A8(0x0008)(Edit, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UAnimationAsset*                        AnimationAsset;                                    // 0x00B0(0x0008)(Edit, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataflowSkeletalContent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataflowSkeletalContent")
	}
	static class UDataflowSkeletalContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowSkeletalContent>();
	}
};
DUMPER7_ASSERTS_UDataflowSkeletalContent;

// Class DataflowEngine.DataflowEdNode
// 0x0028 (0x00C8 - 0x00A0)
class UDataflowEdNode final : public UEdGraphNode
{
public:
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bRenderInAssetEditor;                              // 0x00C0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRenderWireframeInAssetEditor;                     // 0x00C1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanEnableRenderWireframe;                         // 0x00C2(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataflowEdNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataflowEdNode")
	}
	static class UDataflowEdNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataflowEdNode>();
	}
};
DUMPER7_ASSERTS_UDataflowEdNode;

}

