#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataListEntryWidget_SortingEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DataListEntryWidget_SortingEntry.DataListEntryWidget_SortingEntry_C
// 0x0028 (0x0468 - 0x0440)
class UDataListEntryWidget_SortingEntry_C final : public UDataListEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMenuAnchor*                            CtxMenu;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedImage;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataListEntryButton_PrimalItem*        TheDataListButton;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          LastSelected;                                      // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_DataListEntryWidget_SortingEntry(int32 EntryPoint);

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DataListEntryWidget_SortingEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataListEntryWidget_SortingEntry_C")
	}
	static class UDataListEntryWidget_SortingEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataListEntryWidget_SortingEntry_C>();
	}
};
DUMPER7_ASSERTS_UDataListEntryWidget_SortingEntry_C;

}

