#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataListEntryWidgetDLC

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function DataListEntryWidgetDLC.DataListEntryWidgetDLC_C.ExecuteUbergraph_DataListEntryWidgetDLC
// 0x0018 (0x0018 - 0x0000)
struct DataListEntryWidgetDLC_C_ExecuteUbergraph_DataListEntryWidgetDLC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDLC*                                   K2Node_DynamicCast_AsDLC;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataListEntryWidgetDLC_C_ExecuteUbergraph_DataListEntryWidgetDLC;

// Function DataListEntryWidgetDLC.DataListEntryWidgetDLC_C.OnPaint
// 0x0040 (0x0040 - 0x0000)
struct DataListEntryWidgetDLC_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UDLC*                                   K2Node_DynamicCast_AsDLC;                          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataListEntryWidgetDLC_C_OnPaint;

}

