#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataListEntryWidget_SortingEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function DataListEntryWidget_SortingEntry.DataListEntryWidget_SortingEntry_C.ExecuteUbergraph_DataListEntryWidget_SortingEntry
// 0x0004 (0x0004 - 0x0000)
struct DataListEntryWidget_SortingEntry_C_ExecuteUbergraph_DataListEntryWidget_SortingEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataListEntryWidget_SortingEntry_C_ExecuteUbergraph_DataListEntryWidget_SortingEntry;

// Function DataListEntryWidget_SortingEntry.DataListEntryWidget_SortingEntry_C.OnPaint
// 0x0038 (0x0038 - 0x0000)
struct DataListEntryWidget_SortingEntry_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsMenuAnchorOpen_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataListEntryWidget_SortingEntry_C_OnPaint;

}

