#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataListButtonHairLength_Widget_ASA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DataListButtonVariable_Widget_ASA_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DataListButtonHairLength_Widget_ASA.DataListButtonHairLength_Widget_ASA_C
// 0x0018 (0x04F0 - 0x04D8)
class UDataListButtonHairLength_Widget_ASA_C final : public UDataListButtonVariable_Widget_ASA_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DataListButtonHairLength_Widget_ASA_C; // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsFacialHair;                                      // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HairIndex;                                         // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFemale;                                          // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DataListButtonHairLength_Widget_ASA(int32 EntryPoint);
	void ExtraSetupWidget(class UPrimalUserWidget* UserWidget, int32 Index_0);
	int32 GetQuantityMeshes();
	void RefreshHairData(int32 HairIndex_0, bool IsFemale_0);
	void SetupTextValue(const class FText& Text, class FText* ReturnText);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DataListButtonHairLength_Widget_ASA_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataListButtonHairLength_Widget_ASA_C")
	}
	static class UDataListButtonHairLength_Widget_ASA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataListButtonHairLength_Widget_ASA_C>();
	}
};
DUMPER7_ASSERTS_UDataListButtonHairLength_Widget_ASA_C;

}

