#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataListEntryWidgetPrimalItem_SlotBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DataListEntryWidgetPrimalItem_SlotBar.DataListEntryWidgetPrimalItem_SlotBar_C
// 0x0028 (0x0468 - 0x0440)
class UDataListEntryWidgetPrimalItem_SlotBar_C final : public UDataListEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                BorderBar;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CoolDownTime;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ExtraProgressBar;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataListEntryButton_PrimalItem*        TheDataListButton;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DataListEntryWidgetPrimalItem_SlotBar(int32 EntryPoint);
	void GetFillPercentForBar(double ForInitialPercent, double* FillPercent, double* ExtraPercent);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DataListEntryWidgetPrimalItem_SlotBar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataListEntryWidgetPrimalItem_SlotBar_C")
	}
	static class UDataListEntryWidgetPrimalItem_SlotBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataListEntryWidgetPrimalItem_SlotBar_C>();
	}
};
DUMPER7_ASSERTS_UDataListEntryWidgetPrimalItem_SlotBar_C;

}

