#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataListEntryWidgetAllPaintings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ShooterGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DataListEntryWidgetAllPaintings.DataListEntryWidgetAllPaintings_C
// 0x0040 (0x0480 - 0x0440)
class UDataListEntryWidgetAllPaintings_C final : public UDataListEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAllPaintingsEntryButton*               PaintingEntryButton;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           SelectedColorBG;                                   // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnSelectedColorBG;                                 // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           UnSelectedPairColorBG;                             // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_DataListEntryWidgetAllPaintings(int32 EntryPoint);

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DataListEntryWidgetAllPaintings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataListEntryWidgetAllPaintings_C")
	}
	static class UDataListEntryWidgetAllPaintings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataListEntryWidgetAllPaintings_C>();
	}
};
DUMPER7_ASSERTS_UDataListEntryWidgetAllPaintings_C;

}

