#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DaySequence

#include "Basic.hpp"

#include "DaySequence_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class DaySequence.DaySequenceActor
// 0x0168 (0x05E8 - 0x0480)
class ADaySequenceActor : public AInfo
{
public:
	uint8                                         Pad_480[0x10];                                     // 0x0480(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DayInterpCurve;                                    // 0x0490(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UDaySequenceCollectionAsset*            DaySequenceCollection;                             // 0x0498(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	int32                                         Bias;                                              // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneBindingOverrides*            BindingOverrides;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         bReplicatePlayback : 1;                            // 0x04B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDaySequencePlayer*                     SequencePlayer;                                    // 0x04B8(0x0008)(ExportObject, Net, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UDaySequence*                           RootSequence;                                      // 0x04C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	float                                         SequenceUpdateInterval;                            // 0x04C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRunDayCycle;                                      // 0x04CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseInterpCurve;                                   // 0x04CD(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4CE[0x2];                                      // 0x04CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDaySequenceTime                       DayLength;                                         // 0x04D0(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDaySequenceTime                       TimePerCycle;                                      // 0x04DC(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDaySequenceTime                       InitialTimeOfDay;                                  // 0x04E8(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4F4[0xA4];                                     // 0x04F4(0x00A4)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TSubclassOf<class UDaySequenceConditionTag>, class UDaySequenceConditionTag*> TrackConditionMap; // 0x0598(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	bool ContainsDaySequence(const class UDaySequence* InDaySequence);
	void Multicast_SetTimePerCycle(float InHours);
	void Pause();
	void Play();
	void SetReplicatePlayback(bool ReplicatePlayback);
	bool SetTimeOfDay(float InHours);
	void SetTimeOfDayPreview(float InHours);
	void StartDaySequenceUpdateTimer();
	void StopDaySequenceUpdateTimer();

	float GetDayLength() const;
	float GetInitialTimeOfDay() const;
	float GetStaticTimeOfDay() const;
	float GetTimeOfDay() const;
	float GetTimeOfDayPreview() const;
	float GetTimePerCycle() const;
	bool HasStaticTimeOfDay() const;
	bool IsPaused() const;
	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceActor")
	}
	static class ADaySequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADaySequenceActor>();
	}
};
DUMPER7_ASSERTS_ADaySequenceActor;

// Class DaySequence.BaseDaySequenceActor
// 0x0038 (0x0620 - 0x05E8)
class ABaseDaySequenceActor : public ADaySequenceActor
{
public:
	class USceneComponent*                        SunRootComponent;                                  // 0x05E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UDirectionalLightComponent*             SunComponent;                                      // 0x05F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class USkyAtmosphereComponent*                SkyAtmosphereComponent;                            // 0x05F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class USkyLightComponent*                     SkyLightComponent;                                 // 0x0600(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UExponentialHeightFogComponent*         ExponentialHeightFogComponent;                     // 0x0608(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UVolumetricCloudComponent*              VolumetricCloudComponent;                          // 0x0610(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UStaticMeshComponent*                   SkySphereComponent;                                // 0x0618(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseDaySequenceActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseDaySequenceActor")
	}
	static class ABaseDaySequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseDaySequenceActor>();
	}
};
DUMPER7_ASSERTS_ABaseDaySequenceActor;

// Class DaySequence.DaySequenceCheatManagerExtension
// 0x0000 (0x0028 - 0x0028)
class UDaySequenceCheatManagerExtension final : public UCheatManagerExtension
{
public:
	void SetTimeOfDaySequenceActor(float NewTimeOfDay) const;
	void SetTimeOfDaySpeed(float NewTimeOfDaySpeedMultiplier) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceCheatManagerExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceCheatManagerExtension")
	}
	static class UDaySequenceCheatManagerExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceCheatManagerExtension>();
	}
};
DUMPER7_ASSERTS_UDaySequenceCheatManagerExtension;

// Class DaySequence.DaySequenceConditionTag
// 0x0030 (0x0058 - 0x0028)
class UDaySequenceConditionTag final : public UObject
{
public:
	class FString                                 ConditionName;                                     // 0x0028(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BroadcastOnConditionValueChanged() const;
	bool Evaluate() const;
	void SetupOnConditionValueChanged() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceConditionTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceConditionTag")
	}
	static class UDaySequenceConditionTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceConditionTag>();
	}
};
DUMPER7_ASSERTS_UDaySequenceConditionTag;

// Class DaySequence.DaySequenceModifierEasingFunction
// 0x0048 (0x0070 - 0x0028)
class UDaySequenceModifierEasingFunction final : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceModifierEasingFunction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceModifierEasingFunction")
	}
	static class UDaySequenceModifierEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceModifierEasingFunction>();
	}
};
DUMPER7_ASSERTS_UDaySequenceModifierEasingFunction;

// Class DaySequence.DaySequenceModifierComponent
// 0x00D0 (0x0330 - 0x0260)
class UDaySequenceModifierComponent final : public USceneComponent
{
public:
	class ADaySequenceActor*                      TargetActor;                                       // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_260[0x10];                                     // 0x0260(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FComponentReference>            VolumeShapeComponents;                             // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class APlayerController>       WeakBlendTarget;                                   // 0x0280(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDaySequence*                           UserDaySequence;                                   // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UDaySequence*                           TransientSequence;                                 // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UDaySequenceCollectionAsset*            DaySequenceCollection;                             // 0x0298(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UDaySequenceModifierEasingFunction*     EasingFunction;                                    // 0x02A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	int32                                         Bias;                                              // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DayNightCycleTime;                                 // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlendAmount;                                       // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UserBlendWeight;                                   // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDayNightCycleMode                            DayNightCycle;                                     // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDaySequenceModifierMode                      Mode;                                              // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EDaySequenceModifierUserBlendPolicy           BlendPolicy;                                       // 0x02BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2BB[0x5];                                      // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPostReinitializeSubSequences;                    // 0x02C0(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnPostEnableModifier;                              // 0x02D0(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         bIgnoreBias : 1;                                   // 0x02E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsComponentEnabled : 1;                           // 0x02E0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsEnabled : 1;                                    // 0x02E0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, DuplicateTransient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bPreview : 1;                                      // 0x02E0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bUseCollection : 1;                                // 0x02E0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bSmoothBlending : 1;                               // 0x02E0(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_2E1[0x4F];                                     // 0x02E1(0x004F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindToDaySequenceActor(class ADaySequenceActor* DaySequenceActor);
	void DisableComponent();
	void EnableComponent();
	void SetBlendTarget(class APlayerController* InActor);
	void UnbindFromDaySequenceActor();

	float GetBlendWeight() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceModifierComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceModifierComponent")
	}
	static class UDaySequenceModifierComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceModifierComponent>();
	}
};
DUMPER7_ASSERTS_UDaySequenceModifierComponent;

// Class DaySequence.DaySequenceModifierVolume
// 0x0038 (0x04B8 - 0x0480)
class ADaySequenceModifierVolume final : public AActor
{
public:
	class UDaySequenceModifierComponent*          DaySequenceModifier;                               // 0x0480(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UBoxComponent*                          DefaultBox;                                        // 0x0488(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class ADaySequenceActor*                      DaySequenceActor;                                  // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class APlayerController*                      CachedPlayerController;                            // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class AActor*                                 CurrentBlendTarget;                                // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_4A8[0x10];                                     // 0x04A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDaySequenceActorBound(class ADaySequenceActor* InActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceModifierVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceModifierVolume")
	}
	static class ADaySequenceModifierVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADaySequenceModifierVolume>();
	}
};
DUMPER7_ASSERTS_ADaySequenceModifierVolume;

// Class DaySequence.DaySequenceStaticTimeContributor
// 0x0018 (0x0040 - 0x0028)
class UDaySequenceStaticTimeContributor final : public UObject
{
public:
	float                                         BlendWeight;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaticTime;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWantsStaticTime;                                  // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADaySequenceActor*                      TargetActor;                                       // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	void BindToDaySequenceActor(class ADaySequenceActor* InTargetActor, int32 Priority);
	void UnbindFromDaySequenceActor();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceStaticTimeContributor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceStaticTimeContributor")
	}
	static class UDaySequenceStaticTimeContributor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceStaticTimeContributor>();
	}
};
DUMPER7_ASSERTS_UDaySequenceStaticTimeContributor;

// Class DaySequence.ProceduralDaySequenceBuilder
// 0x0028 (0x0050 - 0x0028)
class UProceduralDaySequenceBuilder final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddBoolKey(class FName PropertyName, float Key, bool Value);
	void AddBoolOverride(class FName PropertyName, bool Value);
	void AddColorMaterialParameterOverride(class FName ParameterName, int32 MaterialIndex, const struct FLinearColor& Value);
	void AddColorOverride(class FName PropertyName, const struct FLinearColor& Value);
	void AddMaterialOverride(int32 MaterialIndex, class UMaterialInterface* Value);
	void AddRotationKey(float Key, const struct FRotator& Value, ERichCurveInterpMode InterpMode);
	void AddScalarKey(class FName PropertyName, float Key, double Value, ERichCurveInterpMode InterpMode);
	void AddScalarMaterialParameterOverride(class FName ParameterName, int32 MaterialIndex, float Value);
	void AddScalarOverride(class FName PropertyName, double Value);
	void AddScaleKey(float Key, const struct FVector& Value, ERichCurveInterpMode InterpMode);
	void AddTransformOverride(const struct FTransform& Value);
	void AddTranslationKey(float Key, const struct FVector& Value, ERichCurveInterpMode InterpMode);
	void AddVectorKey(class FName PropertyName, float Key, const struct FVector& Value, ERichCurveInterpMode InterpMode);
	void AddVectorOverride(class FName PropertyName, const struct FVector& Value);
	void AddVisibilityOverride(bool bValue);
	void ClearKeys();
	class UDaySequence* Initialize(class ADaySequenceActor* InActor, class UDaySequence* InitialSequence, bool bClearInitialSequence);
	void SetActiveBoundObject(class UObject* InObject);

	bool IsInitialized() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralDaySequenceBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralDaySequenceBuilder")
	}
	static class UProceduralDaySequenceBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralDaySequenceBuilder>();
	}
};
DUMPER7_ASSERTS_UProceduralDaySequenceBuilder;

// Class DaySequence.SunMoonDaySequenceActor
// 0x0008 (0x0628 - 0x0620)
class ASunMoonDaySequenceActor final : public ABaseDaySequenceActor
{
public:
	class UDirectionalLightComponent*             MoonComponent;                                     // 0x0620(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SunMoonDaySequenceActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SunMoonDaySequenceActor")
	}
	static class ASunMoonDaySequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASunMoonDaySequenceActor>();
	}
};
DUMPER7_ASSERTS_ASunMoonDaySequenceActor;

// Class DaySequence.DaySequence
// 0x00C8 (0x0130 - 0x0068)
class UDaySequence final : public UMovieSceneSequence
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieScene*                            MovieScene;                                        // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FDaySequenceBindingReferences          BindingReferences;                                 // 0x0078(0x00A0)(Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UObject>                    DirectorClass;                                     // 0x0118(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x0120(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequence")
	}
	static class UDaySequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequence>();
	}
};
DUMPER7_ASSERTS_UDaySequence;

// Class DaySequence.DaySequenceCollectionAsset
// 0x0020 (0x0050 - 0x0030)
class UDaySequenceCollectionAsset final : public UDataAsset
{
public:
	TArray<struct FDaySequenceCollectionEntry>    DaySequences;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ProceduralDaySequences;                            // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceCollectionAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceCollectionAsset")
	}
	static class UDaySequenceCollectionAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceCollectionAsset>();
	}
};
DUMPER7_ASSERTS_UDaySequenceCollectionAsset;

// Class DaySequence.DaySequenceDirector
// 0x0010 (0x0038 - 0x0028)
class UDaySequenceDirector final : public UObject
{
public:
	class UDaySequencePlayer*                     Player;                                            // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	int32                                         SubSequenceID;                                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MovieScenePlayerIndex;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class AActor* GetBoundActor(const struct FMovieSceneObjectBindingID& ObjectBinding);
	TArray<class AActor*> GetBoundActors(const struct FMovieSceneObjectBindingID& ObjectBinding);
	class UObject* GetBoundObject(const struct FMovieSceneObjectBindingID& ObjectBinding);
	TArray<class UObject*> GetBoundObjects(const struct FMovieSceneObjectBindingID& ObjectBinding);
	class UMovieSceneSequence* GetSequence();
	void OnCreated();

	struct FQualifiedFrameTime GetCurrentTime() const;
	struct FQualifiedFrameTime GetRootSequenceTime() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceDirector")
	}
	static class UDaySequenceDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceDirector>();
	}
};
DUMPER7_ASSERTS_UDaySequenceDirector;

// Class DaySequence.DaySequencePlayer
// 0x0448 (0x0470 - 0x0028)
class UDaySequencePlayer final : public UObject
{
public:
	uint8                                         Pad_28[0x1F0];                                     // 0x0028(0x01F0)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMovieSceneSequencePlayerObserver> Observer;                              // 0x0218(0x0010)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlay;                                            // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlayReverse;                                     // 0x0238(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnStop;                                            // 0x0248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPause;                                           // 0x0258(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFinished;                                        // 0x0268(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x10];                                     // 0x0278(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EMovieScenePlayerStatus                       status;                                            // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneSequence*                    Sequence;                                          // 0x0290(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	struct FFrameNumber                           StartTime;                                         // 0x0298(0x0004)(Net, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DurationFrames;                                    // 0x029C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DurationSubFrames;                                 // 0x02A0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentNumLoops;                                   // 0x02A4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SerialNumber;                                      // 0x02A8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMovieSceneSequencePlaybackSettings    PlaybackSettings;                                  // 0x02AC(0x0028)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance;                           // 0x02D8(0x0020)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F8[0x84];                                     // 0x02F8(0x0084)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequenceReplProperties      NetSyncProps;                                      // 0x037C(0x0014)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TScriptInterface<class IMovieScenePlaybackClient> PlaybackClient;                                // 0x0390(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A0[0xA0];                                     // 0x03A0(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneEntitySystemLinker*          Linker;                                            // 0x0440(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_448[0x28];                                     // 0x0448(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class UObject*> GetBoundObjects(const struct FMovieSceneObjectBindingID& ObjectBinding);
	bool GetDisableCameraCuts();
	TArray<struct FMovieSceneObjectBindingID> GetObjectBindings(class UObject* InObject);
	void GoToEndAndStop();
	void Play();
	void PlayLooping(int32 NumLoops);
	void RemoveWeight();
	void RequestInvalidateBinding(const struct FMovieSceneObjectBindingID& ObjectBinding);
	void RPC_ExplicitServerUpdateEvent(EUpdatePositionMethod Method, const struct FFrameTime& RelevantTime, int32 NewSerialNumber);
	void RPC_OnFinishPlaybackEvent(const struct FFrameTime& StoppedTime, int32 NewSerialNumber);
	void RPC_OnStopEvent(const struct FFrameTime& StoppedTime, int32 NewSerialNumber);
	void Scrub();
	void SetCompletionModeOverride(EMovieSceneCompletionModeOverride CompletionModeOverride);
	void SetDisableCameraCuts(bool bInDisableCameraCuts);
	void SetFrameRange(int32 StartFrame, int32 Duration, float SubFrames);
	void SetFrameRate(const struct FFrameRate& FrameRate);
	void SetPlayRate(float PlayRate);
	void SetWeight(double InWeight);
	void Stop();
	void StopAtCurrentTime();

	EMovieSceneCompletionModeOverride GetCompletionModeOverride() const;
	struct FQualifiedFrameTime GetEndTime() const;
	int32 GetFrameDuration() const;
	struct FFrameRate GetFrameRate() const;
	float GetPlayRate() const;
	class UMovieSceneSequence* GetSequence() const;
	class FString GetSequenceName(bool bAddClientInfo) const;
	struct FQualifiedFrameTime GetStartTime() const;
	bool IsPaused() const;
	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequencePlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequencePlayer")
	}
	static class UDaySequencePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequencePlayer>();
	}
};
DUMPER7_ASSERTS_UDaySequencePlayer;

// Class DaySequence.DaySequenceProjectSettings
// 0x0030 (0x0068 - 0x0038)
class UDaySequenceProjectSettings final : public UDeveloperSettings
{
public:
	bool                                          bDefaultLockEngineToDisplayRate;                   // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DefaultDisplayRate;                                // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultTickResolution;                             // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUpdateClockSource                            DefaultClockSource;                                // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceProjectSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceProjectSettings")
	}
	static class UDaySequenceProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceProjectSettings>();
	}
};
DUMPER7_ASSERTS_UDaySequenceProjectSettings;

// Class DaySequence.DaySequenceProvider
// 0x0010 (0x0490 - 0x0480)
class ADaySequenceProvider : public AActor
{
public:
	TArray<class UDaySequence*>                   DaySequenceAssets;                                 // 0x0480(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceProvider")
	}
	static class ADaySequenceProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADaySequenceProvider>();
	}
};
DUMPER7_ASSERTS_ADaySequenceProvider;

// Class DaySequence.DaySequenceSubsystem
// 0x0038 (0x0068 - 0x0030)
class UDaySequenceSubsystem final : public UWorldSubsystem
{
public:
	TMulticastInlineDelegate<void(class ADaySequenceActor* NewActor)> OnDaySequenceActorSet;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDaySequenceActor(class ADaySequenceActor* InActor);

	class ADaySequenceActor* GetDaySequenceActor(bool bFindFallbackOnNull) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceSubsystem")
	}
	static class UDaySequenceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceSubsystem>();
	}
};
DUMPER7_ASSERTS_UDaySequenceSubsystem;

// Class DaySequence.DaySequenceTrack
// 0x0000 (0x0108 - 0x0108)
class UDaySequenceTrack final : public UMovieSceneSubTrack
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DaySequenceTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DaySequenceTrack")
	}
	static class UDaySequenceTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDaySequenceTrack>();
	}
};
DUMPER7_ASSERTS_UDaySequenceTrack;

// Class DaySequence.EnvironmentLightingActor
// 0x0030 (0x04C0 - 0x0490)
class AEnvironmentLightingActor final : public ADaySequenceProvider
{
public:
	class USkyAtmosphereComponent*                SkyAtmosphereComponent;                            // 0x0490(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class USkyLightComponent*                     SkyLightComponent;                                 // 0x0498(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class USceneComponent*                        SunRootComponent;                                  // 0x04A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UDirectionalLightComponent*             SunComponent;                                      // 0x04A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UExponentialHeightFogComponent*         ExponentialHeightFogComponent;                     // 0x04B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UVolumetricCloudComponent*              VolumetricCloudComponent;                          // 0x04B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvironmentLightingActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvironmentLightingActor")
	}
	static class AEnvironmentLightingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEnvironmentLightingActor>();
	}
};
DUMPER7_ASSERTS_AEnvironmentLightingActor;

}

