#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dino_Character_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DinoContentData_structs.hpp"
#include "ShooterGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Dino_Character_BP.Dino_Character_BP_C
// 0x00B0 (0x2A10 - 0x2960)
#pragma pack(push, 0x1)
class alignas(0x10) ADino_Character_BP_C : public APrimalDinoCharacter
{
public:
	uint8                                         Pad_2958[0x8];                                     // 0x2958(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2960(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       StasisComponent;                                   // 0x2968(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequence*>                  AlternateDeathAnims;                               // 0x2970(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDinoContentData                       ContentData;                                       // 0x2980(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GeneratedBlendSpaces;                              // 0x29A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A1[0x7];                                     // 0x29A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PostDestructionFootstepLifespan;                   // 0x29A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SupportsConsumablesAutoTransfer;                   // 0x29B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, ExperimentalAlwaysOverriden)
	uint8                                         Pad_29B1[0x7];                                     // 0x29B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   HarnesSaddleItem;                                  // 0x29B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        CartBodyPitchOffset;                               // 0x29E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisableConsumablesTransferText;                    // 0x29E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EnableConsumablesTransferText;                     // 0x29F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Dino_Character_BP(int32 EntryPoint);
	void BPCameraAllowPivotPitchModifiers(bool* bAllow);
	void SetSubmarineStructure(class APrimalStructure* Structure);
	TArray<struct FMultiUseEntry> BPGetRidingMultiUseEntries(class APlayerController* ForPC, const TArray<struct FMultiUseEntry>& MultiUseEntries);
	void FearTheManticore(bool ShouldFear);
	bool BPTryMultiUse(class APlayerController* ForPC, int32 UseIndex);
	TArray<struct FMultiUseEntry> BPGetMultiUseEntries(class APlayerController* ForPC, const TArray<struct FMultiUseEntry>& MultiUseEntries);
	bool BPOverrideCameraDesiredPivotLocation(const struct FVector& CurrentCameraPivotLocation, struct FVector& DesiredCameraPivotLocation);
	bool BPOverrideCameraDesiredPivotRotation(const struct FRotator& CurrentCameraPivotRotation, struct FRotator& DesiredCameraPivotRotation);
	bool BPOverrideCameraDesiredPivotOffset(const struct FPrimalCameraParams& CameraParams, struct FVector& DesiredCameraOffset);
	bool BPOverrideCameraPivotLocationInterpParams(const struct FPrimalCameraParams& CameraParams, const struct FPrimalCameraPivotZInterpOverrides& PivotZInterpOverrides, const struct FPrimalCameraInterpParams& LastInterpParamsX, const struct FPrimalCameraInterpParams& LastInterpParamsY, const struct FPrimalCameraInterpParams& LastInterpParamsZ, struct FPrimalCameraInterpParams& OutInterpParamsX, struct FPrimalCameraInterpParams& OutInterpParamsY, struct FPrimalCameraInterpParams& OutInterpParamsZ);
	bool BPOverrideCameraArmLengthInterpParams(const struct FPrimalCameraParams& CameraParams, struct FPrimalCameraInterpParams& OutInterpParams);
	bool BPOverrideCameraArmLength(const struct FPrimalCameraParams& CameraParams, float CurrentCameraArmLength, float& DesiredCameraArmLength);
	struct FLinearColor GetFXBloodColor();
	void GetDinoContentData(struct FDinoContentData* DinoContentData);
	bool BPHandleRightShoulderButton();
	void EditorBeginPlay();
	void BP_OnSetDeath();
	void BlendSpaceGenerated(class UBlendSpace* BlendSpace);
	void ReceiveDestroyed();
	void BPTriggerStasisEvent();
	void BPSpawnAttackerDamageImpactFX(class FName SocketName, class APrimalCharacter* VictimChar);

	void BPControlRigNotify(class FName NotifyName, class FName NotifyCustomTag, const struct FHitResult& WorldSpaceHitResult, const struct FVector& Velocity) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Dino_Character_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Dino_Character_BP_C")
	}
	static class ADino_Character_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADino_Character_BP_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ADino_Character_BP_C;

}

