#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dino_Character_BP_DivingFlyer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Dino_Character_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Dino_Character_BP_DivingFlyer.Dino_Character_BP_DivingFlyer_C
// 0x01B0 (0x2BC0 - 0x2A10)
class ADino_Character_BP_DivingFlyer_C final : public ADino_Character_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Dino_Character_BP_DivingFlyer_C;    // 0x2A08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsLocallyCarried;                                  // 0x2A10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugDivingFlyer;                                 // 0x2A11(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A12[0x6];                                     // 0x2A12(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Diving_RequiredVelocityToDiveAttack;               // 0x2A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RiderStartFOV;                                     // 0x2A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_MultRatioOnImpact;                          // 0x2A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DiveLandingStartMeshRotation;                      // 0x2A30(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        MaxDiveBombCameraShakeScale_FPV;                   // 0x2A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDiveBombCameraShakeScale_TPV;                   // 0x2A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMeshInterpolating;                                // 0x2A58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A59[0x7];                                     // 0x2A59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               meshTargetRotation;                                // 0x2A60(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        meshInterpSpeed_rotation;                          // 0x2A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDiving;                                         // 0x2A80(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A81[0x7];                                     // 0x2A81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Diving_Multiplier_Velocity_Current;                // 0x2A88(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_Ratio_Current;                              // 0x2A90(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWantsToDive;                                      // 0x2A98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A99[0x7];                                     // 0x2A99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Diving_Multiplier_RotationRate;                    // 0x2AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_RotationRate_Pitch;                         // 0x2AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_Multiplier_Velocity_Max;                    // 0x2AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_Multipier_Camera_FOV;                       // 0x2AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_StaminaCost_Tick;                           // 0x2AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Diving_CameraShake;                                // 0x2AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Diving_CameraShake_DiveBomb;                       // 0x2AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Diving_CameraShake_Crash;                          // 0x2AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_AllowBelowFlyingPitch_Enter;                // 0x2AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_AllowBelowFlyingPitch_Exit;                 // 0x2AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_InterpSpeed_Ratio_Up;                       // 0x2AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_InterpSpeed_Ratio_Down;                     // 0x2AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_InterpSpeed_VelocityMultiplier_Down;        // 0x2B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_InterpSpeed_VelocityMultiplier_Up;          // 0x2B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_Camera_Shake_Scale;                         // 0x2B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_Camera_Shake_Speed;                         // 0x2B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Diving_AttackIndex_DiveAttack;                     // 0x2B20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Diving_AttackIndex_DiveBomb;                       // 0x2B24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_RequiredMinVelocityToContinue;              // 0x2B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequireTamedToDive;                               // 0x2B30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDiving_AllowDiveWhileCarrying;                    // 0x2B31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPreventEquippingWeaponsWhileDiving;               // 0x2B32(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B33[0x5];                                     // 0x2B33(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Diving_Abort_Montage;                              // 0x2B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bDiving_AllowDiveLanding;                          // 0x2B40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDiving_AllowDiveBomb;                             // 0x2B41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDiving_AllowFlyingRunLanding;                     // 0x2B42(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B43[0x5];                                     // 0x2B43(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Diving_LandFromDive_Montage;                       // 0x2B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bDiving_AllowGrabWhileDiving;                      // 0x2B50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B51[0x7];                                     // 0x2B51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Diving_RiderBuff;                                  // 0x2B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APrimalBuff*                            Ref_DivingRiderBuff;                               // 0x2B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_RequiredMultRatioToDiveBomb;                // 0x2B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastDivingVelocity;                                // 0x2B70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDiveLanding;                                    // 0x2B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B89[0x7];                                     // 0x2B89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Diving_InterpSpeed_VelocityMultiplier_OnGround;    // 0x2B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Diving_StaminaCost_Start;                          // 0x2B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsReturningToZeroPitch;                           // 0x2BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA1[0x7];                                     // 0x2BA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Diving_ReturnToZeroPitchSpeed;                     // 0x2BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DiveRequiredDownVectorToDiveBomb;                  // 0x2BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AbortDive(bool bPlayAbortAnim);
	void AllowDiving(bool* Result);
	float BP_GetCustomModifier_MaxSpeed();
	float BP_GetCustomModifier_RotationRate();
	void BP_OnSetRunning(bool bNewIsRunning);
	void BP_OnStartLandingNotify();
	bool BPForceTurretFastTargeting();
	float BPModifyFOV(float FOVIn);
	void BPNotifyClearRider(class AShooterCharacter* RiderClearing);
	void BPNotifySetRider(class AShooterCharacter* RiderSetting);
	void BPOnMovementModeChangedNotify(EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void BPTimerNonDedicated();
	void CanFlyerDive(bool* Result);
	void DebugDiveVals();
	void DiveBomb();
	void Diving_Start();
	void Diving_Stop();
	void Diving_Tick(double DeltaSeconds);
	void DoStopEncapsulate();
	void ExecuteUbergraph_Dino_Character_BP_DivingFlyer(int32 EntryPoint);
	void Get_DefaultDivingFlyer(class ADino_Character_BP_DivingFlyer_C** Default);
	void Get_Diving_Required_VelocityToStart(double* float_0);
	void Get_Diving_Velocity_Mult_Ratio(double* Result);
	void Get_Diving_Velocity_Mult_Ratio_Pure(double* Result);
	void Get_Flyer_Dive_Velocity_Max(double* maxVelocity);
	void Get_Flyer_Dive_Velocity_MaxPure(double* maxVelocity);
	void Get_Flyer_Dive_Velocity_Ratio(double* Ratio);
	void Get_Flyer_Dive_Velocity_Ratio_Pure(double* Ratio);
	struct FVector GetCurrentAcceleration();
	void GetDefaultMaxFlySpeed(double* MaxFlySpeed);
	void Has_Diving_Momentum(bool* Result);
	void Has_Diving_Momentum_Pure(bool* Result);
	void HasEnoughStaminaToDive(bool* Result);
	void HasLocallyCarriedPlayer(bool* bLocallyCarried);
	void Interp_Diver_Mesh();
	void Is_Diver_Moving_Forward(bool* Result);
	void IsDiving(bool* Result);
	void Multi_LandFromDive(const struct FRotator& MeshRotation);
	void OnDiveCrash(class AActor* HitActor, class USceneComponent* HitComp, const struct FHitResult& HitResult);
	void OnRep_bIsDiving();
	void OwningClientDiveBombCameraShake(double Intensity);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveTick(float DeltaSeconds);
	void ReduceDiverStamina(double Cost);
	void ResetDivingVars();
	void ReturnDivingFlyerToZeroPitchRotation(double DeltaTime);
	void Server_SetIsDiving(bool newDiving);
	void Set_Is_Diving(bool newDiving, bool forceSet);
	void TriggerDiveBomb();
	void UpdateDiving(double DeltaSeconds);
	void UpdateDivingFX();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Dino_Character_BP_DivingFlyer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Dino_Character_BP_DivingFlyer_C")
	}
	static class ADino_Character_BP_DivingFlyer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADino_Character_BP_DivingFlyer_C>();
	}
};
DUMPER7_ASSERTS_ADino_Character_BP_DivingFlyer_C;

}

