#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DinoBase_FlySwimming_LinkedGraph_FootIK

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass DinoBase_FlySwimming_LinkedGraph_FootIK.DinoBase_FlySwimming_LinkedGraph_FootIK_C
// 0x00F0 (0x04B0 - 0x03C0)
class UDinoBase_FlySwimming_LinkedGraph_FootIK_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03C0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03C8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03F0(0x00B8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DinoBase_FlySwimming_LinkedGraph_FootIK_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DinoBase_FlySwimming_LinkedGraph_FootIK_C")
	}
	static class UDinoBase_FlySwimming_LinkedGraph_FootIK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDinoBase_FlySwimming_LinkedGraph_FootIK_C>();
	}
};
DUMPER7_ASSERTS_UDinoBase_FlySwimming_LinkedGraph_FootIK_C;

}

