#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Door_Tek_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Door_Base_SM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Door_Tek_Base.Door_Tek_Base_C
// 0x0080 (0x0CE0 - 0x0C60)
class ADoor_Tek_Base_C : public ADoor_Base_SM_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          OverlapBox;                                        // 0x0C68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        DoorInterpDestValue;                               // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DoorInterpCurrentValue;                            // 0x0C78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DoorMatInterpSpeed;                                // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DoorAutoCloseRadius;                               // 0x0C88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AutoOpenSetting;                                   // 0x0C90(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StayOpenSetting;                                   // 0x0C94(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AutoCloseTimeSetting;                              // 0x0C98(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9C[0x4];                                      // 0x0C9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                AutoCloseTimeValues;                               // 0x0CA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture2D*>                     AutoOpenSettingIcons;                              // 0x0CB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture2D*>                     StayOpenSettingIcons;                              // 0x0CC0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture2D*>                     AutoCloseTimeSettingIcons;                         // 0x0CD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__Door_Tek_Base_OverlapBox_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPClientDoMultiUse(class APlayerController* ForPC, int32 ClientUseIndex);
	TArray<struct FMultiUseEntry> BPGetMultiUseEntries(class APlayerController* ForPC, const TArray<struct FMultiUseEntry>& MultiUseEntries);
	void BPGotoDoorState(int32 NewDoorState);
	void BPPostSetStructureCollisionChannels();
	bool BPTryMultiUse(class APlayerController* ForPC, int32 UseIndex);
	void CheckForDoorOpeners();
	void DoAutoCloseCheck();
	void ExecuteUbergraph_Door_Tek_Base(int32 EntryPoint);
	void GetWheelIconFromArrayForIndex(TArray<class UTexture2D*>& IconArray, int32 Index_0, class UTexture2D** Icon);
	void IsValidDoorOpener(class APrimalCharacter* DoorOpener, bool* IsValid);
	void StartDoorInterp(double InterpDest);
	void UpdateDoorInterp();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Door_Tek_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Door_Tek_Base_C")
	}
	static class ADoor_Tek_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADoor_Tek_Base_C>();
	}
};
DUMPER7_ASSERTS_ADoor_Tek_Base_C;

}

