#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Door_Base_SM

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Door_Base_SM.Door_Base_SM_C
// 0x0050 (0x0C60 - 0x0C10)
class ADoor_Base_SM_C : public APrimalStructureDoor
{
public:
	class UStaticMeshComponent*                   DoorCollisionMesh;                                 // 0x0C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       StasisComponent;                                   // 0x0C18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         OtherDoorClasses;                                  // 0x0C20(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 OtherDoorTypes;                                    // 0x0C30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsPreviewSnapped;                                  // 0x0C40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C41[0x7];                                      // 0x0C41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreviewOverrideDescName;                           // 0x0C48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HudLocIgnoreZ;                                     // 0x0C58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPGetSnapFromPlacementMeshOverride(class APrimalStructure* ParentStructure, const struct FPlacementData& OutPlacementData, class UStaticMesh** OutMeshOverride, TSubclassOf<class APrimalStructure>* OutClassOverride, struct FVector* PreviewLocOffset, struct FRotator* PreviewRotOffset, struct FVector* PreviewScaleOffset, bool* OverrideTransform);
	struct FVector BPOverrideUILocation(class APlayerController* ForPC);
	void GetHudLoc(class APlayerController* PC, struct FVector* Loc);
	void UpdateSecondDoorPreview(class UStaticMesh* MeshOverride, const struct FTransform& DoorTransform, const struct FTransform& MeshTransform, bool UsesSecondDoor);

	class FString BPOverrideDescriptiveNameForPreview() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Door_Base_SM_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Door_Base_SM_C")
	}
	static class ADoor_Base_SM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADoor_Base_SM_C>();
	}
};
DUMPER7_ASSERTS_ADoor_Base_SM_C;

}

