#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EggIncubatorInterface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EggIncubatorInterface.EggIncubatorInterface_C.GetItemDisplaySlot
// 0x0010 (0x0010 - 0x0000)
struct EggIncubatorInterface_C_GetItemDisplaySlot final
{
public:
	class UPrimalItem*                            ForItem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         InSlot;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SlotFound;                                         // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EggIncubatorInterface_C_GetItemDisplaySlot;

// Function EggIncubatorInterface.EggIncubatorInterface_C.I_CanEggBeHatched
// 0x0010 (0x0010 - 0x0000)
struct EggIncubatorInterface_C_I_CanEggBeHatched final
{
public:
	class UPrimalItem*                            EggItem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHatchable;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EggIncubatorInterface_C_I_CanEggBeHatched;

// Function EggIncubatorInterface.EggIncubatorInterface_C.I_CanEggIncubateAtLocation
// 0x0028 (0x0028 - 0x0000)
struct EggIncubatorInterface_C_I_CanEggIncubateAtLocation final
{
public:
	class UPrimalItem*                            EggItem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WorldLocation;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EggIncubatorInterface_C_I_CanEggIncubateAtLocation;

// Function EggIncubatorInterface.EggIncubatorInterface_C.IsEggItemAllowed
// 0x0010 (0x0010 - 0x0000)
struct EggIncubatorInterface_C_IsEggItemAllowed final
{
public:
	class UPrimalItem*                            EggItem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAllowed;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EggIncubatorInterface_C_IsEggItemAllowed;

}

