#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnhancedInput

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "Engine_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class EnhancedInput.EnhancedPlayerMappableKeyProfile
// 0x0070 (0x0098 - 0x0028)
class UEnhancedPlayerMappableKeyProfile final : public UObject
{
public:
	struct FGameplayTag                           ProfileIdentifier;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPlatformUserId                        OwningUserId;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, SaveGame, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FKeyMappingRow>      PlayerMappedKeys;                                  // 0x0048(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void ResetMappingToDefault(const class FName InMappingName);
	void ResetToDefault();
	void SetDisplayName(const class FText& NewDisplayName);

	bool DoesMappingPassQueryOptions(const struct FPlayerKeyMapping& PlayerMapping, const struct FPlayerMappableKeyQueryOptions& Options) const;
	void DumpProfileToLog() const;
	int32 GetMappedKeysInRow(const class FName MappingName, TArray<struct FKey>* OutKeys) const;
	int32 GetMappingNamesForKey(const struct FKey& InKey, TArray<class FName>* OutMappingNames) const;
	const TMap<class FName, struct FKeyMappingRow> GetPlayerMappingRows() const;
	const class FText GetProfileDisplayName() const;
	const struct FGameplayTag GetProfileIdentifer() const;
	void K2_FindKeyMapping(struct FPlayerKeyMapping* OutKeyMapping, const struct FMapPlayerKeyArgs& InArgs) const;
	int32 QueryPlayerMappedKeys(const struct FPlayerMappableKeyQueryOptions& Options, TArray<struct FKey>* OutKeys) const;
	class FString ToString() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedPlayerMappableKeyProfile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedPlayerMappableKeyProfile")
	}
	static class UEnhancedPlayerMappableKeyProfile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedPlayerMappableKeyProfile>();
	}
};
DUMPER7_ASSERTS_UEnhancedPlayerMappableKeyProfile;

// Class EnhancedInput.EnhancedInputUserSettings
// 0x00F8 (0x0120 - 0x0028)
class UEnhancedInputUserSettings final : public USaveGame
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UEnhancedInputUserSettings* Settings)> OnSettingsChanged;    // 0x0030(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSettingsApplied;                                 // 0x0040(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CurrentProfileIdentifier;                          // 0x0070(0x0008)(SaveGame, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class UEnhancedPlayerMappableKeyProfile*> SavedKeyProfiles;            // 0x0078(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TWeakObjectPtr<class ULocalPlayer>            OwningLocalPlayer;                                 // 0x00C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<class UInputMappingContext*>             RegisteredMappingContexts;                         // 0x00D0(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	void ApplySettings();
	void AsyncSaveSettings();
	class UEnhancedPlayerMappableKeyProfile* CreateNewKeyProfile(const struct FPlayerMappableKeyProfileCreationArgs& InArgs);
	void MapPlayerKey(const struct FMapPlayerKeyArgs& InArgs, struct FGameplayTagContainer* FailureReason);
	bool RegisterInputMappingContext(const class UInputMappingContext* IMC);
	bool RegisterInputMappingContexts(const TSet<class UInputMappingContext*>& MappingContexts);
	void ResetAllPlayerKeysInRow(const struct FMapPlayerKeyArgs& InArgs, struct FGameplayTagContainer* FailureReason);
	void ResetKeyProfileToDefault(const struct FGameplayTag& ProfileId, struct FGameplayTagContainer* FailureReason);
	void SaveSettings();
	bool SetKeyProfile(const struct FGameplayTag& InProfileId);
	void UnMapPlayerKey(const struct FMapPlayerKeyArgs& InArgs, struct FGameplayTagContainer* FailureReason);
	bool UnregisterInputMappingContext(const class UInputMappingContext* IMC);
	bool UnregisterInputMappingContexts(const TSet<class UInputMappingContext*>& MappingContexts);

	const TSet<struct FPlayerKeyMapping> FindMappingsInRow(const class FName MappingName) const;
	class UEnhancedPlayerMappableKeyProfile* GetCurrentKeyProfile() const;
	const struct FGameplayTag GetCurrentKeyProfileIdentifier() const;
	class UEnhancedPlayerMappableKeyProfile* GetKeyProfileWithIdentifier(const struct FGameplayTag& ProfileId) const;
	bool IsMappingContextRegistered(const class UInputMappingContext* IMC) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedInputUserSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedInputUserSettings")
	}
	static class UEnhancedInputUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputUserSettings>();
	}
};
DUMPER7_ASSERTS_UEnhancedInputUserSettings;

// Class EnhancedInput.EnhancedInputActionDelegateBinding
// 0x0010 (0x0038 - 0x0028)
class UEnhancedInputActionDelegateBinding final : public UInputDelegateBinding
{
public:
	TArray<struct FBlueprintEnhancedInputActionBinding> InputActionDelegateBindings;                 // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedInputActionDelegateBinding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedInputActionDelegateBinding")
	}
	static class UEnhancedInputActionDelegateBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputActionDelegateBinding>();
	}
};
DUMPER7_ASSERTS_UEnhancedInputActionDelegateBinding;

// Class EnhancedInput.EnhancedInputActionValueBinding
// 0x0010 (0x0038 - 0x0028)
class UEnhancedInputActionValueBinding final : public UInputDelegateBinding
{
public:
	TArray<struct FBlueprintEnhancedInputActionBinding> InputActionValueBindings;                    // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedInputActionValueBinding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedInputActionValueBinding")
	}
	static class UEnhancedInputActionValueBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputActionValueBinding>();
	}
};
DUMPER7_ASSERTS_UEnhancedInputActionValueBinding;

// Class EnhancedInput.EnhancedInputComponent
// 0x0038 (0x0178 - 0x0140)
class UEnhancedInputComponent final : public UInputComponent
{
public:
	uint8                                         Pad_140[0x38];                                     // 0x0140(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FInputActionValue GetBoundActionValue(const class UInputAction* Action) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedInputComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedInputComponent")
	}
	static class UEnhancedInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputComponent>();
	}
};
DUMPER7_ASSERTS_UEnhancedInputComponent;

// Class EnhancedInput.EnhancedInputDeveloperSettings
// 0x00B0 (0x00E8 - 0x0038)
class UEnhancedInputDeveloperSettings final : public UDeveloperSettingsBackedByCVars
{
public:
	TArray<struct FDefaultContextSetting>         DefaultMappingContexts;                            // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDefaultContextSetting>         DefaultWorldSubsystemMappingContexts;              // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	struct FPerPlatformSettings                   PlatformSettings;                                  // 0x0058(0x0010)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   UserSettingsClass;                                 // 0x0068(0x0028)(Edit, Config, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DefaultPlayerMappableKeyProfileClass;              // 0x0090(0x0028)(Edit, Config, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DefaultWorldInputClass;                            // 0x00B8(0x0028)(Edit, Config, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bSendTriggeredEventsWhenInputIsFlushed : 1;        // 0x00E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableUserSettings : 1;                           // 0x00E0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableDefaultMappingContexts : 1;                 // 0x00E0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShouldOnlyTriggerLastActionInChord : 1;           // 0x00E0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bLogOnDeprecatedConfigUsed : 1;                    // 0x00E0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableWorldSubsystem : 1;                         // 0x00E0(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShouldLogAllWorldSubsystemInputs : 1;             // 0x00E0(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedInputDeveloperSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedInputDeveloperSettings")
	}
	static class UEnhancedInputDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputDeveloperSettings>();
	}
};
DUMPER7_ASSERTS_UEnhancedInputDeveloperSettings;

// Class EnhancedInput.EnhancedInputLibrary
// 0x0000 (0x0028 - 0x0028)
class UEnhancedInputLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BreakInputActionValue(const struct FInputActionValue& InActionValue, double* X, double* Y, double* Z, EInputActionValueType* Type);
	static double Conv_InputActionValueToAxis1D(const struct FInputActionValue& InValue);
	static struct FVector2D Conv_InputActionValueToAxis2D(const struct FInputActionValue& InValue);
	static struct FVector Conv_InputActionValueToAxis3D(const struct FInputActionValue& ActionValue);
	static bool Conv_InputActionValueToBool(const struct FInputActionValue& InValue);
	static class FString Conv_InputActionValueToString(const struct FInputActionValue& ActionValue);
	static class FString Conv_TriggerEventValueToString(const ETriggerEvent TriggerEvent);
	static void FlushPlayerInput(class APlayerController* PlayerController);
	static struct FInputActionValue GetBoundActionValue(class AActor* Actor, const class UInputAction* Action);
	static struct FPlayerMappableKeySlot GetFirstPlayerMappableKeySlot();
	static struct FPlayerMappableKeySlot GetFourthPlayerMappableKeySlot();
	static class FName GetMappingName(const struct FEnhancedActionKeyMapping& ActionKeyMapping);
	static class UPlayerMappableKeySettings* GetPlayerMappableKeySettings(const struct FEnhancedActionKeyMapping& ActionKeyMapping);
	static struct FPlayerMappableKeySlot GetSecondPlayerMappableKeySlot();
	static struct FPlayerMappableKeySlot GetThirdPlayerMappableKeySlot();
	static bool IsActionKeyMappingPlayerMappable(const struct FEnhancedActionKeyMapping& ActionKeyMapping);
	static struct FInputActionValue MakeInputActionValue(double X, double Y, double Z, const struct FInputActionValue& MatchValueType);
	static struct FInputActionValue MakeInputActionValueOfType(double X, double Y, double Z, const EInputActionValueType ValueType);
	static void RequestRebuildControlMappingsUsingContext(const class UInputMappingContext* Context, bool bForceImmediately);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedInputLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedInputLibrary")
	}
	static class UEnhancedInputLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputLibrary>();
	}
};
DUMPER7_ASSERTS_UEnhancedInputLibrary;

// Class EnhancedInput.EnhancedInputPlatformData
// 0x0050 (0x0078 - 0x0028)
class UEnhancedInputPlatformData final : public UObject
{
public:
	TMap<class UInputMappingContext*, class UInputMappingContext*> MappingContextRedirects;          // 0x0028(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	const class UInputMappingContext* GetContextRedirect(class UInputMappingContext* InContext) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedInputPlatformData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedInputPlatformData")
	}
	static class UEnhancedInputPlatformData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputPlatformData>();
	}
};
DUMPER7_ASSERTS_UEnhancedInputPlatformData;

// Class EnhancedInput.EnhancedInputPlatformSettings
// 0x0028 (0x0068 - 0x0040)
class UEnhancedInputPlatformSettings final : public UPlatformSettings
{
public:
	TArray<TSoftClassPtr<class UClass>>           InputData;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, Config, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UEnhancedInputPlatformData>> InputDataClasses;                          // 0x0050(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bShouldLogMappingContextRedirects;                 // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedInputPlatformSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedInputPlatformSettings")
	}
	static class UEnhancedInputPlatformSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputPlatformSettings>();
	}
};
DUMPER7_ASSERTS_UEnhancedInputPlatformSettings;

// Class EnhancedInput.EnhancedInputSubsystemInterface
// 0x0000 (0x0000 - 0x0000)
class IEnhancedInputSubsystemInterface final
{
public:
	void AddMappingContext(const class UInputMappingContext* MappingContext, int32 Priority, const struct FModifyContextOptions& Options);
	void ClearAllMappings();
	void InjectInputForAction(const class UInputAction* Action, const struct FInputActionValue& RawValue, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	void InjectInputForPlayerMapping(const class FName MappingName, const struct FInputActionValue& RawValue, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	void InjectInputVectorForAction(const class UInputAction* Action, const struct FVector& Value, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	void InjectInputVectorForPlayerMapping(const class FName MappingName, const struct FVector& Value, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	void OnUserKeyProfileChanged(const class UEnhancedPlayerMappableKeyProfile* InNewProfile);
	void OnUserSettingsChanged(class UEnhancedInputUserSettings* Settings);
	EMappingQueryResult QueryMapKeyInActiveContextSet(const class UInputMappingContext* InputContext, const class UInputAction* Action, const struct FKey& Key, TArray<struct FMappingQueryIssue>* OutIssues, EMappingQueryIssue BlockingIssues);
	EMappingQueryResult QueryMapKeyInContextSet(const TArray<class UInputMappingContext*>& PrioritizedActiveContexts, const class UInputMappingContext* InputContext, const class UInputAction* Action, const struct FKey& Key, TArray<struct FMappingQueryIssue>* OutIssues, EMappingQueryIssue BlockingIssues);
	void RemoveMappingContext(const class UInputMappingContext* MappingContext, const struct FModifyContextOptions& Options);
	void RequestRebuildControlMappings(const struct FModifyContextOptions& Options, EInputMappingRebuildType RebuildType);
	void StartContinuousInputInjectionForAction(const class UInputAction* Action, const struct FInputActionValue& RawValue, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	void StartContinuousInputInjectionForPlayerMapping(const class FName MappingName, const struct FInputActionValue& RawValue, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers);
	void StopContinuousInputInjectionForAction(const class UInputAction* Action);
	void StopContinuousInputInjectionForPlayerMapping(const class FName MappingName);
	void UpdateValueOfContinuousInputInjectionForAction(const class UInputAction* Action, const struct FInputActionValue& RawValue);
	void UpdateValueOfContinuousInputInjectionForPlayerMapping(const class FName MappingName, const struct FInputActionValue& RawValue);

	TArray<struct FEnhancedActionKeyMapping> GetAllPlayerMappableActionKeyMappings() const;
	class UEnhancedInputUserSettings* GetUserSettings() const;
	bool HasMappingContext(const class UInputMappingContext* MappingContext, int32* OutFoundPriority) const;
	TArray<struct FKey> QueryKeysMappedToAction(const class UInputAction* Action) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedInputSubsystemInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedInputSubsystemInterface")
	}
	static class IEnhancedInputSubsystemInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEnhancedInputSubsystemInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IEnhancedInputSubsystemInterface;

// Class EnhancedInput.EnhancedInputLocalPlayerSubsystem
// 0x01B8 (0x01E8 - 0x0030)
class UEnhancedInputLocalPlayerSubsystem final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x150];                                     // 0x0030(0x0150)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ControlMappingsRebuiltDelegate;                    // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UEnhancedInputUserSettings*             UserSettings;                                      // 0x0190(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TMap<class UInputAction*, struct FInjectedInput> ContinuouslyInjectedInputs;                     // 0x0198(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedInputLocalPlayerSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedInputLocalPlayerSubsystem")
	}
	static class UEnhancedInputLocalPlayerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputLocalPlayerSubsystem>();
	}
};
DUMPER7_ASSERTS_UEnhancedInputLocalPlayerSubsystem;

// Class EnhancedInput.EnhancedInputWorldSubsystem
// 0x01C8 (0x01F8 - 0x0030)
class UEnhancedInputWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x150];                                     // 0x0030(0x0150)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedPlayerInput*                   PlayerInput;                                       // 0x0180(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_188[0x10];                                     // 0x0188(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UInputComponent>> CurrentInputStack;                                 // 0x0198(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class UInputAction*, struct FInjectedInput> ContinuouslyInjectedInputs;                     // 0x01A8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	void AddActorInputComponent(class AActor* Actor);
	bool RemoveActorInputComponent(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedInputWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedInputWorldSubsystem")
	}
	static class UEnhancedInputWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedInputWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_UEnhancedInputWorldSubsystem;

// Class EnhancedInput.EnhancedPlayerInput
// 0x03A8 (0x0890 - 0x04E8)
class UEnhancedPlayerInput final : public UPlayerInput
{
public:
	TMap<class UInputAction*, struct FKeyConsumptionOptions> KeyConsumptionData;                     // 0x04E8(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<class UInputMappingContext*, int32>      AppliedInputContexts;                              // 0x0538(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FEnhancedActionKeyMapping>      EnhancedActionMappings;                            // 0x0588(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_598[0x50];                                     // 0x0598(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UInputAction*, struct FInputActionInstance> ActionInstanceData;                       // 0x05E8(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_638[0xF0];                                     // 0x0638(0x00F0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FKey, struct FVector>             KeysPressedThisTick;                               // 0x0728(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<class UInputAction*, struct FInjectedInputArray> InputsInjectedThisTick;                    // 0x0778(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TSet<class UInputAction*>                     LastInjectedActions;                               // 0x07C8(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_818[0x78];                                     // 0x0818(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedPlayerInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedPlayerInput")
	}
	static class UEnhancedPlayerInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedPlayerInput>();
	}
};
DUMPER7_ASSERTS_UEnhancedPlayerInput;

// Class EnhancedInput.InputAction
// 0x0048 (0x0078 - 0x0030)
class UInputAction final : public UDataAsset
{
public:
	class FText                                   ActionDescription;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bTriggerWhenPaused;                                // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsumeInput;                                     // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsumesActionAndAxisMappings;                    // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReserveAllMappings;                               // 0x0043(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TriggerEventsThatConsumeLegacyKeys;                // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionValueType                         ValueType;                                         // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionAccumulationBehavior              AccumulationBehavior;                              // 0x0049(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0050(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0060(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UPlayerMappableKeySettings*             PlayerMappableKeySettings;                         // 0x0070(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputAction")
	}
	static class UInputAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputAction>();
	}
};
DUMPER7_ASSERTS_UInputAction;

// Class EnhancedInput.InputDebugKeyDelegateBinding
// 0x0010 (0x0038 - 0x0028)
class UInputDebugKeyDelegateBinding final : public UInputDelegateBinding
{
public:
	TArray<struct FBlueprintInputDebugKeyDelegateBinding> InputDebugKeyDelegateBindings;             // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputDebugKeyDelegateBinding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputDebugKeyDelegateBinding")
	}
	static class UInputDebugKeyDelegateBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputDebugKeyDelegateBinding>();
	}
};
DUMPER7_ASSERTS_UInputDebugKeyDelegateBinding;

// Class EnhancedInput.InputMappingContext
// 0x0020 (0x0050 - 0x0030)
class UInputMappingContext final : public UDataAsset
{
public:
	TArray<struct FEnhancedActionKeyMapping>      Mappings;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class FText                                   ContextDescription;                                // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	struct FEnhancedActionKeyMapping MapKey(const class UInputAction* Action, const struct FKey& ToKey);
	void UnmapAction(const class UInputAction* Action);
	void UnmapAll();
	void UnmapAllKeysFromAction(const class UInputAction* Action);
	void UnmapKey(const class UInputAction* Action, const struct FKey& Key);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputMappingContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputMappingContext")
	}
	static class UInputMappingContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputMappingContext>();
	}
};
DUMPER7_ASSERTS_UInputMappingContext;

// Class EnhancedInput.InputModifier
// 0x0000 (0x0028 - 0x0028)
class UInputModifier : public UObject
{
public:
	struct FLinearColor GetVisualizationColor(const struct FInputActionValue& SampleValue, const struct FInputActionValue& FinalValue) const;
	struct FInputActionValue ModifyRaw(const class UEnhancedPlayerInput* PlayerInput, const struct FInputActionValue& CurrentValue, float DeltaTime) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifier")
	}
	static class UInputModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifier>();
	}
};
DUMPER7_ASSERTS_UInputModifier;

// Class EnhancedInput.InputModifierSmoothDelta
// 0x0040 (0x0068 - 0x0028)
class UInputModifierSmoothDelta final : public UInputModifier
{
public:
	ENormalizeInputSmoothingType                  SmoothingMethod;                                   // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EasingExponent;                                    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x34];                                      // 0x0034(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifierSmoothDelta")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifierSmoothDelta")
	}
	static class UInputModifierSmoothDelta* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierSmoothDelta>();
	}
};
DUMPER7_ASSERTS_UInputModifierSmoothDelta;

// Class EnhancedInput.InputModifierDeadZone
// 0x0010 (0x0038 - 0x0028)
class UInputModifierDeadZone final : public UInputModifier
{
public:
	float                                         LowerThreshold;                                    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpperThreshold;                                    // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDeadZoneType                                 Type;                                              // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifierDeadZone")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifierDeadZone")
	}
	static class UInputModifierDeadZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierDeadZone>();
	}
};
DUMPER7_ASSERTS_UInputModifierDeadZone;

// Class EnhancedInput.InputModifierScalar
// 0x0018 (0x0040 - 0x0028)
class UInputModifierScalar final : public UInputModifier
{
public:
	struct FVector                                Scalar;                                            // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifierScalar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifierScalar")
	}
	static class UInputModifierScalar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierScalar>();
	}
};
DUMPER7_ASSERTS_UInputModifierScalar;

// Class EnhancedInput.InputModifierScaleByDeltaTime
// 0x0000 (0x0028 - 0x0028)
class UInputModifierScaleByDeltaTime final : public UInputModifier
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifierScaleByDeltaTime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifierScaleByDeltaTime")
	}
	static class UInputModifierScaleByDeltaTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierScaleByDeltaTime>();
	}
};
DUMPER7_ASSERTS_UInputModifierScaleByDeltaTime;

// Class EnhancedInput.InputModifierNegate
// 0x0008 (0x0030 - 0x0028)
class UInputModifierNegate final : public UInputModifier
{
public:
	bool                                          bX;                                                // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bY;                                                // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bZ;                                                // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifierNegate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifierNegate")
	}
	static class UInputModifierNegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierNegate>();
	}
};
DUMPER7_ASSERTS_UInputModifierNegate;

// Class EnhancedInput.InputModifierSmooth
// 0x0030 (0x0058 - 0x0028)
class UInputModifierSmooth final : public UInputModifier
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifierSmooth")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifierSmooth")
	}
	static class UInputModifierSmooth* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierSmooth>();
	}
};
DUMPER7_ASSERTS_UInputModifierSmooth;

// Class EnhancedInput.InputModifierResponseCurveExponential
// 0x0018 (0x0040 - 0x0028)
class UInputModifierResponseCurveExponential final : public UInputModifier
{
public:
	struct FVector                                CurveExponent;                                     // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifierResponseCurveExponential")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifierResponseCurveExponential")
	}
	static class UInputModifierResponseCurveExponential* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierResponseCurveExponential>();
	}
};
DUMPER7_ASSERTS_UInputModifierResponseCurveExponential;

// Class EnhancedInput.InputModifierResponseCurveUser
// 0x0018 (0x0040 - 0x0028)
class UInputModifierResponseCurveUser final : public UInputModifier
{
public:
	class UCurveFloat*                            ResponseX;                                         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UCurveFloat*                            ResponseY;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UCurveFloat*                            ResponseZ;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifierResponseCurveUser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifierResponseCurveUser")
	}
	static class UInputModifierResponseCurveUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierResponseCurveUser>();
	}
};
DUMPER7_ASSERTS_UInputModifierResponseCurveUser;

// Class EnhancedInput.InputModifierFOVScaling
// 0x0008 (0x0030 - 0x0028)
class UInputModifierFOVScaling final : public UInputModifier
{
public:
	float                                         FOVScale;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFOVScalingType                               FOVScalingType;                                    // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifierFOVScaling")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifierFOVScaling")
	}
	static class UInputModifierFOVScaling* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierFOVScaling>();
	}
};
DUMPER7_ASSERTS_UInputModifierFOVScaling;

// Class EnhancedInput.InputModifierToWorldSpace
// 0x0000 (0x0028 - 0x0028)
class UInputModifierToWorldSpace final : public UInputModifier
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifierToWorldSpace")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifierToWorldSpace")
	}
	static class UInputModifierToWorldSpace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierToWorldSpace>();
	}
};
DUMPER7_ASSERTS_UInputModifierToWorldSpace;

// Class EnhancedInput.InputModifierSwizzleAxis
// 0x0008 (0x0030 - 0x0028)
class UInputModifierSwizzleAxis final : public UInputModifier
{
public:
	EInputAxisSwizzle                             Order;                                             // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputModifierSwizzleAxis")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputModifierSwizzleAxis")
	}
	static class UInputModifierSwizzleAxis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputModifierSwizzleAxis>();
	}
};
DUMPER7_ASSERTS_UInputModifierSwizzleAxis;

// Class EnhancedInput.InputTrigger
// 0x0028 (0x0050 - 0x0028)
class UInputTrigger : public UObject
{
public:
	float                                         ActuationThreshold;                                // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldAlwaysTick;                                 // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      LastValue;                                         // 0x0030(0x0020)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	ETriggerState UpdateState(const class UEnhancedPlayerInput* PlayerInput, const struct FInputActionValue& ModifiedValue, float DeltaTime);

	ETriggerType GetTriggerType() const;
	bool IsActuated(const struct FInputActionValue& ForValue) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTrigger")
	}
	static class UInputTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTrigger>();
	}
};
DUMPER7_ASSERTS_UInputTrigger;

// Class EnhancedInput.InputTriggerTimedBase
// 0x0008 (0x0058 - 0x0050)
class UInputTriggerTimedBase : public UInputTrigger
{
public:
	float                                         HeldDuration;                                      // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAffectedByTimeDilation;                           // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTriggerTimedBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTriggerTimedBase")
	}
	static class UInputTriggerTimedBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerTimedBase>();
	}
};
DUMPER7_ASSERTS_UInputTriggerTimedBase;

// Class EnhancedInput.InputTriggerDown
// 0x0000 (0x0050 - 0x0050)
class UInputTriggerDown final : public UInputTrigger
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTriggerDown")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTriggerDown")
	}
	static class UInputTriggerDown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerDown>();
	}
};
DUMPER7_ASSERTS_UInputTriggerDown;

// Class EnhancedInput.InputTriggerPressed
// 0x0000 (0x0050 - 0x0050)
class UInputTriggerPressed final : public UInputTrigger
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTriggerPressed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTriggerPressed")
	}
	static class UInputTriggerPressed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerPressed>();
	}
};
DUMPER7_ASSERTS_UInputTriggerPressed;

// Class EnhancedInput.InputTriggerReleased
// 0x0000 (0x0050 - 0x0050)
class UInputTriggerReleased final : public UInputTrigger
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTriggerReleased")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTriggerReleased")
	}
	static class UInputTriggerReleased* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerReleased>();
	}
};
DUMPER7_ASSERTS_UInputTriggerReleased;

// Class EnhancedInput.InputTriggerHold
// 0x0010 (0x0068 - 0x0058)
class UInputTriggerHold final : public UInputTriggerTimedBase
{
public:
	uint8                                         Pad_58[0x4];                                       // 0x0058(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HoldTimeThreshold;                                 // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOneShot;                                        // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTriggerHold")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTriggerHold")
	}
	static class UInputTriggerHold* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerHold>();
	}
};
DUMPER7_ASSERTS_UInputTriggerHold;

// Class EnhancedInput.InputTriggerHoldAndRelease
// 0x0008 (0x0060 - 0x0058)
class UInputTriggerHoldAndRelease final : public UInputTriggerTimedBase
{
public:
	float                                         HoldTimeThreshold;                                 // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTriggerHoldAndRelease")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTriggerHoldAndRelease")
	}
	static class UInputTriggerHoldAndRelease* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerHoldAndRelease>();
	}
};
DUMPER7_ASSERTS_UInputTriggerHoldAndRelease;

// Class EnhancedInput.InputTriggerTap
// 0x0008 (0x0060 - 0x0058)
class UInputTriggerTap final : public UInputTriggerTimedBase
{
public:
	float                                         TapReleaseTimeThreshold;                           // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTriggerTap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTriggerTap")
	}
	static class UInputTriggerTap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerTap>();
	}
};
DUMPER7_ASSERTS_UInputTriggerTap;

// Class EnhancedInput.InputTriggerPulse
// 0x0010 (0x0068 - 0x0058)
class UInputTriggerPulse final : public UInputTriggerTimedBase
{
public:
	uint8                                         Pad_58[0x4];                                       // 0x0058(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bTriggerOnStart;                                   // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Interval;                                          // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TriggerLimit;                                      // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTriggerPulse")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTriggerPulse")
	}
	static class UInputTriggerPulse* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerPulse>();
	}
};
DUMPER7_ASSERTS_UInputTriggerPulse;

// Class EnhancedInput.InputTriggerChordAction
// 0x0008 (0x0058 - 0x0050)
class UInputTriggerChordAction : public UInputTrigger
{
public:
	class UInputAction*                           ChordAction;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTriggerChordAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTriggerChordAction")
	}
	static class UInputTriggerChordAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerChordAction>();
	}
};
DUMPER7_ASSERTS_UInputTriggerChordAction;

// Class EnhancedInput.InputTriggerChordBlocker
// 0x0000 (0x0058 - 0x0058)
class UInputTriggerChordBlocker final : public UInputTriggerChordAction
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTriggerChordBlocker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTriggerChordBlocker")
	}
	static class UInputTriggerChordBlocker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerChordBlocker>();
	}
};
DUMPER7_ASSERTS_UInputTriggerChordBlocker;

// Class EnhancedInput.InputTriggerCombo
// 0x0028 (0x0078 - 0x0050)
class UInputTriggerCombo final : public UInputTrigger
{
public:
	int32                                         CurrentComboStepIndex;                             // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentTimeBetweenComboSteps;                      // 0x0054(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FInputComboStepData>            ComboActions;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInputCancelAction>             InputCancelActions;                                // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputTriggerCombo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputTriggerCombo")
	}
	static class UInputTriggerCombo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputTriggerCombo>();
	}
};
DUMPER7_ASSERTS_UInputTriggerCombo;

// Class EnhancedInput.PlayerMappableInputConfig
// 0x0078 (0x00A8 - 0x0030)
class UPlayerMappableInputConfig final : public UPrimaryDataAsset
{
public:
	class FName                                   ConfigName;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ConfigDisplayName;                                 // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsDeprecated;                                     // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MetaData;                                          // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TMap<class UInputMappingContext*, int32>      Contexts;                                          // 0x0058(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

public:
	void ResetToDefault();

	const class FName GetConfigName() const;
	const class FText GetDisplayName() const;
	TArray<struct FEnhancedActionKeyMapping> GetKeysBoundToAction(const class UInputAction* InAction) const;
	struct FEnhancedActionKeyMapping GetMappingByName(const class FName MappingName) const;
	const TMap<class UInputMappingContext*, int32> GetMappingContexts() const;
	class UObject* GetMetadata() const;
	TArray<struct FEnhancedActionKeyMapping> GetPlayerMappableKeys() const;
	const bool IsDeprecated() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayerMappableInputConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerMappableInputConfig")
	}
	static class UPlayerMappableInputConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerMappableInputConfig>();
	}
};
DUMPER7_ASSERTS_UPlayerMappableInputConfig;

// Class EnhancedInput.PlayerMappableKeySettings
// 0x0050 (0x0078 - 0x0028)
class UPlayerMappableKeySettings final : public UObject
{
public:
	class UObject*                                MetaData;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class FName                                   Name_0;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   DisplayCategory;                                   // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  SupportedKeyProfiles;                              // 0x0058(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayerMappableKeySettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerMappableKeySettings")
	}
	static class UPlayerMappableKeySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerMappableKeySettings>();
	}
};
DUMPER7_ASSERTS_UPlayerMappableKeySettings;

}

