#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnhancedInput

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.ResetMappingToDefault
// 0x0008 (0x0008 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_ResetMappingToDefault final
{
public:
	class FName                                   InMappingName;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedPlayerMappableKeyProfile_ResetMappingToDefault;

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.SetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_SetDisplayName final
{
public:
	class FText                                   NewDisplayName;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedPlayerMappableKeyProfile_SetDisplayName;

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.DoesMappingPassQueryOptions
// 0x00B0 (0x00B0 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions final
{
public:
	struct FPlayerKeyMapping                      PlayerMapping;                                     // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlayerMappableKeyQueryOptions         Options;                                           // 0x0080(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedPlayerMappableKeyProfile_DoesMappingPassQueryOptions;

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.GetMappedKeysInRow
// 0x0020 (0x0020 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           OutKeys;                                           // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedPlayerMappableKeyProfile_GetMappedKeysInRow;

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.GetMappingNamesForKey
// 0x0030 (0x0030 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           OutMappingNames;                                   // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedPlayerMappableKeyProfile_GetMappingNamesForKey;

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.GetPlayerMappingRows
// 0x0050 (0x0050 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_GetPlayerMappingRows final
{
public:
	TMap<class FName, struct FKeyMappingRow>      ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedPlayerMappableKeyProfile_GetPlayerMappingRows;

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.GetProfileDisplayName
// 0x0010 (0x0010 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_GetProfileDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedPlayerMappableKeyProfile_GetProfileDisplayName;

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.GetProfileIdentifer
// 0x0008 (0x0008 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_GetProfileIdentifer final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedPlayerMappableKeyProfile_GetProfileIdentifer;

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.K2_FindKeyMapping
// 0x00C0 (0x00C0 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_K2_FindKeyMapping final
{
public:
	struct FPlayerKeyMapping                      OutKeyMapping;                                     // 0x0000(0x0080)(Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMapPlayerKeyArgs                      InArgs;                                            // 0x0080(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedPlayerMappableKeyProfile_K2_FindKeyMapping;

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.QueryPlayerMappedKeys
// 0x0040 (0x0040 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys final
{
public:
	struct FPlayerMappableKeyQueryOptions         Options;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           OutKeys;                                           // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedPlayerMappableKeyProfile_QueryPlayerMappedKeys;

// Function EnhancedInput.EnhancedPlayerMappableKeyProfile.ToString
// 0x0010 (0x0010 - 0x0000)
struct EnhancedPlayerMappableKeyProfile_ToString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedPlayerMappableKeyProfile_ToString;

// Function EnhancedInput.EnhancedInputUserSettings.CreateNewKeyProfile
// 0x0038 (0x0038 - 0x0000)
struct EnhancedInputUserSettings_CreateNewKeyProfile final
{
public:
	struct FPlayerMappableKeyProfileCreationArgs  InArgs;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UEnhancedPlayerMappableKeyProfile*      ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_CreateNewKeyProfile;

// Function EnhancedInput.EnhancedInputUserSettings.MapPlayerKey
// 0x0060 (0x0060 - 0x0000)
struct EnhancedInputUserSettings_MapPlayerKey final
{
public:
	struct FMapPlayerKeyArgs                      InArgs;                                            // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FailureReason;                                     // 0x0040(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_MapPlayerKey;

// Function EnhancedInput.EnhancedInputUserSettings.RegisterInputMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputUserSettings_RegisterInputMappingContext final
{
public:
	const class UInputMappingContext*             IMC;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_RegisterInputMappingContext;

// Function EnhancedInput.EnhancedInputUserSettings.RegisterInputMappingContexts
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputUserSettings_RegisterInputMappingContexts final
{
public:
	TSet<class UInputMappingContext*>             MappingContexts;                                   // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_RegisterInputMappingContexts;

// Function EnhancedInput.EnhancedInputUserSettings.ResetAllPlayerKeysInRow
// 0x0060 (0x0060 - 0x0000)
struct EnhancedInputUserSettings_ResetAllPlayerKeysInRow final
{
public:
	struct FMapPlayerKeyArgs                      InArgs;                                            // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FailureReason;                                     // 0x0040(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_ResetAllPlayerKeysInRow;

// Function EnhancedInput.EnhancedInputUserSettings.ResetKeyProfileToDefault
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputUserSettings_ResetKeyProfileToDefault final
{
public:
	struct FGameplayTag                           ProfileId;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FailureReason;                                     // 0x0008(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_ResetKeyProfileToDefault;

// Function EnhancedInput.EnhancedInputUserSettings.SetKeyProfile
// 0x000C (0x000C - 0x0000)
struct EnhancedInputUserSettings_SetKeyProfile final
{
public:
	struct FGameplayTag                           InProfileId;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_SetKeyProfile;

// Function EnhancedInput.EnhancedInputUserSettings.UnMapPlayerKey
// 0x0060 (0x0060 - 0x0000)
struct EnhancedInputUserSettings_UnMapPlayerKey final
{
public:
	struct FMapPlayerKeyArgs                      InArgs;                                            // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FailureReason;                                     // 0x0040(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_UnMapPlayerKey;

// Function EnhancedInput.EnhancedInputUserSettings.UnregisterInputMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputUserSettings_UnregisterInputMappingContext final
{
public:
	const class UInputMappingContext*             IMC;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_UnregisterInputMappingContext;

// Function EnhancedInput.EnhancedInputUserSettings.UnregisterInputMappingContexts
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputUserSettings_UnregisterInputMappingContexts final
{
public:
	TSet<class UInputMappingContext*>             MappingContexts;                                   // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_UnregisterInputMappingContexts;

// Function EnhancedInput.EnhancedInputUserSettings.FindMappingsInRow
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputUserSettings_FindMappingsInRow final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<struct FPlayerKeyMapping>                ReturnValue;                                       // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_FindMappingsInRow;

// Function EnhancedInput.EnhancedInputUserSettings.GetCurrentKeyProfile
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputUserSettings_GetCurrentKeyProfile final
{
public:
	class UEnhancedPlayerMappableKeyProfile*      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_GetCurrentKeyProfile;

// Function EnhancedInput.EnhancedInputUserSettings.GetCurrentKeyProfileIdentifier
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputUserSettings_GetCurrentKeyProfileIdentifier final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_GetCurrentKeyProfileIdentifier;

// Function EnhancedInput.EnhancedInputUserSettings.GetKeyProfileWithIdentifier
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputUserSettings_GetKeyProfileWithIdentifier final
{
public:
	struct FGameplayTag                           ProfileId;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEnhancedPlayerMappableKeyProfile*      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_GetKeyProfileWithIdentifier;

// Function EnhancedInput.EnhancedInputUserSettings.IsMappingContextRegistered
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputUserSettings_IsMappingContextRegistered final
{
public:
	const class UInputMappingContext*             IMC;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputUserSettings_IsMappingContextRegistered;

// Function EnhancedInput.EnhancedInputComponent.GetBoundActionValue
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputComponent_GetBoundActionValue final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputComponent_GetBoundActionValue;

// Function EnhancedInput.EnhancedInputLibrary.BreakInputActionValue
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputLibrary_BreakInputActionValue final
{
public:
	struct FInputActionValue                      InActionValue;                                     // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        X;                                                 // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Y;                                                 // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Z;                                                 // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionValueType                         Type;                                              // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputLibrary_BreakInputActionValue;

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis1D
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis1D final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_Conv_InputActionValueToAxis1D;

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis2D
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis2D final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_Conv_InputActionValueToAxis2D;

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis3D
// 0x0038 (0x0038 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis3D final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_Conv_InputActionValueToAxis3D;

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToBool
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToBool final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputLibrary_Conv_InputActionValueToBool;

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToString
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToString final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_Conv_InputActionValueToString;

// Function EnhancedInput.EnhancedInputLibrary.Conv_TriggerEventValueToString
// 0x0018 (0x0018 - 0x0000)
struct EnhancedInputLibrary_Conv_TriggerEventValueToString final
{
public:
	ETriggerEvent                                 TriggerEvent;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_Conv_TriggerEventValueToString;

// Function EnhancedInput.EnhancedInputLibrary.FlushPlayerInput
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputLibrary_FlushPlayerInput final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_FlushPlayerInput;

// Function EnhancedInput.EnhancedInputLibrary.GetBoundActionValue
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_GetBoundActionValue final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_GetBoundActionValue;

// Function EnhancedInput.EnhancedInputLibrary.GetFirstPlayerMappableKeySlot
// 0x0004 (0x0004 - 0x0000)
struct EnhancedInputLibrary_GetFirstPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_GetFirstPlayerMappableKeySlot;

// Function EnhancedInput.EnhancedInputLibrary.GetFourthPlayerMappableKeySlot
// 0x0004 (0x0004 - 0x0000)
struct EnhancedInputLibrary_GetFourthPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_GetFourthPlayerMappableKeySlot;

// Function EnhancedInput.EnhancedInputLibrary.GetMappingName
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputLibrary_GetMappingName final
{
public:
	struct FEnhancedActionKeyMapping              ActionKeyMapping;                                  // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_GetMappingName;

// Function EnhancedInput.EnhancedInputLibrary.GetPlayerMappableKeySettings
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputLibrary_GetPlayerMappableKeySettings final
{
public:
	struct FEnhancedActionKeyMapping              ActionKeyMapping;                                  // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerMappableKeySettings*             ReturnValue;                                       // 0x0050(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_GetPlayerMappableKeySettings;

// Function EnhancedInput.EnhancedInputLibrary.GetSecondPlayerMappableKeySlot
// 0x0004 (0x0004 - 0x0000)
struct EnhancedInputLibrary_GetSecondPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_GetSecondPlayerMappableKeySlot;

// Function EnhancedInput.EnhancedInputLibrary.GetThirdPlayerMappableKeySlot
// 0x0004 (0x0004 - 0x0000)
struct EnhancedInputLibrary_GetThirdPlayerMappableKeySlot final
{
public:
	struct FPlayerMappableKeySlot                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_GetThirdPlayerMappableKeySlot;

// Function EnhancedInput.EnhancedInputLibrary.IsActionKeyMappingPlayerMappable
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputLibrary_IsActionKeyMappingPlayerMappable final
{
public:
	struct FEnhancedActionKeyMapping              ActionKeyMapping;                                  // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputLibrary_IsActionKeyMappingPlayerMappable;

// Function EnhancedInput.EnhancedInputLibrary.MakeInputActionValue
// 0x0058 (0x0058 - 0x0000)
struct EnhancedInputLibrary_MakeInputActionValue final
{
public:
	double                                        X;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Y;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Z;                                                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      MatchValueType;                                    // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0038(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_MakeInputActionValue;

// Function EnhancedInput.EnhancedInputLibrary.MakeInputActionValueOfType
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputLibrary_MakeInputActionValueOfType final
{
public:
	double                                        X;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Y;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Z;                                                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionValueType                         ValueType;                                         // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      ReturnValue;                                       // 0x0020(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_MakeInputActionValueOfType;

// Function EnhancedInput.EnhancedInputLibrary.RequestRebuildControlMappingsUsingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext final
{
public:
	const class UInputMappingContext*             Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceImmediately;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext;

// Function EnhancedInput.EnhancedInputPlatformData.GetContextRedirect
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputPlatformData_GetContextRedirect final
{
public:
	class UInputMappingContext*                   InContext;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputMappingContext*             ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputPlatformData_GetContextRedirect;

// Function EnhancedInput.EnhancedInputSubsystemInterface.AddMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_AddMappingContext final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x000C(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_AddMappingContext;

// Function EnhancedInput.EnhancedInputSubsystemInterface.InjectInputForAction
// 0x0048 (0x0048 - 0x0000)
struct EnhancedInputSubsystemInterface_InjectInputForAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      RawValue;                                          // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_InjectInputForAction;

// Function EnhancedInput.EnhancedInputSubsystemInterface.InjectInputForPlayerMapping
// 0x0048 (0x0048 - 0x0000)
struct EnhancedInputSubsystemInterface_InjectInputForPlayerMapping final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      RawValue;                                          // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_InjectInputForPlayerMapping;

// Function EnhancedInput.EnhancedInputSubsystemInterface.InjectInputVectorForAction
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputSubsystemInterface_InjectInputVectorForAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_InjectInputVectorForAction;

// Function EnhancedInput.EnhancedInputSubsystemInterface.InjectInputVectorForPlayerMapping
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputSubsystemInterface_InjectInputVectorForPlayerMapping final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_InjectInputVectorForPlayerMapping;

// Function EnhancedInput.EnhancedInputSubsystemInterface.OnUserKeyProfileChanged
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputSubsystemInterface_OnUserKeyProfileChanged final
{
public:
	const class UEnhancedPlayerMappableKeyProfile* InNewProfile;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_OnUserKeyProfileChanged;

// Function EnhancedInput.EnhancedInputSubsystemInterface.OnUserSettingsChanged
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputSubsystemInterface_OnUserSettingsChanged final
{
public:
	class UEnhancedInputUserSettings*             Settings;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_OnUserSettingsChanged;

// Function EnhancedInput.EnhancedInputSubsystemInterface.QueryMapKeyInActiveContextSet
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet final
{
public:
	const class UInputMappingContext*             InputContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key;                                               // 0x0010(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMappingQueryIssue>             OutIssues;                                         // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EMappingQueryIssue                            BlockingIssues;                                    // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMappingQueryResult                           ReturnValue;                                       // 0x0039(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet;

// Function EnhancedInput.EnhancedInputSubsystemInterface.QueryMapKeyInContextSet
// 0x0050 (0x0050 - 0x0000)
struct EnhancedInputSubsystemInterface_QueryMapKeyInContextSet final
{
public:
	TArray<class UInputMappingContext*>           PrioritizedActiveContexts;                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	const class UInputMappingContext*             InputContext;                                      // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key;                                               // 0x0020(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMappingQueryIssue>             OutIssues;                                         // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EMappingQueryIssue                            BlockingIssues;                                    // 0x0048(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMappingQueryResult                           ReturnValue;                                       // 0x0049(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_QueryMapKeyInContextSet;

// Function EnhancedInput.EnhancedInputSubsystemInterface.RemoveMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_RemoveMappingContext final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0008(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_RemoveMappingContext;

// Function EnhancedInput.EnhancedInputSubsystemInterface.RequestRebuildControlMappings
// 0x0002 (0x0002 - 0x0000)
struct EnhancedInputSubsystemInterface_RequestRebuildControlMappings final
{
public:
	struct FModifyContextOptions                  Options;                                           // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EInputMappingRebuildType                      RebuildType;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_RequestRebuildControlMappings;

// Function EnhancedInput.EnhancedInputSubsystemInterface.StartContinuousInputInjectionForAction
// 0x0048 (0x0048 - 0x0000)
struct EnhancedInputSubsystemInterface_StartContinuousInputInjectionForAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      RawValue;                                          // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_StartContinuousInputInjectionForAction;

// Function EnhancedInput.EnhancedInputSubsystemInterface.StartContinuousInputInjectionForPlayerMapping
// 0x0048 (0x0048 - 0x0000)
struct EnhancedInputSubsystemInterface_StartContinuousInputInjectionForPlayerMapping final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      RawValue;                                          // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_StartContinuousInputInjectionForPlayerMapping;

// Function EnhancedInput.EnhancedInputSubsystemInterface.StopContinuousInputInjectionForAction
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputSubsystemInterface_StopContinuousInputInjectionForAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_StopContinuousInputInjectionForAction;

// Function EnhancedInput.EnhancedInputSubsystemInterface.StopContinuousInputInjectionForPlayerMapping
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputSubsystemInterface_StopContinuousInputInjectionForPlayerMapping final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_StopContinuousInputInjectionForPlayerMapping;

// Function EnhancedInput.EnhancedInputSubsystemInterface.UpdateValueOfContinuousInputInjectionForAction
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputSubsystemInterface_UpdateValueOfContinuousInputInjectionForAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      RawValue;                                          // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_UpdateValueOfContinuousInputInjectionForAction;

// Function EnhancedInput.EnhancedInputSubsystemInterface.UpdateValueOfContinuousInputInjectionForPlayerMapping
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputSubsystemInterface_UpdateValueOfContinuousInputInjectionForPlayerMapping final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      RawValue;                                          // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_UpdateValueOfContinuousInputInjectionForPlayerMapping;

// Function EnhancedInput.EnhancedInputSubsystemInterface.GetAllPlayerMappableActionKeyMappings
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_GetAllPlayerMappableActionKeyMappings final
{
public:
	TArray<struct FEnhancedActionKeyMapping>      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_GetAllPlayerMappableActionKeyMappings;

// Function EnhancedInput.EnhancedInputSubsystemInterface.GetUserSettings
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputSubsystemInterface_GetUserSettings final
{
public:
	class UEnhancedInputUserSettings*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_GetUserSettings;

// Function EnhancedInput.EnhancedInputSubsystemInterface.HasMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_HasMappingContext final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutFoundPriority;                                  // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_HasMappingContext;

// Function EnhancedInput.EnhancedInputSubsystemInterface.QueryKeysMappedToAction
// 0x0018 (0x0018 - 0x0000)
struct EnhancedInputSubsystemInterface_QueryKeysMappedToAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_QueryKeysMappedToAction;

// Function EnhancedInput.EnhancedInputWorldSubsystem.AddActorInputComponent
// 0x0008 (0x0008 - 0x0000)
struct EnhancedInputWorldSubsystem_AddActorInputComponent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputWorldSubsystem_AddActorInputComponent;

// Function EnhancedInput.EnhancedInputWorldSubsystem.RemoveActorInputComponent
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputWorldSubsystem_RemoveActorInputComponent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputWorldSubsystem_RemoveActorInputComponent;

// Function EnhancedInput.InputMappingContext.MapKey
// 0x0070 (0x0070 - 0x0000)
struct InputMappingContext_MapKey final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   ToKey;                                             // 0x0008(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEnhancedActionKeyMapping              ReturnValue;                                       // 0x0020(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputMappingContext_MapKey;

// Function EnhancedInput.InputMappingContext.UnmapAction
// 0x0008 (0x0008 - 0x0000)
struct InputMappingContext_UnmapAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputMappingContext_UnmapAction;

// Function EnhancedInput.InputMappingContext.UnmapAllKeysFromAction
// 0x0008 (0x0008 - 0x0000)
struct InputMappingContext_UnmapAllKeysFromAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputMappingContext_UnmapAllKeysFromAction;

// Function EnhancedInput.InputMappingContext.UnmapKey
// 0x0020 (0x0020 - 0x0000)
struct InputMappingContext_UnmapKey final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key;                                               // 0x0008(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputMappingContext_UnmapKey;

// Function EnhancedInput.InputModifier.GetVisualizationColor
// 0x0050 (0x0050 - 0x0000)
struct InputModifier_GetVisualizationColor final
{
public:
	struct FInputActionValue                      SampleValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FInputActionValue                      FinalValue;                                        // 0x0020(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputModifier_GetVisualizationColor;

// Function EnhancedInput.InputModifier.ModifyRaw
// 0x0050 (0x0050 - 0x0000)
struct InputModifier_ModifyRaw final
{
public:
	const class UEnhancedPlayerInput*             PlayerInput;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      CurrentValue;                                      // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      ReturnValue;                                       // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputModifier_ModifyRaw;

// Function EnhancedInput.InputTrigger.UpdateState
// 0x0030 (0x0030 - 0x0000)
struct InputTrigger_UpdateState final
{
public:
	const class UEnhancedPlayerInput*             PlayerInput;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ModifiedValue;                                     // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETriggerState                                 ReturnValue;                                       // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
