#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FaceTemplates_Selector_ASA

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Human_Male_Faces_Enum_structs.hpp"
#include "Engine_structs.hpp"
#include "Selector_ASA_Widget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FaceTemplates_Selector_ASA.FaceTemplates_Selector_ASA_C
// 0x00D8 (0x04B8 - 0x03E0)
class UFaceTemplates_Selector_ASA_C : public USelector_ASA_Widget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_FaceTemplates_Selector_ASA_C;       // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bPCCIsFemale;                                      // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedCustomData;                                // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EHuman_Male_Faces_Enum, class UTexture2D*> FaceIcons;                                       // 0x03F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              PresetSelected;                                    // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bUsesSelect;                                       // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EHuman_Male_Faces_Enum, bool>            FaceFemales;                                       // 0x0458(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             DefaultFemaleIcon;                                 // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             DefaultMaleIcon;                                   // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPExecutedCommandForPrimalUI(class FName CommandName, const struct FBPNetExecParams& ExecParams);
	void ConvertSelectedIndexToRealIndex(int32 NewParam, int32* NewParam1);
	void ExecuteUbergraph_FaceTemplates_Selector_ASA(int32 EntryPoint);
	void GetEntryIndexOfFace(int32* Index_0);
	void GetMaxOptions(int32* max_0);
	void GetOptions(TArray<class UTexture2D*>* Icons, TArray<class FString>* Names);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	bool OnDragOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void RefreshOptions();
	void SetValueChangedToParent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FaceTemplates_Selector_ASA_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FaceTemplates_Selector_ASA_C")
	}
	static class UFaceTemplates_Selector_ASA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFaceTemplates_Selector_ASA_C>();
	}
};
DUMPER7_ASSERTS_UFaceTemplates_Selector_ASA_C;

}

