#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Female_Hair_Afro_Long_CtrlRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// RigVMMemoryStorageGeneratorClass Female_Hair_Afro_Long_CtrlRig.RigVMMemory_Work
// 0x14E8 (0x1510 - 0x0028)
class Female_Hair_Afro_Long_CtrlRig::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_Items__IO;          // 0x0028(0x0010)(Edit, EditConst, NonTransactional)
	TArray<float>                                 RigVMModel___BoneArraySpringSolver_2_SpringStrength; // 0x0038(0x0010)(Edit, EditConst, NonTransactional)
	TArray<float>                                 RigVMModel___BoneArraySpringSolver_2_SpringDamping; // 0x0048(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_Transform; // 0x0060(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x00C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_CachedIndex; // 0x00D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                LocalVariable__BoneArraySpringSolver_BonePosition; // 0x00E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2___BoneArraySpringSolver_IsNearlyZero_Result; // 0x00F8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_Element; // 0x0100(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0118(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_To_World_1_World; // 0x0120(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x0138(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x013C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_To_World_2_World; // 0x0140(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x0158(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Strength; // 0x0170(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Damping; // 0x0178(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Out; // 0x0180(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Velocity; // 0x0198(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_7_Element; // 0x01B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Entry_Maximum_Length; // 0x01C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolver_0___SpringSolver_Return_Velocity;     // 0x01D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Entry_VelocityIn;    // 0x01E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_MathVectorClampLength_Result; // 0x0200(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_1_2_Result; // 0x0218(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_9_1_Result;      // 0x0230(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Scale_3_Result;      // 0x0248(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_1_Result; // 0x0260(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_Result;  // 0x0278(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Scale_Result;        // 0x0290(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_Result;     // 0x02A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Multiply_7_Result;   // 0x02C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Scale_Factor;        // 0x02C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Multiply_6_Result;   // 0x02D0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_GetDeltaTime_3_Result; // 0x02D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Multiply_6_A;        // 0x02E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Power_1_Result;      // 0x02E8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_Result;      // 0x02F0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Divide_2_Result;     // 0x02F8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Divide_2_A;          // 0x0300(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Scale_3_Factor;      // 0x0308(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_1_Result;   // 0x0310(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Divide_Result;       // 0x0328(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_RigVMFunction_GetDeltaTime_Result; // 0x032C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2___BoneArraySpringSolver_IsNearlyZero_1_Result; // 0x0330(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_1_Element; // 0x0338(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_4_Element; // 0x0350(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Strength; // 0x0368(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Damping; // 0x0370(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Out; // 0x0378(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_1_1_Result; // 0x0390(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_1_Result; // 0x03A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_From_World_Global; // 0x03C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_Element; // 0x03D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_5_Element; // 0x03F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_Result; // 0x0408(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Divide_1_Result; // 0x040C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_GetDeltaTime_1_Result; // 0x0410(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_8_Element; // 0x0418(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_VelocityGlobal; // 0x0430(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Entry_Maximum_Length; // 0x0448(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Entry_VelocityIn; // 0x0450(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Return_VelocityGlobal; // 0x0468(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_Result; // 0x0480(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_2_Result; // 0x0498(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_9_1_Result; // 0x04B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Result; // 0x04C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_1_Result; // 0x04E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_Result; // 0x04F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Multiply_Result; // 0x0510(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Scale_Result; // 0x0528(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_Result; // 0x0540(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_Result; // 0x0558(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Scale_Factor; // 0x0560(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_Result; // 0x0568(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_Result; // 0x0570(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_A; // 0x0578(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Power_1_Result; // 0x0580(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_Result; // 0x0588(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_Result; // 0x0590(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_A; // 0x0598(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Factor; // 0x05A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_Result; // 0x05A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Divide_Result; // 0x05C0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_RigVMFunction_GetDeltaTime_Result; // 0x05C4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_Transform; // 0x05D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_Parent; // 0x0630(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_CachedChild; // 0x0640(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_CachedParent; // 0x0650(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_CachedIndex; // 0x0660(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_Result; // 0x0670(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_B; // 0x0688(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_Result; // 0x06A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Add_Result; // 0x06B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_Result; // 0x06D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Unit_Result; // 0x06E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_2_Result; // 0x0700(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Clamp_Result; // 0x0704(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Divide_Result; // 0x0708(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_MathVectorLength_1_Result; // 0x070C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_MathVectorLength_Result; // 0x0710(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_714[0x4];                                      // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_2_Result; // 0x0718(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_1_Transform; // 0x0730(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_1_CachedIndex; // 0x0790(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_2_A; // 0x07A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B8[0x8];                                      // 0x07B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_Transform; // 0x07C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_1_Parent; // 0x0820(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82C[0x4];                                      // 0x082C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_1_CachedChild; // 0x0830(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2___BoneArraySpringSolver_HierarchyGetParent_1_CachedParent; // 0x0840(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_2_1_CachedIndex; // 0x0850(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_2_B; // 0x0860(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Clamp_Minimum; // 0x0878(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Clamp_Maximum; // 0x087C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_From_World_2_2_Global; // 0x0880(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_1_Element; // 0x0898(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_1_Result; // 0x08B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_1_Result; // 0x08D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_1_Result; // 0x08F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  BoneArraySpringSolver_2___BoneArraySpringSolver_QuatBetweenDirections_0_Quat; // 0x0910(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_3_Result; // 0x0930(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_948[0x8];                                      // 0x0948(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Result; // 0x0950(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                QuatBetweenDirections_0___QuatBetweenDirections_Unit_2_Result; // 0x0970(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                QuatBetweenDirections_0___QuatBetweenDirections_MathVectorCross_Result; // 0x0988(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                QuatBetweenDirections_0___QuatBetweenDirections_Unit_1_Result; // 0x09A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                QuatBetweenDirections_0___QuatBetweenDirections_Unit_Result; // 0x09B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        QuatBetweenDirections_0___QuatBetweenDirections_Acos_Result; // 0x09D0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         QuatBetweenDirections_0___QuatBetweenDirections_Dot___Result; // 0x09D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9DC[0x4];                                      // 0x09DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        QuatBetweenDirections_0___QuatBetweenDirections_Acos_Value; // 0x09E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Angle; // 0x09E8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_1_Factor; // 0x09EC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_1_B; // 0x09F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_Value__IO; // 0x0A10(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_10_Element; // 0x0A70(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_Weight; // 0x0A78(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A7C[0x4];                                      // 0x0A7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_CachedIndex; // 0x0A80(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x0A90(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneArraySpringSolver_2___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0A98(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x0AA0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x0AA4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x0AA8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_Transform; // 0x0AB0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x0B10(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1C[0x4];                                      // 0x0B1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_CachedIndex; // 0x0B20(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                LocalVariable__BoneArraySpringSolver_BonePosition_0; // 0x0B30(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2_1___BoneArraySpringSolver_IsNearlyZero_Result; // 0x0B48(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B49[0x7];                                      // 0x0B49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_Element; // 0x0B50(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0B68(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6C[0x4];                                      // 0x0B6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_To_World_1_World; // 0x0B70(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x0B88(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x0B8C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_To_World_2_World; // 0x0B90(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x0BA8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolver_0_Strength; // 0x0BC0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolver_0_Damping; // 0x0BC8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolver_0_Out; // 0x0BD0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolver_0_Velocity; // 0x0BE8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_7_Element; // 0x0C00(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Entry_Maximum_Length_0; // 0x0C18(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1C[0x4];                                      // 0x0C1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolver_0___SpringSolver_Return_Velocity_0;   // 0x0C20(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Entry_VelocityIn_0;  // 0x0C38(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_MathVectorClampLength_Result_0; // 0x0C50(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_1_2_Result_0; // 0x0C68(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_9_1_Result_0;    // 0x0C80(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Scale_3_Result_0;    // 0x0C98(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_1_Result_0; // 0x0CB0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_Result_0; // 0x0CC8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Scale_Result_0;      // 0x0CE0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_Result_0;   // 0x0CF8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Multiply_7_Result_0; // 0x0D10(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Scale_Factor_0;      // 0x0D18(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1C[0x4];                                      // 0x0D1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Multiply_6_Result_0; // 0x0D20(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_GetDeltaTime_3_Result_0; // 0x0D28(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2C[0x4];                                      // 0x0D2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Multiply_6_A_0;      // 0x0D30(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Power_1_Result_0;    // 0x0D38(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_Result_0;    // 0x0D40(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Divide_2_Result_0;   // 0x0D48(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Divide_2_A_0;        // 0x0D50(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Scale_3_Factor_0;    // 0x0D58(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5C[0x4];                                      // 0x0D5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_1_Result_0; // 0x0D60(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Divide_Result_0;     // 0x0D78(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_RigVMFunction_GetDeltaTime_Result_0; // 0x0D7C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2_1___BoneArraySpringSolver_IsNearlyZero_1_Result; // 0x0D80(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D81[0x7];                                      // 0x0D81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_1_Element; // 0x0D88(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_4_Element; // 0x0DA0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolverGlobal_0_Strength; // 0x0DB8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolverGlobal_0_Damping; // 0x0DC0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolverGlobal_0_Out; // 0x0DC8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Scale_1_1_Result; // 0x0DE0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Subtract_1_Result; // 0x0DF8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_From_World_Global; // 0x0E10(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_Element; // 0x0E28(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_5_Element; // 0x0E40(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_Multiply_Result; // 0x0E58(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_Divide_1_Result; // 0x0E5C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_RigVMFunction_GetDeltaTime_1_Result; // 0x0E60(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E64[0x4];                                      // 0x0E64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_8_Element; // 0x0E68(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolverGlobal_0_VelocityGlobal; // 0x0E80(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Entry_Maximum_Length_0; // 0x0E98(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9C[0x4];                                      // 0x0E9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Entry_VelocityIn_0; // 0x0EA0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Return_VelocityGlobal_0; // 0x0EB8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_Result_0; // 0x0ED0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_2_Result_0; // 0x0EE8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_9_1_Result_0; // 0x0F00(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Result_0; // 0x0F18(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_1_Result_0; // 0x0F30(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_Result_0; // 0x0F48(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Multiply_Result_0; // 0x0F60(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Scale_Result_0; // 0x0F78(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_Result_0; // 0x0F90(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_Result_0; // 0x0FA8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Scale_Factor_0; // 0x0FB0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB4[0x4];                                      // 0x0FB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_Result_0; // 0x0FB8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_Result_0; // 0x0FC0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC4[0x4];                                      // 0x0FC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_A_0; // 0x0FC8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Power_1_Result_0; // 0x0FD0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_Result_0; // 0x0FD8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_Result_0; // 0x0FE0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_A_0; // 0x0FE8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Factor_0; // 0x0FF0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF4[0x4];                                      // 0x0FF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_Result_0; // 0x0FF8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Divide_Result_0; // 0x1010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_RigVMFunction_GetDeltaTime_Result_0; // 0x1014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1018[0x8];                                     // 0x1018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_2_Transform; // 0x1020(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_HierarchyGetParent_Parent; // 0x1080(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108C[0x4];                                     // 0x108C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_HierarchyGetParent_CachedChild; // 0x1090(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_HierarchyGetParent_CachedParent; // 0x10A0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_2_CachedIndex; // 0x10B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Subtract_Result; // 0x10C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Subtract_B; // 0x10D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_Result; // 0x10F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Add_Result; // 0x1108(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Scale_Result; // 0x1120(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
