#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Female_Hair_Afro_Long_CtrlRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass Female_Hair_Afro_Long_CtrlRig.Female_Hair_Afro_Long_CtrlRig_C
// 0x00A8 (0x0B78 - 0x0AD0)
class UFemale_Hair_Afro_Long_CtrlRig_C final : public UControlRig
{
public:
	TArray<struct FVector>                        BoneArraySpringSolver_CurrentSpringPositionGlobal; // 0x0AD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        BoneArraySpringSolver_LastFrameSpringPositionGlobal; // 0x0AE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        BoneArraySpringSolver_CurrentVelocity;             // 0x0AF0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        BoneArraySpringSolver_CurrentVelocityGlobal;       // 0x0B00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                BoneArraySpringSolver_Alphas;                      // 0x0B10(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 BoneArraySpringSolver_SpringStrength;              // 0x0B20(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 BoneArraySpringSolver_SpringDamping;               // 0x0B30(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        BoneArraySpringSolver_CurrentSpringPositionWorld;  // 0x0B40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Swimming;                                          // 0x0B50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B51[0x7];                                      // 0x0B51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                SwimStrength;                                      // 0x0B58(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                SwimDamping;                                       // 0x0B68(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Female_Hair_Afro_Long_CtrlRig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Female_Hair_Afro_Long_CtrlRig_C")
	}
	static class UFemale_Hair_Afro_Long_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFemale_Hair_Afro_Long_CtrlRig_C>();
	}
};
DUMPER7_ASSERTS_UFemale_Hair_Afro_Long_CtrlRig_C;

}

