#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Foot_Locking_IK

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Foot_Locking_IK.Foot_Locking_IK
// 0x0260 (0x0260 - 0x0000)
struct FFoot_Locking_IK final
{
public:
	class FName                                   Def_AnkleBoneName_76_5CE294D3477B05D288E6DBB35FED018A; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Def_BaseBoneName_36_F601CCA143AD2DE9338EC9AD27B97BF8; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Def_HipBoneName_74_78F682C146E9BA4183449C91B7AA30AF; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Def_KneeBoneName_79_1C27D6CA442F6CC3944CC9BCF317F687; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Def_BallBoneName_146_ACD392664193BB66624CFF9E973501C0; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Lock_Def_CurveName_75_976917084AC0B2CA66E1F1AB64D889C0; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lock_Def_Max_IK_Distance_Offset_100_32D7CD6B4CE96AEF976271A9B40DEAC6; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lock_Def_BreakCooldownTime_110_BDF59B4D4DC1A0E27114A7A64F143563; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IK_Def_MaxRotationOffset_35_2733B91049B72F29629EACA4C53D7E38; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IK_Def_Trace_Distance_Above_38_12D6CC73426C5AAFC5D80383848BD85E; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IK_Def_Trace_Distance_Below_39_B804B1F94B48E2B526B30BA48863C023; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IK_Def_Trace_Radius_94_45B28BA04E7A9595EBC478A36DD2B630; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IK_Def_UseBall_148_5636A44F4E7D428C372F2187B8E870CC; // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lock_On_81_9E13132A47927E1B66EBA19EB3D94E2A;       // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Lock_Location_5_2FE668C2458943F82771499F5980D77E;  // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Lock_Rotation_53_7DAA3BBC4C85E80961B839BA897C79A3; // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Lock_Ankle_Transform_84_0293B8E14BB36BAB5810DAA0153BB127; // 0x00A0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lock_Alpha_8_3DEBEF7F4B6E0BE78E0E519150F8AB08;     // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lock_Alpha_Target_87_AF2293D4431C7B343BB2E7A62CDA7166; // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lock_BreakingIKConstraint_50_E538673C44FFA67BC22EBD90D6D500C0; // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Lock_BreakingIKConstraint_CooldownTimer_96_CDC21E4F4D34513FCA4A1593087E8F21; // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Lock_Max_IK_Distance_56_46E5F21246DD299A295713835A5D55EF; // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lock_CurveWasBelowThreshold_121_F2E24AAC45F95C4192364CB71B87DE15; // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IK_OffsetLocation_21_79DDED484449A249056F058CADF723B9; // 0x0130(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IK_OffsetLocationTarget_22_53E5BD1E48B589F16E8B08A562C55762; // 0x0148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IK_ImpactLocation_124_3A5BAA86472E9164ECA4F29DC4B1C110; // 0x0160(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               IK_OffsetRotation_24_5A6DE2BF402F85651B1CC8A70B78F67D; // 0x0178(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               IK_OffsetRotationTarget_26_EB573CF24ADB847C78EAC9B1079D2231; // 0x0190(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                IK_HitImpactNormal_139_9D37364D4D3AC8EFBB1E6AB9540809D9; // 0x01A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IK_FloorNormal_42_B2CB07A34CC3EECBD22775B26736D0D5; // 0x01C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IK_FloorNormalTarget_48_DAF404BA48AAD452AFBBB39219A75052; // 0x01D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IK_FloorTouchingOffset_45_7394FBD44758675E967916899D205603; // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IK_FloorTouchingOffsetTarget_106_20AD2D7D4F831BEF796A578F91C4962E; // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IK_TraceHit_60_C344C65C48F0ECE3065E78AF539E8504;   // 0x0200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IK_ProbeVelocity_103_3CE6436F4C9C9EDC00625CAAA4F82276; // 0x0208(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      IK_TraceHitPhysMat_116_241004FC49B112C4B840689E9BBFD0C0; // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IK_WorldLocationSmoothed_127_F742CD11439175A67F304FBFE3BB01E3; // 0x0228(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastPosition_119_C42BB66F477B4C73BF58CAB355B3EFCD; // 0x0240(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FFoot_Locking_IK;

}

