#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayCameras

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivateCameraDirector
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivateCameraDirector final
{
public:
	struct FBlueprintCameraDirectorActivateParams Params_0;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivateCameraDirector;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivateCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivateCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRig;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivateCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivateCameraRigPrefab
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivateCameraRigPrefab final
{
public:
	class UCameraRigAsset*                        CameraRig;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivateCameraRigPrefab;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivateCameraRigViaProxy
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivateCameraRigViaProxy final
{
public:
	class UCameraRigProxyAsset*                   CameraRigProxy;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivateCameraRigViaProxy;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivatePersistentBaseCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivatePersistentBaseCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivatePersistentBaseCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivatePersistentGlobalCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivatePersistentGlobalCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivatePersistentGlobalCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.ActivatePersistentVisualCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_ActivatePersistentVisualCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_ActivatePersistentVisualCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.DeactivateCameraDirector
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_DeactivateCameraDirector final
{
public:
	struct FBlueprintCameraDirectorDeactivateParams Params_0;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_DeactivateCameraDirector;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.DeactivatePersistentBaseCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_DeactivatePersistentBaseCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_DeactivatePersistentBaseCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.DeactivatePersistentGlobalCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_DeactivatePersistentGlobalCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_DeactivatePersistentGlobalCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.DeactivatePersistentVisualCameraRig
// 0x0008 (0x0008 - 0x0000)
struct BlueprintCameraDirectorEvaluator_DeactivatePersistentVisualCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRigPrefab;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_DeactivatePersistentVisualCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.RunCameraDirector
// 0x0010 (0x0010 - 0x0000)
struct BlueprintCameraDirectorEvaluator_RunCameraDirector final
{
public:
	struct FBlueprintCameraDirectorEvaluationParams Params_0;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_RunCameraDirector;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.SetInitialContextCameraPose
// 0x0070 (0x0070 - 0x0000)
struct BlueprintCameraDirectorEvaluator_SetInitialContextCameraPose final
{
public:
	struct FBlueprintCameraPose                   InCameraPose;                                      // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_SetInitialContextCameraPose;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.FindEvaluationContextOwnerActor
// 0x0010 (0x0010 - 0x0000)
struct BlueprintCameraDirectorEvaluator_FindEvaluationContextOwnerActor final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_FindEvaluationContextOwnerActor;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.GetCameraRig
// 0x0010 (0x0010 - 0x0000)
struct BlueprintCameraDirectorEvaluator_GetCameraRig final
{
public:
	class UCameraRigAsset*                        CameraRig;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_GetCameraRig;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.GetInitialContextCameraPose
// 0x0070 (0x0070 - 0x0000)
struct BlueprintCameraDirectorEvaluator_GetInitialContextCameraPose final
{
public:
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x0000(0x0070)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_GetInitialContextCameraPose;

// Function GameplayCameras.BlueprintCameraDirectorEvaluator.GetInitialContextVariableTable
// 0x0018 (0x0018 - 0x0000)
struct BlueprintCameraDirectorEvaluator_GetInitialContextVariableTable final
{
public:
	struct FBlueprintCameraVariableTable          ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraDirectorEvaluator_GetInitialContextVariableTable;

// Function GameplayCameras.ActivateCameraRigFunctions.ActivatePersistentBaseCameraRig
// 0x0018 (0x0018 - 0x0000)
struct ActivateCameraRigFunctions_ActivatePersistentBaseCameraRig final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      PlayerController;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActivateCameraRigFunctions_ActivatePersistentBaseCameraRig;

// Function GameplayCameras.ActivateCameraRigFunctions.ActivatePersistentGlobalCameraRig
// 0x0018 (0x0018 - 0x0000)
struct ActivateCameraRigFunctions_ActivatePersistentGlobalCameraRig final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      PlayerController;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActivateCameraRigFunctions_ActivatePersistentGlobalCameraRig;

// Function GameplayCameras.ActivateCameraRigFunctions.ActivatePersistentVisualCameraRig
// 0x0018 (0x0018 - 0x0000)
struct ActivateCameraRigFunctions_ActivatePersistentVisualCameraRig final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      PlayerController;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActivateCameraRigFunctions_ActivatePersistentVisualCameraRig;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetAimDir
// 0x0088 (0x0088 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetAimDir final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetAimDir;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetAimRay
// 0x00A0 (0x00A0 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetAimRay final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRay                                   ReturnValue;                                       // 0x0070(0x0030)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetAimRay;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetEffectiveFieldOfView
// 0x0078 (0x0078 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetEffectiveFieldOfView final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetEffectiveFieldOfView;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetFieldOfView
// 0x0078 (0x0078 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetFieldOfView final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetFieldOfView;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetFocalLength
// 0x0078 (0x0078 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetFocalLength final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetFocalLength;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetLocation
// 0x0088 (0x0088 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetLocation final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetLocation;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetRotation
// 0x0088 (0x0088 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetRotation final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetRotation;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetSensorAspectRatio
// 0x0078 (0x0078 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetSensorAspectRatio final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetSensorAspectRatio;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetTarget
// 0x0088 (0x0088 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetTarget final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetTarget;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetTargetAtDistance
// 0x0090 (0x0090 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetTargetAtDistance final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        TargetDistance;                                    // 0x0070(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0078(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetTargetAtDistance;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetTargetDistance
// 0x0078 (0x0078 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetTargetDistance final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetTargetDistance;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.GetTransform
// 0x00D0 (0x00D0 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_GetTransform final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0070(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_GetTransform;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.MakeCameraPoseFromCameraComponent
// 0x0078 (0x0078 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_MakeCameraPoseFromCameraComponent final
{
public:
	const class UCameraComponent*                 CameraComponent;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x0008(0x0070)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_MakeCameraPoseFromCameraComponent;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.MakeCameraPoseFromCineCameraComponent
// 0x0078 (0x0078 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_MakeCameraPoseFromCineCameraComponent final
{
public:
	const class UCineCameraComponent*             CameraComponent;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x0008(0x0070)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_MakeCameraPoseFromCineCameraComponent;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.SetFieldOfView
// 0x00E8 (0x00E8 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_SetFieldOfView final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FieldOfView;                                       // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x0078(0x0070)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_SetFieldOfView;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.SetFocalLength
// 0x00E8 (0x00E8 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_SetFocalLength final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FocalLength;                                       // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x0078(0x0070)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_SetFocalLength;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.SetLocation
// 0x00F8 (0x00F8 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_SetLocation final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0070(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x0088(0x0070)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_SetLocation;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.SetRotation
// 0x00F8 (0x00F8 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_SetRotation final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0070(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x0088(0x0070)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_SetRotation;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.SetTargetDistance
// 0x00E8 (0x00E8 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_SetTargetDistance final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	double                                        TargetDistance;                                    // 0x0070(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x0078(0x0070)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_SetTargetDistance;

// Function GameplayCameras.BlueprintCameraPoseFunctionLibrary.SetTransform
// 0x0140 (0x0140 - 0x0000)
struct BlueprintCameraPoseFunctionLibrary_SetTransform final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0070(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x00D0(0x0070)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraPoseFunctionLibrary_SetTransform;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetBooleanCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UBooleanCameraVariable*                 Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetDoubleCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UDoubleCameraVariable*                  Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetFloatCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UFloatCameraVariable*                   Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetInteger32CameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UInteger32CameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetRotatorCameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class URotator3dCameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetTransformCameraVariable
// 0x0080 (0x0080 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UTransform3dCameraVariable*             Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0020(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetVector2CameraVariable
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector2dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetVector3CameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector3dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetVector4CameraVariable
// 0x0040 (0x0040 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector4dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               ReturnValue;                                       // 0x0020(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetBooleanCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UBooleanCameraVariable*                 Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetDoubleCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UDoubleCameraVariable*                  Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Value;                                             // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetFloatCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UFloatCameraVariable*                   Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetInteger32CameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UInteger32CameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetRotatorCameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class URotator3dCameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Value;                                             // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetTransformCameraVariable
// 0x0080 (0x0080 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UTransform3dCameraVariable*             Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Value;                                             // 0x0020(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetVector2CameraVariable
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector2dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Value;                                             // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetVector3CameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector3dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable;

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetVector4CameraVariable
// 0x0040 (0x0040 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector4dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               Value;                                             // 0x0020(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable;

// Function GameplayCameras.CameraRigParameterInterop.SetBooleanParameter
// 0x0038 (0x0038 - 0x0000)
struct CameraRigParameterInterop_SetBooleanParameter final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterName;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bParameterValue;                                   // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CameraRigParameterInterop_SetBooleanParameter;

// Function GameplayCameras.CameraRigParameterInterop.SetDoubleParameter
// 0x0038 (0x0038 - 0x0000)
struct CameraRigParameterInterop_SetDoubleParameter final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterName;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ParameterValue;                                    // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraRigParameterInterop_SetDoubleParameter;

// Function GameplayCameras.CameraRigParameterInterop.SetFloatParameter
// 0x0038 (0x0038 - 0x0000)
struct CameraRigParameterInterop_SetFloatParameter final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterName;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ParameterValue;                                    // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraRigParameterInterop_SetFloatParameter;

// Function GameplayCameras.CameraRigParameterInterop.SetIntegerParameter
// 0x0038 (0x0038 - 0x0000)
struct CameraRigParameterInterop_SetIntegerParameter final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterName;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParameterValue;                                    // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CameraRigParameterInterop_SetIntegerParameter;

// Function GameplayCameras.CameraRigParameterInterop.SetRotatorParameter
// 0x0048 (0x0048 - 0x0000)
struct CameraRigParameterInterop_SetRotatorParameter final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterName;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ParameterValue;                                    // 0x0030(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraRigParameterInterop_SetRotatorParameter;

// Function GameplayCameras.CameraRigParameterInterop.SetTransformParameter
// 0x0090 (0x0090 - 0x0000)
struct CameraRigParameterInterop_SetTransformParameter final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterName;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ParameterValue;                                    // 0x0030(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraRigParameterInterop_SetTransformParameter;

// Function GameplayCameras.CameraRigParameterInterop.SetVector2Parameter
// 0x0040 (0x0040 - 0x0000)
struct CameraRigParameterInterop_SetVector2Parameter final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterName;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ParameterValue;                                    // 0x0030(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraRigParameterInterop_SetVector2Parameter;

// Function GameplayCameras.CameraRigParameterInterop.SetVector3Parameter
// 0x0048 (0x0048 - 0x0000)
struct CameraRigParameterInterop_SetVector3Parameter final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterName;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ParameterValue;                                    // 0x0030(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraRigParameterInterop_SetVector3Parameter;

// Function GameplayCameras.CameraRigParameterInterop.SetVector4Parameter
// 0x0050 (0x0050 - 0x0000)
struct CameraRigParameterInterop_SetVector4Parameter final
{
public:
	struct FBlueprintCameraVariableTable          VariableTable;                                     // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParameterName;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               ParameterValue;                                    // 0x0030(0x0020)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraRigParameterInterop_SetVector4Parameter;

// Function GameplayCameras.GameplayCameraActor.GetCameraComponent
// 0x0008 (0x0008 - 0x0000)
struct GameplayCameraActor_GetCameraComponent final
{
public:
	class UGameplayCameraComponent*               ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraActor_GetCameraComponent;

// Function GameplayCameras.GameplayCameraComponent.ActivateCameraForPlayerController
// 0x0008 (0x0008 - 0x0000)
struct GameplayCameraComponent_ActivateCameraForPlayerController final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraComponent_ActivateCameraForPlayerController;

// Function GameplayCameras.GameplayCameraComponent.ActivateCameraForPlayerIndex
// 0x0004 (0x0004 - 0x0000)
struct GameplayCameraComponent_ActivateCameraForPlayerIndex final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraComponent_ActivateCameraForPlayerIndex;

// Function GameplayCameras.GameplayCameraComponent.SetInitialPose
// 0x0070 (0x0070 - 0x0000)
struct GameplayCameraComponent_SetInitialPose final
{
public:
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraComponent_SetInitialPose;

// Function GameplayCameras.GameplayCameraComponent.GetInitialPose
// 0x0070 (0x0070 - 0x0000)
struct GameplayCameraComponent_GetInitialPose final
{
public:
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x0000(0x0070)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraComponent_GetInitialPose;

// Function GameplayCameras.GameplayCameraComponent.GetInitialVariableTable
// 0x0018 (0x0018 - 0x0000)
struct GameplayCameraComponent_GetInitialVariableTable final
{
public:
	struct FBlueprintCameraVariableTable          ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraComponent_GetInitialVariableTable;

// Function GameplayCameras.GameplayCameraSystemActor.AutoManageActiveViewTarget
// 0x0008 (0x0008 - 0x0000)
struct GameplayCameraSystemActor_AutoManageActiveViewTarget final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraSystemActor_AutoManageActiveViewTarget;

// Function GameplayCameras.GameplayCameraSystemActor.GetAutoSpawnedCameraSystemActor
// 0x0018 (0x0018 - 0x0000)
struct GameplayCameraSystemActor_GetAutoSpawnedCameraSystemActor final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceSpawn;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameplayCameraSystemActor*             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraSystemActor_GetAutoSpawnedCameraSystemActor;

// Function GameplayCameras.GameplayCameraSystemActor.GetCameraSystemComponent
// 0x0008 (0x0008 - 0x0000)
struct GameplayCameraSystemActor_GetCameraSystemComponent final
{
public:
	class UGameplayCameraSystemComponent*         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraSystemActor_GetCameraSystemComponent;

// Function GameplayCameras.GameplayCameraSystemComponent.ActivateCameraSystemForPlayerController
// 0x0008 (0x0008 - 0x0000)
struct GameplayCameraSystemComponent_ActivateCameraSystemForPlayerController final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameplayCameraSystemComponent_ActivateCameraSystemForPlayerController;

// Function GameplayCameras.GameplayCameraSystemComponent.ActivateCameraSystemForPlayerIndex
// 0x0004 (0x0004 - 0x0000)
struct GameplayCameraSystemComponent_ActivateCameraSystemForPlayerIndex final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
