#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayCameras

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "StateTreeModule_structs.hpp"


namespace SDK
{

// Enum GameplayCameras.EBuiltInDoubleCameraVariable
// NumValues: 0x0006
enum class EBuiltInDoubleCameraVariable : uint32
{
	None                                     = 0,
	Yaw                                      = 1,
	Pitch                                    = 2,
	Roll                                     = 3,
	Zoom                                     = 4,
	EBuiltInDoubleCameraVariable_MAX         = 5,
};

// Enum GameplayCameras.EBuiltInVector2dCameraVariable
// NumValues: 0x0003
enum class EBuiltInVector2dCameraVariable : uint32
{
	None                                     = 0,
	YawPitch                                 = 1,
	EBuiltInVector2dCameraVariable_MAX       = 2,
};

// Enum GameplayCameras.EBuiltInRotator3dCameraVariable
// NumValues: 0x0003
enum class EBuiltInRotator3dCameraVariable : uint8
{
	None                                     = 0,
	ControlRotation                          = 1,
	EBuiltInRotator3dCameraVariable_MAX      = 2,
};

// Enum GameplayCameras.ECameraBuildStatus
// NumValues: 0x0005
enum class ECameraBuildStatus : uint8
{
	Clean                                    = 0,
	CleanWithWarnings                        = 1,
	WithErrors                               = 2,
	Dirty                                    = 3,
	ECameraBuildStatus_MAX                   = 4,
};

// Enum GameplayCameras.ECameraNodeOriginPosition
// NumValues: 0x0006
enum class ECameraNodeOriginPosition : uint8
{
	CameraPose                               = 0,
	ActiveContext                            = 1,
	OwningContext                            = 2,
	Pivot                                    = 3,
	Pawn                                     = 4,
	ECameraNodeOriginPosition_MAX            = 5,
};

// Enum GameplayCameras.ECameraNodeSpace
// NumValues: 0x0007
enum class ECameraNodeSpace : uint8
{
	CameraPose                               = 0,
	ActiveContext                            = 1,
	OwningContext                            = 2,
	Pivot                                    = 3,
	Pawn                                     = 4,
	World                                    = 5,
	ECameraNodeSpace_MAX                     = 6,
};

// Enum GameplayCameras.ECameraVariableType
// NumValues: 0x000F
enum class ECameraVariableType : uint32
{
	Boolean                                  = 0,
	Integer32                                = 1,
	Float                                    = 2,
	Double                                   = 3,
	Vector2f                                 = 4,
	Vector2d                                 = 5,
	Vector3f                                 = 6,
	Vector3d                                 = 7,
	Vector4f                                 = 8,
	Vector4d                                 = 9,
	Rotator3f                                = 10,
	Rotator3d                                = 11,
	Transform3f                              = 12,
	Transform3d                              = 13,
	ECameraVariableType_MAX                  = 14,
};

// Enum GameplayCameras.ECameraBlendStackType
// NumValues: 0x0003
enum class ECameraBlendStackType : uint32
{
	IsolatedTransient                        = 0,
	AdditivePersistent                       = 1,
	ECameraBlendStackType_MAX                = 2,
};

// Enum GameplayCameras.ECameraRigInitialOrientation
// NumValues: 0x0006
enum class ECameraRigInitialOrientation : uint32
{
	None                                     = 0,
	ContextYawPitch                          = 1,
	PreviousYawPitch                         = 2,
	PreviousAbsoluteTarget                   = 3,
	PreviousRelativeTarget                   = 4,
	ECameraRigInitialOrientation_MAX         = 5,
};

// Enum GameplayCameras.ECameraRigLayer
// NumValues: 0x0005
enum class ECameraRigLayer : uint8
{
	Base                                     = 0,
	Main                                     = 1,
	Global                                   = 2,
	Visual                                   = 3,
	ECameraRigLayer_MAX                      = 4,
};

// Enum GameplayCameras.ESmoothCameraBlendType
// NumValues: 0x0003
enum class ESmoothCameraBlendType : uint32
{
	SmoothStep                               = 0,
	SmootherStep                             = 1,
	ESmoothCameraBlendType_MAX               = 2,
};

// Enum GameplayCameras.ECollisionSafePosition
// NumValues: 0x0005
enum class ECollisionSafePosition : uint8
{
	ActiveContext                            = 0,
	OwningContext                            = 1,
	Pivot                                    = 2,
	Pawn                                     = 3,
	ECollisionSafePosition_MAX               = 4,
};

// Enum GameplayCameras.ECollisionSafePositionOffsetSpace
// NumValues: 0x0006
enum class ECollisionSafePositionOffsetSpace : uint8
{
	ActiveContext                            = 0,
	OwningContext                            = 1,
	Pivot                                    = 2,
	CameraPose                               = 3,
	Pawn                                     = 4,
	ECollisionSafePositionOffsetSpace_MAX    = 5,
};

// Enum GameplayCameras.ECameraAutoRotateDirection
// NumValues: 0x0003
enum class ECameraAutoRotateDirection : uint32
{
	Facing                                   = 0,
	Movement                                 = 1,
	ECameraAutoRotateDirection_MAX           = 2,
};

// ScriptStruct GameplayCameras.GameplayCamerasActivateCameraRigTaskInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FGameplayCamerasActivateCameraRigTaskInstanceData final
{
public:
	class UCameraRigAsset*                        CameraRig;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FGameplayCamerasActivateCameraRigTaskInstanceData;

// ScriptStruct GameplayCameras.DoubleCameraParameter
// 0x0010 (0x0010 - 0x0000)
struct FDoubleCameraParameter final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDoubleCameraVariable*                  Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FDoubleCameraParameter;

// ScriptStruct GameplayCameras.CameraFramingZone
// 0x0040 (0x0040 - 0x0000)
struct FCameraFramingZone final
{
public:
	struct FDoubleCameraParameter                 LeftMargin;                                        // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDoubleCameraParameter                 TopMargin;                                         // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDoubleCameraParameter                 RightMargin;                                       // 0x0020(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDoubleCameraParameter                 BottomMargin;                                      // 0x0030(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraFramingZone;

// ScriptStruct GameplayCameras.BlueprintCameraDirectorDeactivateParams
// 0x0008 (0x0008 - 0x0000)
struct FBlueprintCameraDirectorDeactivateParams final
{
public:
	class UObject*                                EvaluationContextOwner;                            // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FBlueprintCameraDirectorDeactivateParams;

// ScriptStruct GameplayCameras.CameraNodeEvaluatorAllocationInfo
// 0x0004 (0x0004 - 0x0000)
struct FCameraNodeEvaluatorAllocationInfo final
{
public:
	int16                                         TotalSizeof;                                       // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         MaxAlignof;                                        // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraNodeEvaluatorAllocationInfo;

// ScriptStruct GameplayCameras.Rotator3dCameraParameter
// 0x0020 (0x0020 - 0x0000)
struct FRotator3dCameraParameter final
{
public:
	struct FRotator3d                             Value;                                             // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class URotator3dCameraVariable*               Variable;                                          // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FRotator3dCameraParameter;

// ScriptStruct GameplayCameras.CameraRigParameterOverrideBase
// 0x0038 (0x0038 - 0x0000)
struct FCameraRigParameterOverrideBase
{
public:
	struct FGuid                                  InterfaceParameterGuid;                            // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  PrivateVariableGuid;                               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InterfaceParameterName;                            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvalid;                                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraRigParameterOverrideBase;

// ScriptStruct GameplayCameras.Rotator3dCameraRigParameterOverride
// 0x0020 (0x0058 - 0x0038)
struct FRotator3dCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	struct FRotator3dCameraParameter              Value;                                             // 0x0038(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRotator3dCameraRigParameterOverride;

// ScriptStruct GameplayCameras.BooleanCameraParameter
// 0x0010 (0x0010 - 0x0000)
struct FBooleanCameraParameter final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBooleanCameraVariable*                 Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FBooleanCameraParameter;

// ScriptStruct GameplayCameras.Integer32CameraParameter
// 0x0010 (0x0010 - 0x0000)
struct FInteger32CameraParameter final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteger32CameraVariable*               Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FInteger32CameraParameter;

// ScriptStruct GameplayCameras.GameplayCamerasStateTreeCondition
// 0x0000 (0x0028 - 0x0028)
struct FGameplayCamerasStateTreeCondition final : public FStateTreeConditionBase
{
};
DUMPER7_ASSERTS_FGameplayCamerasStateTreeCondition;

// ScriptStruct GameplayCameras.FloatCameraParameter
// 0x0010 (0x0010 - 0x0000)
struct FFloatCameraParameter final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFloatCameraVariable*                   Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FFloatCameraParameter;

// ScriptStruct GameplayCameras.Vector2fCameraParameter
// 0x0010 (0x0010 - 0x0000)
struct FVector2fCameraParameter final
{
public:
	struct FVector2f                              Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVector2fCameraVariable*                Variable;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FVector2fCameraParameter;

// ScriptStruct GameplayCameras.Vector2dCameraParameter
// 0x0018 (0x0018 - 0x0000)
struct FVector2dCameraParameter final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVector2dCameraVariable*                Variable;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FVector2dCameraParameter;

// ScriptStruct GameplayCameras.Vector3fCameraParameter
// 0x0018 (0x0018 - 0x0000)
struct FVector3fCameraParameter final
{
public:
	struct FVector3f                              Value;                                             // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVector3fCameraVariable*                Variable;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FVector3fCameraParameter;

// ScriptStruct GameplayCameras.Vector3dCameraParameter
// 0x0020 (0x0020 - 0x0000)
struct FVector3dCameraParameter final
{
public:
	struct FVector3d                              Value;                                             // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVector3dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FVector3dCameraParameter;

// ScriptStruct GameplayCameras.Vector4fCameraParameter
// 0x0020 (0x0020 - 0x0000)
struct FVector4fCameraParameter final
{
public:
	struct FVector4f                              Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVector4fCameraVariable*                Variable;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FVector4fCameraParameter;

// ScriptStruct GameplayCameras.CameraDirectorStateTreeEvaluationData
// 0x0020 (0x0020 - 0x0000)
struct FCameraDirectorStateTreeEvaluationData final
{
public:
	TArray<class UCameraRigAsset*>                ActiveCameraRigs;                                  // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<class UCameraRigProxyAsset*>           ActiveCameraRigProxies;                            // 0x0010(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FCameraDirectorStateTreeEvaluationData;

// ScriptStruct GameplayCameras.Vector4dCameraParameter
// 0x0030 (0x0030 - 0x0000)
struct FVector4dCameraParameter final
{
public:
	struct FVector4d                              Value;                                             // 0x0000(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVector4dCameraVariable*                Variable;                                          // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FVector4dCameraParameter;

// ScriptStruct GameplayCameras.Rotator3fCameraParameter
// 0x0018 (0x0018 - 0x0000)
struct FRotator3fCameraParameter final
{
public:
	struct FRotator3f                             Value;                                             // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URotator3fCameraVariable*               Variable;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FRotator3fCameraParameter;

// ScriptStruct GameplayCameras.Transform3fCameraParameter
// 0x0040 (0x0040 - 0x0000)
struct FTransform3fCameraParameter final
{
public:
	struct FTransform3f                           Value;                                             // 0x0000(0x0030)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTransform3fCameraVariable*             Variable;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTransform3fCameraParameter;

// ScriptStruct GameplayCameras.Transform3dCameraParameter
// 0x0070 (0x0070 - 0x0000)
struct FTransform3dCameraParameter final
{
public:
	struct FTransform3d                           Value;                                             // 0x0000(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTransform3dCameraVariable*             Variable;                                          // 0x0060(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTransform3dCameraParameter;

// ScriptStruct GameplayCameras.CameraRigInputSlotParameters
// 0x0002 (0x0002 - 0x0000)
struct FCameraRigInputSlotParameters final
{
public:
	bool                                          bIsAccumulated;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPreBlended;                                     // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraRigInputSlotParameters;

// ScriptStruct GameplayCameras.CameraParameterClamping
// 0x0018 (0x0018 - 0x0000)
struct FCameraParameterClamping final
{
public:
	double                                        MinValue;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MaxValue;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampMin;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampMax;                                         // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraParameterClamping;

// ScriptStruct GameplayCameras.CameraParameterNormalization
// 0x0010 (0x0010 - 0x0000)
struct FCameraParameterNormalization final
{
public:
	double                                        MaxValue;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalize;                                        // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraParameterNormalization;

// ScriptStruct GameplayCameras.CameraRigProxyTableEntry
// 0x0010 (0x0010 - 0x0000)
struct FCameraRigProxyTableEntry final
{
public:
	class UCameraRigProxyAsset*                   CameraRigProxy;                                    // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UCameraRigAsset*                        CameraRig;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FCameraRigProxyTableEntry;

// ScriptStruct GameplayCameras.BooleanCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FBooleanCameraVariableReference final
{
public:
	class UBooleanCameraVariable*                 Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FBooleanCameraVariableReference;

// ScriptStruct GameplayCameras.Integer32CameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FInteger32CameraVariableReference final
{
public:
	class UInteger32CameraVariable*               Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FInteger32CameraVariableReference;

// ScriptStruct GameplayCameras.FloatCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FFloatCameraVariableReference final
{
public:
	class UFloatCameraVariable*                   Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FFloatCameraVariableReference;

// ScriptStruct GameplayCameras.DoubleCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FDoubleCameraVariableReference final
{
public:
	class UDoubleCameraVariable*                  Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FDoubleCameraVariableReference;

// ScriptStruct GameplayCameras.Vector2fCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FVector2fCameraVariableReference final
{
public:
	class UVector2fCameraVariable*                Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FVector2fCameraVariableReference;

// ScriptStruct GameplayCameras.Vector2dCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FVector2dCameraVariableReference final
{
public:
	class UVector2dCameraVariable*                Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FVector2dCameraVariableReference;

// ScriptStruct GameplayCameras.Vector3fCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FVector3fCameraVariableReference final
{
public:
	class UVector3fCameraVariable*                Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FVector3fCameraVariableReference;

// ScriptStruct GameplayCameras.Vector3dCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FVector3dCameraVariableReference final
{
public:
	class UVector3dCameraVariable*                Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FVector3dCameraVariableReference;

// ScriptStruct GameplayCameras.Vector4fCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FVector4fCameraVariableReference final
{
public:
	class UVector4fCameraVariable*                Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FVector4fCameraVariableReference;

// ScriptStruct GameplayCameras.Vector4dCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FVector4dCameraVariableReference final
{
public:
	class UVector4dCameraVariable*                Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FVector4dCameraVariableReference;

// ScriptStruct GameplayCameras.Rotator3fCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FRotator3fCameraVariableReference final
{
public:
	class URotator3fCameraVariable*               Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FRotator3fCameraVariableReference;

// ScriptStruct GameplayCameras.Rotator3dCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FRotator3dCameraVariableReference final
{
public:
	class URotator3dCameraVariable*               Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FRotator3dCameraVariableReference;

// ScriptStruct GameplayCameras.Transform3fCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FTransform3fCameraVariableReference final
{
public:
	class UTransform3fCameraVariable*             Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FTransform3fCameraVariableReference;

// ScriptStruct GameplayCameras.Transform3dCameraVariableReference
// 0x0008 (0x0008 - 0x0000)
struct FTransform3dCameraVariableReference final
{
public:
	class UTransform3dCameraVariable*             Variable;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FTransform3dCameraVariableReference;

// ScriptStruct GameplayCameras.CameraVariableID
// 0x0004 (0x0004 - 0x0000)
struct FCameraVariableID final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCameraVariableID;

// ScriptStruct GameplayCameras.CameraVariableDefinition
// 0x000C (0x000C - 0x0000)
struct FCameraVariableDefinition final
{
public:
	struct FCameraVariableID                      VariableID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraVariableType                           VariableType;                                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPrivate;                                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInput;                                          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraVariableDefinition;

// ScriptStruct GameplayCameras.CameraVariableTableAllocationInfo
// 0x0020 (0x0020 - 0x0000)
struct FCameraVariableTableAllocationInfo final
{
public:
	TArray<struct FCameraVariableDefinition>      VariableDefinitions;                               // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UCameraVariableAsset*>           AutoResetVariables;                                // 0x0010(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FCameraVariableTableAllocationInfo;

// ScriptStruct GameplayCameras.CameraPose
// 0x0088 (0x0088 - 0x0000)
struct FCameraPose final
{
public:
	struct FVector3d                              Location;                                          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FRotator3d                             Rotation;                                          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	double                                        TargetDistance;                                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FieldOfView;                                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FocalLength;                                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Aperture;                                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ShutterSpeed;                                      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FocusDistance;                                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SensorWidth;                                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SensorHeight;                                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ISO;                                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SqueezeFactor;                                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         DiaphragmBladeCount;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         NearClippingPlane;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FarClippingPlane;                                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PhysicalCameraBlendWeight;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          EnablePhysicalCamera;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          ConstrainAspectRatio;                              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          OverrideAspectRatioAxisConstraint;                 // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAspectRatioAxisConstraint                    AspectRatioAxisConstraint;                         // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x18];                                      // 0x0070(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraPose;

// ScriptStruct GameplayCameras.CameraRigAllocationInfo
// 0x0028 (0x0028 - 0x0000)
struct FCameraRigAllocationInfo final
{
public:
	struct FCameraNodeEvaluatorAllocationInfo     EvaluatorInfo;                                     // 0x0000(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraVariableTableAllocationInfo     VariableTableInfo;                                 // 0x0008(0x0020)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraRigAllocationInfo;

// ScriptStruct GameplayCameras.CameraRigInterface
// 0x0020 (0x0020 - 0x0000)
struct FCameraRigInterface final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UCameraRigInterfaceParameter*>   InterfaceParameters;                               // 0x0010(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FCameraRigInterface;

// ScriptStruct GameplayCameras.BooleanCameraRigParameterOverride
// 0x0010 (0x0048 - 0x0038)
struct FBooleanCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	struct FBooleanCameraParameter                Value;                                             // 0x0038(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBooleanCameraRigParameterOverride;

// ScriptStruct GameplayCameras.Integer32CameraRigParameterOverride
// 0x0010 (0x0048 - 0x0038)
struct FInteger32CameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	struct FInteger32CameraParameter              Value;                                             // 0x0038(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteger32CameraRigParameterOverride;

// ScriptStruct GameplayCameras.FloatCameraRigParameterOverride
// 0x0010 (0x0048 - 0x0038)
struct FFloatCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	struct FFloatCameraParameter                  Value;                                             // 0x0038(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFloatCameraRigParameterOverride;

// ScriptStruct GameplayCameras.BlueprintCameraDirectorEvaluationParams
// 0x0010 (0x0010 - 0x0000)
struct FBlueprintCameraDirectorEvaluationParams final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                EvaluationContextOwner;                            // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FBlueprintCameraDirectorEvaluationParams;

// ScriptStruct GameplayCameras.DoubleCameraRigParameterOverride
// 0x0010 (0x0048 - 0x0038)
struct FDoubleCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	struct FDoubleCameraParameter                 Value;                                             // 0x0038(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDoubleCameraRigParameterOverride;

// ScriptStruct GameplayCameras.Vector2fCameraRigParameterOverride
// 0x0010 (0x0048 - 0x0038)
struct FVector2fCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	struct FVector2fCameraParameter               Value;                                             // 0x0038(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVector2fCameraRigParameterOverride;

// ScriptStruct GameplayCameras.Transform3fCameraRigParameterOverride
// 0x0048 (0x0080 - 0x0038)
struct FTransform3fCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform3fCameraParameter            Value;                                             // 0x0040(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTransform3fCameraRigParameterOverride;

// ScriptStruct GameplayCameras.Vector2dCameraRigParameterOverride
// 0x0018 (0x0050 - 0x0038)
struct FVector2dCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	struct FVector2dCameraParameter               Value;                                             // 0x0038(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVector2dCameraRigParameterOverride;

// ScriptStruct GameplayCameras.Vector3fCameraRigParameterOverride
// 0x0018 (0x0050 - 0x0038)
struct FVector3fCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	struct FVector3fCameraParameter               Value;                                             // 0x0038(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVector3fCameraRigParameterOverride;

// ScriptStruct GameplayCameras.Vector3dCameraRigParameterOverride
// 0x0020 (0x0058 - 0x0038)
struct FVector3dCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	struct FVector3dCameraParameter               Value;                                             // 0x0038(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVector3dCameraRigParameterOverride;

// ScriptStruct GameplayCameras.Vector4fCameraRigParameterOverride
// 0x0028 (0x0060 - 0x0038)
struct FVector4fCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4fCameraParameter               Value;                                             // 0x0040(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVector4fCameraRigParameterOverride;

// ScriptStruct GameplayCameras.BlueprintCameraDirectorActivateParams
// 0x0008 (0x0008 - 0x0000)
struct FBlueprintCameraDirectorActivateParams final
{
public:
	class UObject*                                EvaluationContextOwner;                            // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FBlueprintCameraDirectorActivateParams;

// ScriptStruct GameplayCameras.Vector4dCameraRigParameterOverride
// 0x0038 (0x0070 - 0x0038)
struct FVector4dCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4dCameraParameter               Value;                                             // 0x0040(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVector4dCameraRigParameterOverride;

// ScriptStruct GameplayCameras.Rotator3fCameraRigParameterOverride
// 0x0018 (0x0050 - 0x0038)
struct FRotator3fCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	struct FRotator3fCameraParameter              Value;                                             // 0x0038(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRotator3fCameraRigParameterOverride;

// ScriptStruct GameplayCameras.Transform3dCameraRigParameterOverride
// 0x0078 (0x00B0 - 0x0038)
struct FTransform3dCameraRigParameterOverride final : public FCameraRigParameterOverrideBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform3dCameraParameter            Value;                                             // 0x0040(0x0070)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTransform3dCameraRigParameterOverride;

// ScriptStruct GameplayCameras.CameraRigParameterOverrides
// 0x00E0 (0x00E0 - 0x0000)
struct FCameraRigParameterOverrides final
{
public:
	TArray<struct FBooleanCameraRigParameterOverride> BooleanOverrides;                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FInteger32CameraRigParameterOverride> Integer32Overrides;                          // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FFloatCameraRigParameterOverride> FloatOverrides;                                  // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FDoubleCameraRigParameterOverride> DoubleOverrides;                                // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector2fCameraRigParameterOverride> Vector2fOverrides;                            // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector2dCameraRigParameterOverride> Vector2dOverrides;                            // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector3fCameraRigParameterOverride> Vector3fOverrides;                            // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector3dCameraRigParameterOverride> Vector3dOverrides;                            // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector4fCameraRigParameterOverride> Vector4fOverrides;                            // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector4dCameraRigParameterOverride> Vector4dOverrides;                            // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FRotator3fCameraRigParameterOverride> Rotator3fOverrides;                          // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FRotator3dCameraRigParameterOverride> Rotator3dOverrides;                          // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FTransform3fCameraRigParameterOverride> Transform3fOverrides;                      // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FTransform3dCameraRigParameterOverride> Transform3dOverrides;                      // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCameraRigParameterOverrides;

// ScriptStruct GameplayCameras.CameraRigAssetReference
// 0x00E8 (0x00E8 - 0x0000)
struct FCameraRigAssetReference final
{
public:
	class UCameraRigAsset*                        CameraRig;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	struct FCameraRigParameterOverrides           ParameterOverrides;                                // 0x0008(0x00E0)(Edit, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCameraRigAssetReference;

// ScriptStruct GameplayCameras.GameplayCamerasStateTreeTask
// 0x0000 (0x0028 - 0x0028)
struct FGameplayCamerasStateTreeTask : public FStateTreeTaskBase
{
};
DUMPER7_ASSERTS_FGameplayCamerasStateTreeTask;

// ScriptStruct GameplayCameras.GameplayCamerasActivateCameraRigTask
// 0x0008 (0x0030 - 0x0028)
struct FGameplayCamerasActivateCameraRigTask final : public FGameplayCamerasStateTreeTask
{
public:
	uint8                                         Pad_28[0x6];                                       // 0x0028(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bRunOnce;                                          // 0x002E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameplayCamerasActivateCameraRigTask;

// ScriptStruct GameplayCameras.GameplayCamerasActivateCameraRigViaProxyTaskInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FGameplayCamerasActivateCameraRigViaProxyTaskInstanceData final
{
public:
	class UCameraRigProxyAsset*                   CameraRigProxy;                                    // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FGameplayCamerasActivateCameraRigViaProxyTaskInstanceData;

// ScriptStruct GameplayCameras.GameplayCamerasActivateCameraRigViaProxyTask
// 0x0008 (0x0030 - 0x0028)
struct FGameplayCamerasActivateCameraRigViaProxyTask final : public FGameplayCamerasStateTreeTask
{
public:
	uint8                                         Pad_28[0x6];                                       // 0x0028(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bRunOnce;                                          // 0x002E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameplayCamerasActivateCameraRigViaProxyTask;

// ScriptStruct GameplayCameras.BlueprintCameraPose
// 0x0070 (0x0070 - 0x0000)
struct FBlueprintCameraPose final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	double                                        TargetDistance;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FieldOfView;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FocalLength;                                       // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Aperture;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShutterSpeed;                                      // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FocusDistance;                                     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SensorWidth;                                       // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SensorHeight;                                      // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ISO;                                               // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SqueezeFactor;                                     // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DiaphragmBladeCount;                               // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NearClippingPlane;                                 // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FarClippingPlane;                                  // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicalCameraBlendWeight;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnablePhysicalCamera;                              // 0x006C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConstrainAspectRatio;                              // 0x006D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideAspectRatioAxisConstraint;                 // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAspectRatioAxisConstraint                    AspectRatioAxisConstraint;                         // 0x006F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBlueprintCameraPose;

// ScriptStruct GameplayCameras.BlueprintCameraVariableTable
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FBlueprintCameraVariableTable final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBlueprintCameraVariableTable;

}

