#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayPseudoFunctionLibrary

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GameplayPseudoFunctionLibrary.GameplayPseudoFunctionLibrary_C
// 0x0120 (0x0150 - 0x0030)
class UGameplayPseudoFunctionLibrary_C final : public UObject_WithWorldContext
{
public:
	float                                         PlacementFloorCheckZExtentUp;                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlacementFloorCheckZExtent;                        // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_On_Same_Team_string;                // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Is_Must_Be_A_Creature_string;               // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_Pregnant_string;                    // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Not_Be_Pregnant_string;                // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_A_Structure_string;                 // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Is_Too_Far_Away_String;                     // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_Wild_String;                        // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_Baby_string;                        // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_Adult_string;                       // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_Female_String;                      // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_Alive_string;                       // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_Dead_string;                        // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Type_Must_Be_Match_string;                  // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Max_Allowed_Traces_For_Getting_Adjusted_Safe_Path; // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               teleport_line_trace_check_channel_for_tek_shield;  // 0x010C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Target_Must_Not_Be_On_Same_Team_string;            // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_Allied_Or_On_Same_Team_string;      // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_On_Another_Allied_Team_string;      // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Must_Be_On_Enemy_Team_string;               // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Align_World_Rotation_To_Ground_Normal(const struct FVector& Impact_Normal, const struct FRotator& Original_World_Rot, const struct FVector& ActorForwardVector, struct FRotator* World_Rot_Aligned_To_Ground_Normal);
	bool Are_Tribes_Allied(int32 TribeID1, int32 TribeID2);
	void Copied__Find_Vector_Intercept_Time(const struct FVector& Approacher_Velocity, const struct FVector& Intercept_Target_Relative_Position, const struct FVector& Intercept_Target_s_Velocity, double* Intercept_Time);
	void Copied_Clamp_Vector_Within_Angle(const struct FVector& Input_Angle, const struct FVector& Forward_Vector__Input_Clamped_Relative_To_This_, double Horizontal_Angle_Clamp, double _not_implemented__Vertical_Angle_Clamp, struct FVector* Clamped_Vector, bool* Was_Clamped_By_Horizontal_Restriction, bool* _not_implemented__Was_Clamped_By_Vertical_Restriction);
	void Copied_Find_Closest_Skin_Position_On_Creature(const struct FVector& Loc_To_Check_From, class APrimalCharacter* Character_Who_s_Skin_Point_We_re_Finding, bool* success, class FName* Found_Closest_Socket, struct FVector* world_loc);
	void Copied_Find_Path_To_Destination_WIth_Clearance_And_Adjust_Loc_To_Be_Above_Ground(class APrimalCharacter* Char, const struct FVector& Desired_Loc, const bool Debug, int32 Max_Possible_Number_of_Alternate_Paths_To_Check, const struct FVector& Adjustment_Per_Blocking_Trace, double Max_Allowed_Height_Over_Blockers, struct FVector* Adjusted_Move_Loc, uint8* Could_Fit_Result, TArray<struct FVector>* Finalized_Path);
	void Copied_Is_Target_Loc_Within_Angle_to_Forward(const struct FVector& Actor_loc, const struct FVector& target_pos, const struct FVector& Forward, double Angle, bool* Was_Within_Angle);
	void Copied_requires_enum_merge_Get_Adjusted_Safe_Loc_for_Setting_Actor_Location___From_Capsule_Bottom(class UObject* Char, const struct FVector& Desired_Loc, const bool Debug);
	void Create_Sorted_Path_Of_Actors_By_Distance(TArray<class AActor*>& ActorsArray, const struct FVector& OriginToDetectDistFrom, TArray<class AActor*>* SortedArray);
	void Create_Sorted_Path_Of_Actors_By_Distance_ButOnlyReachableByLaunching(const struct FVector& OriginToDetectDistFrom, TArray<class AActor*>& ActorsArray, double Gravity, TArray<double>& MaxLaunchSpeeds, TArray<class AActor*>* SortedArray, TArray<struct FVector>* LaunchDirections1);
	void DebugObstructedTraceResults(const struct FHitResult& Hit, bool Debug_Enabled, bool Forward, ECollisionChannel Channel);
	void DebugPrint(const class FString& Line_1, const class FString& Line_2, const class FString& Line_3, const class FString& Line_4, const class FString& Line_5, bool Debug);
	void Decrease_Float_Value_by_Item_Quality(double OriginalValue, double Quality, double InverseQualityMultiplier, double* ModifiedValue);
	struct FVector get_held_direction_relative_to_camera_forward(bool allow_omni_directional_movement, double Move_Forward, double Move_Right, const struct FVector& _Control_Direction);
	void Get_Player_Held_Direction_In_Worldspace(class APawn* Pawn, struct FVector* Worldspace_Vector);
	void Get_World_Rot_Aligned_To_Ground(const struct FVector& Original_World_Loc, const struct FRotator& Original_World_Rot, const struct FVector& ActorForwardVector, struct FRotator* World_Rotation_Aligned_To_Ground_Normal, struct FHitResult* TraceHitResult, bool* Trace1hit);
	void Increase_Float_Value_by_Item_Quality(double OriginalValue, double Quality, double InverseQualityMultiplier, double* ModifiedValue);
	void IsTargetValidToBeInteractedWith(class AActor* Target, bool MustBeOnSameTeam, int32 TargetingTeamToCheck, double RequiredDistance, const struct FVector& DistanceCheckLocationFrom, bool MustBeCreature, bool MustBeWildCreature, bool MustBePregnantCreature, bool MustBeNotPregnantCreature, bool MustBeBabyCreature, bool MustBeAdultCreature, bool MustBeStructure, bool MustBeFemale, bool MustBeMale, bool MustBeAlive, bool MustBeDead, TSoftClassPtr<class UClass> Must_Match_Specific_Class, TSoftClassPtr<class UClass> Must_Match_Specific_Dino_Entry_Class, class AActor* WhoamTarget, bool MustNotBeOnSameTeam, bool MustBeAlly__Includes_Teammates_, bool MustBeAlly__Excludes_Teammates_, bool MustBeOnEnemyTeam, bool* IsValidToBeInteractedWith, class FString* Fail_Reason_String);
	void IsThereANonObstructedTraceToTheLocation(const struct FVector& StartingLocation, const struct FVector& DesiredLocation, double TraceCapsuleRadius, double TraceCapsuleHalfHeight, const TArray<class AActor*>& IgnoreActors, bool Debug, float Debug_Trace_Duration, bool* ThereIsAPath, TArray<struct FVector>* PathPointsIncludingStartAndEnd);
	void IsThereANonObstructedTraceToTheLocation_ActualTrace(const struct FVector& StartingLocation, const struct FVector& DesiredLocation, double TraceCapsuleRadius, double TraceCapsuleHalfHeight, const TArray<class AActor*>& IgnoreActors, bool Debug, float Debug_Trace_Duration, ECollisionChannel Channel, bool* ThereIsAPath);
	void IsThereANonObstructedTraceToTheLocation_CheckVerticalVariations(const struct FVector& OriginalLocation, const struct FVector& StartingLocation, const struct FVector& DesiredLocation, double TraceCapsuleRadius, double TraceCapsuleHalfHeight, const TArray<class AActor*>& IgnoreActors, bool Debug, float Debug_Trace_Duration, bool* ThereIsAPath, TArray<struct FVector>* PathPointsIncludingStartAndEnd);
	void IsThereANonObstructedTraceToTheLocation_IsThereANonObstructedTraceToTheLocation_VariousChannels(const struct FVector& StartingLocation, const struct FVector& DesiredLocation, double TraceCapsuleRadius, double TraceCapsuleHalfHeight, const TArray<class AActor*>& IgnoreActors, bool Debug, float Debug_Trace_Duration, bool* ThereIsAPath);
	void Trace_Check_If_On_Ground(const struct FVector& trace_origin, struct FHitResult* OutHit, bool* Hit);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GameplayPseudoFunctionLibrary_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayPseudoFunctionLibrary_C")
	}
	static class UGameplayPseudoFunctionLibrary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayPseudoFunctionLibrary_C>();
	}
};
DUMPER7_ASSERTS_UGameplayPseudoFunctionLibrary_C;

}

