#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayCameras

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GameplayCameras_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// Class GameplayCameras.HasCameraBuildStatus
// 0x0000 (0x0000 - 0x0000)
class IHasCameraBuildStatus final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HasCameraBuildStatus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HasCameraBuildStatus")
	}
	static class IHasCameraBuildStatus* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHasCameraBuildStatus>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IHasCameraBuildStatus;

// Class GameplayCameras.CameraNode
// 0x0010 (0x0038 - 0x0028)
class UCameraNode : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsEnabled;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraNode")
	}
	static class UCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraNode>();
	}
};
DUMPER7_ASSERTS_UCameraNode;

// Class GameplayCameras.CombinedCameraRigsCameraNode
// 0x0010 (0x0048 - 0x0038)
class UCombinedCameraRigsCameraNode final : public UCameraNode
{
public:
	TArray<struct FCameraRigAssetReference>       CameraRigReferences;                               // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CombinedCameraRigsCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CombinedCameraRigsCameraNode")
	}
	static class UCombinedCameraRigsCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombinedCameraRigsCameraNode>();
	}
};
DUMPER7_ASSERTS_UCombinedCameraRigsCameraNode;

// Class GameplayCameras.Input1DCameraNode
// 0x0000 (0x0038 - 0x0038)
class UInput1DCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Input1DCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Input1DCameraNode")
	}
	static class UInput1DCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInput1DCameraNode>();
	}
};
DUMPER7_ASSERTS_UInput1DCameraNode;

// Class GameplayCameras.CameraRigInput1DSlot
// 0x0048 (0x0080 - 0x0038)
class UCameraRigInput1DSlot final : public UInput1DCameraNode
{
public:
	struct FCameraRigInputSlotParameters          InputSlotParameters;                               // 0x0038(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraParameterClamping               clamp;                                             // 0x0040(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterNormalization          Normalize;                                         // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EBuiltInDoubleCameraVariable                  BuiltInVariable;                                   // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDoubleCameraVariableReference         CustomVariable;                                    // 0x0070(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      TransientVariableID;                               // 0x0078(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCameraVariableID                      VariableID;                                        // 0x007C(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigInput1DSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigInput1DSlot")
	}
	static class UCameraRigInput1DSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigInput1DSlot>();
	}
};
DUMPER7_ASSERTS_UCameraRigInput1DSlot;

// Class GameplayCameras.Input2DCameraNode
// 0x0000 (0x0038 - 0x0038)
class UInput2DCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Input2DCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Input2DCameraNode")
	}
	static class UInput2DCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInput2DCameraNode>();
	}
};
DUMPER7_ASSERTS_UInput2DCameraNode;

// Class GameplayCameras.CameraRigInput2DSlot
// 0x0070 (0x00A8 - 0x0038)
class UCameraRigInput2DSlot : public UInput2DCameraNode
{
public:
	struct FCameraRigInputSlotParameters          InputSlotParameters;                               // 0x0038(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraParameterClamping               ClampX;                                            // 0x0040(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterClamping               ClampY;                                            // 0x0058(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterNormalization          NormalizeX;                                        // 0x0070(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameterNormalization          NormalizeY;                                        // 0x0080(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EBuiltInVector2dCameraVariable                BuiltInVariable;                                   // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2dCameraVariableReference       CustomVariable;                                    // 0x0098(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraVariableID                      TransientVariableID;                               // 0x00A0(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCameraVariableID                      VariableID;                                        // 0x00A4(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigInput2DSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigInput2DSlot")
	}
	static class UCameraRigInput2DSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigInput2DSlot>();
	}
};
DUMPER7_ASSERTS_UCameraRigInput2DSlot;

// Class GameplayCameras.CameraRigProxyAsset
// 0x0010 (0x0038 - 0x0028)
class UCameraRigProxyAsset final : public UObject
{
public:
	struct FGuid                                  Guid;                                              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigProxyAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigProxyAsset")
	}
	static class UCameraRigProxyAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigProxyAsset>();
	}
};
DUMPER7_ASSERTS_UCameraRigProxyAsset;

// Class GameplayCameras.CameraRigProxyTable
// 0x0010 (0x0038 - 0x0028)
class UCameraRigProxyTable final : public UObject
{
public:
	TArray<struct FCameraRigProxyTableEntry>      Entries;                                           // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigProxyTable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigProxyTable")
	}
	static class UCameraRigProxyTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigProxyTable>();
	}
};
DUMPER7_ASSERTS_UCameraRigProxyTable;

// Class GameplayCameras.GameplayCameraSystemHost
// 0x0010 (0x0038 - 0x0028)
class UGameplayCameraSystemHost final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCameraSystemHost")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCameraSystemHost")
	}
	static class UGameplayCameraSystemHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCameraSystemHost>();
	}
};
DUMPER7_ASSERTS_UGameplayCameraSystemHost;

// Class GameplayCameras.InputAxisBinding2DCameraNode
// 0x0048 (0x00F0 - 0x00A8)
class UInputAxisBinding2DCameraNode final : public UCameraRigInput2DSlot
{
public:
	TArray<class UInputAction*>                   AxisActions;                                       // 0x00A8(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FBooleanCameraParameter                RevertAxisX;                                       // 0x00B8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBooleanCameraParameter                RevertAxisY;                                       // 0x00C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2dCameraParameter               Multiplier;                                        // 0x00D8(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InputAxisBinding2DCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InputAxisBinding2DCameraNode")
	}
	static class UInputAxisBinding2DCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputAxisBinding2DCameraNode>();
	}
};
DUMPER7_ASSERTS_UInputAxisBinding2DCameraNode;

// Class GameplayCameras.ObjectTreeGraphObject
// 0x0000 (0x0000 - 0x0000)
class IObjectTreeGraphObject final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectTreeGraphObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectTreeGraphObject")
	}
	static class IObjectTreeGraphObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectTreeGraphObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IObjectTreeGraphObject;

// Class GameplayCameras.ObjectTreeGraphRootObject
// 0x0000 (0x0000 - 0x0000)
class IObjectTreeGraphRootObject final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ObjectTreeGraphRootObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectTreeGraphRootObject")
	}
	static class IObjectTreeGraphRootObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IObjectTreeGraphRootObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IObjectTreeGraphRootObject;

// Class GameplayCameras.BlendCameraNode
// 0x0000 (0x0038 - 0x0038)
class UBlendCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlendCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlendCameraNode")
	}
	static class UBlendCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendCameraNode>();
	}
};
DUMPER7_ASSERTS_UBlendCameraNode;

// Class GameplayCameras.BlendStackCameraNode
// 0x0008 (0x0040 - 0x0038)
class UBlendStackCameraNode final : public UCameraNode
{
public:
	ECameraBlendStackType                         BlendStackType;                                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlendStackCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlendStackCameraNode")
	}
	static class UBlendStackCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackCameraNode>();
	}
};
DUMPER7_ASSERTS_UBlendStackCameraNode;

// Class GameplayCameras.BlendStackRootCameraNode
// 0x0010 (0x0048 - 0x0038)
class UBlendStackRootCameraNode final : public UCameraNode
{
public:
	class UBlendCameraNode*                       Blend;                                             // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UCameraNode*                            RootNode;                                          // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlendStackRootCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlendStackRootCameraNode")
	}
	static class UBlendStackRootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendStackRootCameraNode>();
	}
};
DUMPER7_ASSERTS_UBlendStackRootCameraNode;

// Class GameplayCameras.CameraAsset
// 0x0060 (0x0088 - 0x0028)
class UCameraAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraDirector*                        CameraDirector;                                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UCameraRigAsset*>                CameraRigs;                                        // 0x0050(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UCameraRigTransition*>           EnterTransitions;                                  // 0x0060(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UCameraRigTransition*>           ExitTransitions;                                   // 0x0070(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	ECameraBuildStatus                            BuildStatus;                                       // 0x0080(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraAsset")
	}
	static class UCameraAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraAsset>();
	}
};
DUMPER7_ASSERTS_UCameraAsset;

// Class GameplayCameras.CameraDirector
// 0x0000 (0x0028 - 0x0028)
class UCameraDirector : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraDirector")
	}
	static class UCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraDirector>();
	}
};
DUMPER7_ASSERTS_UCameraDirector;

// Class GameplayCameras.CameraRigInterfaceParameter
// 0x0040 (0x0068 - 0x0028)
class UCameraRigInterfaceParameter final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraNode*                            Target;                                            // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class FName                                   TargetPropertyName;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InterfaceParameterName;                            // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraVariableAsset*                   PrivateVariable;                                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigInterfaceParameter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigInterfaceParameter")
	}
	static class UCameraRigInterfaceParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigInterfaceParameter>();
	}
};
DUMPER7_ASSERTS_UCameraRigInterfaceParameter;

// Class GameplayCameras.CameraRigAsset
// 0x00D0 (0x00F8 - 0x0028)
class UCameraRigAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraNode*                            RootNode;                                          // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0050(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FCameraRigInterface                    Interface;                                         // 0x0070(0x0020)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UCameraRigTransition*>           EnterTransitions;                                  // 0x0090(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<class UCameraRigTransition*>           ExitTransitions;                                   // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	ECameraRigInitialOrientation                  InitialOrientation;                                // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraRigAllocationInfo               AllocationInfo;                                    // 0x00B8(0x0028)(NativeAccessSpecifierPublic)
	ECameraBuildStatus                            BuildStatus;                                       // 0x00E0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigAsset")
	}
	static class UCameraRigAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigAsset>();
	}
};
DUMPER7_ASSERTS_UCameraRigAsset;

// Class GameplayCameras.CameraRigTransitionCondition
// 0x0008 (0x0030 - 0x0028)
class UCameraRigTransitionCondition : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigTransitionCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigTransitionCondition")
	}
	static class UCameraRigTransitionCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigTransitionCondition>();
	}
};
DUMPER7_ASSERTS_UCameraRigTransitionCondition;

// Class GameplayCameras.CameraRigTransition
// 0x0028 (0x0050 - 0x0028)
class UCameraRigTransition final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCameraRigTransitionCondition*>  Conditions;                                        // 0x0030(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UBlendCameraNode*                       Blend;                                             // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	ECameraRigInitialOrientation                  InitialOrientation;                                // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideInitialOrientation;                       // 0x004C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowCameraRigMerging;                            // 0x004D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigTransition")
	}
	static class UCameraRigTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigTransition>();
	}
};
DUMPER7_ASSERTS_UCameraRigTransition;

// Class GameplayCameras.CameraValueInterpolator
// 0x0000 (0x0028 - 0x0028)
class UCameraValueInterpolator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraValueInterpolator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraValueInterpolator")
	}
	static class UCameraValueInterpolator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraValueInterpolator>();
	}
};
DUMPER7_ASSERTS_UCameraValueInterpolator;

// Class GameplayCameras.PopValueInterpolator
// 0x0000 (0x0028 - 0x0028)
class UPopValueInterpolator final : public UCameraValueInterpolator
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PopValueInterpolator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PopValueInterpolator")
	}
	static class UPopValueInterpolator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPopValueInterpolator>();
	}
};
DUMPER7_ASSERTS_UPopValueInterpolator;

// Class GameplayCameras.CameraVariableAsset
// 0x0018 (0x0040 - 0x0028)
class UCameraVariableAsset : public UObject
{
public:
	bool                                          bAutoReset;                                        // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPrivate;                                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInput;                                          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraVariableAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraVariableAsset")
	}
	static class UCameraVariableAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraVariableAsset>();
	}
};
DUMPER7_ASSERTS_UCameraVariableAsset;

// Class GameplayCameras.BooleanCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UBooleanCameraVariable final : public UCameraVariableAsset
{
public:
	bool                                          bDefaultValue;                                     // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BooleanCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BooleanCameraVariable")
	}
	static class UBooleanCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBooleanCameraVariable>();
	}
};
DUMPER7_ASSERTS_UBooleanCameraVariable;

// Class GameplayCameras.Integer32CameraVariable
// 0x0008 (0x0048 - 0x0040)
class UInteger32CameraVariable final : public UCameraVariableAsset
{
public:
	int32                                         DefaultValue;                                      // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Integer32CameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Integer32CameraVariable")
	}
	static class UInteger32CameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteger32CameraVariable>();
	}
};
DUMPER7_ASSERTS_UInteger32CameraVariable;

// Class GameplayCameras.FloatCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UFloatCameraVariable final : public UCameraVariableAsset
{
public:
	float                                         DefaultValue;                                      // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FloatCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FloatCameraVariable")
	}
	static class UFloatCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatCameraVariable>();
	}
};
DUMPER7_ASSERTS_UFloatCameraVariable;

// Class GameplayCameras.DoubleCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UDoubleCameraVariable final : public UCameraVariableAsset
{
public:
	double                                        DefaultValue;                                      // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DoubleCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DoubleCameraVariable")
	}
	static class UDoubleCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDoubleCameraVariable>();
	}
};
DUMPER7_ASSERTS_UDoubleCameraVariable;

// Class GameplayCameras.Vector2fCameraVariable
// 0x0008 (0x0048 - 0x0040)
class UVector2fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector2f                              DefaultValue;                                      // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Vector2fCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Vector2fCameraVariable")
	}
	static class UVector2fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector2fCameraVariable>();
	}
};
DUMPER7_ASSERTS_UVector2fCameraVariable;

// Class GameplayCameras.Vector2dCameraVariable
// 0x0010 (0x0050 - 0x0040)
class UVector2dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector2D                              DefaultValue;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Vector2dCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Vector2dCameraVariable")
	}
	static class UVector2dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector2dCameraVariable>();
	}
};
DUMPER7_ASSERTS_UVector2dCameraVariable;

// Class GameplayCameras.Vector3fCameraVariable
// 0x0010 (0x0050 - 0x0040)
class UVector3fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector3f                              DefaultValue;                                      // 0x0040(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Vector3fCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Vector3fCameraVariable")
	}
	static class UVector3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector3fCameraVariable>();
	}
};
DUMPER7_ASSERTS_UVector3fCameraVariable;

// Class GameplayCameras.Vector3dCameraVariable
// 0x0018 (0x0058 - 0x0040)
class UVector3dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector3d                              DefaultValue;                                      // 0x0040(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Vector3dCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Vector3dCameraVariable")
	}
	static class UVector3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector3dCameraVariable>();
	}
};
DUMPER7_ASSERTS_UVector3dCameraVariable;

// Class GameplayCameras.Vector4fCameraVariable
// 0x0010 (0x0050 - 0x0040)
class UVector4fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector4f                              DefaultValue;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Vector4fCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Vector4fCameraVariable")
	}
	static class UVector4fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector4fCameraVariable>();
	}
};
DUMPER7_ASSERTS_UVector4fCameraVariable;

// Class GameplayCameras.Vector4dCameraVariable
// 0x0020 (0x0060 - 0x0040)
class UVector4dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FVector4d                              DefaultValue;                                      // 0x0040(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Vector4dCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Vector4dCameraVariable")
	}
	static class UVector4dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVector4dCameraVariable>();
	}
};
DUMPER7_ASSERTS_UVector4dCameraVariable;

// Class GameplayCameras.Rotator3fCameraVariable
// 0x0010 (0x0050 - 0x0040)
class URotator3fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FRotator3f                             DefaultValue;                                      // 0x0040(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Rotator3fCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Rotator3fCameraVariable")
	}
	static class URotator3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<URotator3fCameraVariable>();
	}
};
DUMPER7_ASSERTS_URotator3fCameraVariable;

// Class GameplayCameras.Rotator3dCameraVariable
// 0x0018 (0x0058 - 0x0040)
class URotator3dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FRotator3d                             DefaultValue;                                      // 0x0040(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Rotator3dCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Rotator3dCameraVariable")
	}
	static class URotator3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<URotator3dCameraVariable>();
	}
};
DUMPER7_ASSERTS_URotator3dCameraVariable;

// Class GameplayCameras.Transform3fCameraVariable
// 0x0030 (0x0070 - 0x0040)
class UTransform3fCameraVariable final : public UCameraVariableAsset
{
public:
	struct FTransform3f                           DefaultValue;                                      // 0x0040(0x0030)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Transform3fCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Transform3fCameraVariable")
	}
	static class UTransform3fCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransform3fCameraVariable>();
	}
};
DUMPER7_ASSERTS_UTransform3fCameraVariable;

// Class GameplayCameras.Transform3dCameraVariable
// 0x0060 (0x00A0 - 0x0040)
class UTransform3dCameraVariable final : public UCameraVariableAsset
{
public:
	struct FTransform3d                           DefaultValue;                                      // 0x0040(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Transform3dCameraVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Transform3dCameraVariable")
	}
	static class UTransform3dCameraVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransform3dCameraVariable>();
	}
};
DUMPER7_ASSERTS_UTransform3dCameraVariable;

// Class GameplayCameras.CameraVariableCollection
// 0x0010 (0x0038 - 0x0028)
class UCameraVariableCollection final : public UObject
{
public:
	TArray<class UCameraVariableAsset*>           Variables;                                         // 0x0028(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraVariableCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraVariableCollection")
	}
	static class UCameraVariableCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraVariableCollection>();
	}
};
DUMPER7_ASSERTS_UCameraVariableCollection;

// Class GameplayCameras.RootCameraNode
// 0x0000 (0x0038 - 0x0038)
class URootCameraNode : public UCameraNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RootCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RootCameraNode")
	}
	static class URootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootCameraNode>();
	}
};
DUMPER7_ASSERTS_URootCameraNode;

// Class GameplayCameras.DefaultRootCameraNode
// 0x0020 (0x0058 - 0x0038)
class UDefaultRootCameraNode final : public URootCameraNode
{
public:
	class UBlendStackCameraNode*                  BaseLayer;                                         // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UBlendStackCameraNode*                  MainLayer;                                         // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UBlendStackCameraNode*                  GlobalLayer;                                       // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UBlendStackCameraNode*                  VisualLayer;                                       // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DefaultRootCameraNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefaultRootCameraNode")
	}
	static class UDefaultRootCameraNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultRootCameraNode>();
	}
};
DUMPER7_ASSERTS_UDefaultRootCameraNode;

// Class GameplayCameras.BlueprintCameraDirectorEvaluator
// 0x0060 (0x0088 - 0x0028)
class UBlueprintCameraDirectorEvaluator final : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateCameraDirector(const struct FBlueprintCameraDirectorActivateParams& Params_0);
	void ActivateCameraRig(class UCameraRigAsset* CameraRig);
	void ActivateCameraRigPrefab(class UCameraRigAsset* CameraRig);
	void ActivateCameraRigViaProxy(class UCameraRigProxyAsset* CameraRigProxy);
	void ActivatePersistentBaseCameraRig(class UCameraRigAsset* CameraRigPrefab);
	void ActivatePersistentGlobalCameraRig(class UCameraRigAsset* CameraRigPrefab);
	void ActivatePersistentVisualCameraRig(class UCameraRigAsset* CameraRigPrefab);
	void DeactivateCameraDirector(const struct FBlueprintCameraDirectorDeactivateParams& Params_0);
	void DeactivatePersistentBaseCameraRig(class UCameraRigAsset* CameraRigPrefab);
	void DeactivatePersistentGlobalCameraRig(class UCameraRigAsset* CameraRigPrefab);
	void DeactivatePersistentVisualCameraRig(class UCameraRigAsset* CameraRigPrefab);
	void RunCameraDirector(const struct FBlueprintCameraDirectorEvaluationParams& Params_0);
	void SetInitialContextCameraPose(const struct FBlueprintCameraPose& InCameraPose);

	class AActor* FindEvaluationContextOwnerActor(TSubclassOf<class AActor> ActorClass) const;
	class UCameraRigAsset* GetCameraRig(class UCameraRigAsset* CameraRig) const;
	struct FBlueprintCameraPose GetInitialContextCameraPose() const;
	struct FBlueprintCameraVariableTable GetInitialContextVariableTable() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlueprintCameraDirectorEvaluator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlueprintCameraDirectorEvaluator")
	}
	static class UBlueprintCameraDirectorEvaluator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraDirectorEvaluator>();
	}
};
DUMPER7_ASSERTS_UBlueprintCameraDirectorEvaluator;

// Class GameplayCameras.BlueprintCameraDirector
// 0x0010 (0x0038 - 0x0028)
class UBlueprintCameraDirector final : public UCameraDirector
{
public:
	TSubclassOf<class UBlueprintCameraDirectorEvaluator> CameraDirectorEvaluatorClass;               // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraRigProxyTable*                   CameraRigProxyTable;                               // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlueprintCameraDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlueprintCameraDirector")
	}
	static class UBlueprintCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraDirector>();
	}
};
DUMPER7_ASSERTS_UBlueprintCameraDirector;

// Class GameplayCameras.CameraDirectorStateTreeSchema
// 0x0010 (0x0038 - 0x0028)
class UCameraDirectorStateTreeSchema final : public UStateTreeSchema
{
public:
	TArray<struct FStateTreeExternalDataDesc>     ContextDataDescs;                                  // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraDirectorStateTreeSchema")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraDirectorStateTreeSchema")
	}
	static class UCameraDirectorStateTreeSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraDirectorStateTreeSchema>();
	}
};
DUMPER7_ASSERTS_UCameraDirectorStateTreeSchema;

// Class GameplayCameras.PriorityQueueCameraDirector
// 0x0000 (0x0028 - 0x0028)
class UPriorityQueueCameraDirector final : public UCameraDirector
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PriorityQueueCameraDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PriorityQueueCameraDirector")
	}
	static class UPriorityQueueCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPriorityQueueCameraDirector>();
	}
};
DUMPER7_ASSERTS_UPriorityQueueCameraDirector;

// Class GameplayCameras.SingleCameraDirector
// 0x0008 (0x0030 - 0x0028)
class USingleCameraDirector final : public UCameraDirector
{
public:
	class UCameraRigAsset*                        CameraRig;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SingleCameraDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SingleCameraDirector")
	}
	static class USingleCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingleCameraDirector>();
	}
};
DUMPER7_ASSERTS_USingleCameraDirector;

// Class GameplayCameras.StateTreeCameraDirector
// 0x0030 (0x0058 - 0x0028)
class UStateTreeCameraDirector final : public UCameraDirector
{
public:
	struct FStateTreeReference                    StateTreeReference;                                // 0x0028(0x0028)(Edit, NativeAccessSpecifierPublic)
	class UCameraRigProxyTable*                   CameraRigProxyTable;                               // 0x0050(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StateTreeCameraDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StateTreeCameraDirector")
	}
	static class UStateTreeCameraDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateTreeCameraDirector>();
	}
};
DUMPER7_ASSERTS_UStateTreeCameraDirector;

// Class GameplayCameras.ActivateCameraRigFunctions
// 0x0000 (0x0028 - 0x0028)
class UActivateCameraRigFunctions final : public UBlueprintFunctionLibrary
{
public:
	static void ActivatePersistentBaseCameraRig(class UObject* WorldContextObject, class APlayerController* PlayerController, class UCameraRigAsset* CameraRig);
	static void ActivatePersistentGlobalCameraRig(class UObject* WorldContextObject, class APlayerController* PlayerController, class UCameraRigAsset* CameraRig);
	static void ActivatePersistentVisualCameraRig(class UObject* WorldContextObject, class APlayerController* PlayerController, class UCameraRigAsset* CameraRig);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActivateCameraRigFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivateCameraRigFunctions")
	}
	static class UActivateCameraRigFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateCameraRigFunctions>();
	}
};
DUMPER7_ASSERTS_UActivateCameraRigFunctions;

// Class GameplayCameras.BlueprintCameraPoseFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintCameraPoseFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FVector GetAimDir(const struct FBlueprintCameraPose& CameraPose);
	static struct FRay GetAimRay(const struct FBlueprintCameraPose& CameraPose);
	static double GetEffectiveFieldOfView(const struct FBlueprintCameraPose& CameraPose);
	static double GetFieldOfView(const struct FBlueprintCameraPose& CameraPose);
	static double GetFocalLength(const struct FBlueprintCameraPose& CameraPose);
	static struct FVector GetLocation(const struct FBlueprintCameraPose& CameraPose);
	static struct FRotator GetRotation(const struct FBlueprintCameraPose& CameraPose);
	static double GetSensorAspectRatio(const struct FBlueprintCameraPose& CameraPose);
	static struct FVector GetTarget(const struct FBlueprintCameraPose& CameraPose);
	static struct FVector GetTargetAtDistance(const struct FBlueprintCameraPose& CameraPose, double TargetDistance);
	static double GetTargetDistance(const struct FBlueprintCameraPose& CameraPose);
	static struct FTransform GetTransform(const struct FBlueprintCameraPose& CameraPose);
	static struct FBlueprintCameraPose MakeCameraPoseFromCameraComponent(const class UCameraComponent* CameraComponent);
	static struct FBlueprintCameraPose MakeCameraPoseFromCineCameraComponent(const class UCineCameraComponent* CameraComponent);
	static struct FBlueprintCameraPose SetFieldOfView(const struct FBlueprintCameraPose& CameraPose, float FieldOfView);
	static struct FBlueprintCameraPose SetFocalLength(const struct FBlueprintCameraPose& CameraPose, float FocalLength);
	static struct FBlueprintCameraPose SetLocation(const struct FBlueprintCameraPose& CameraPose, const struct FVector& Location);
	static struct FBlueprintCameraPose SetRotation(const struct FBlueprintCameraPose& CameraPose, const struct FRotator& Rotation);
	static struct FBlueprintCameraPose SetTargetDistance(const struct FBlueprintCameraPose& CameraPose, double TargetDistance);
	static struct FBlueprintCameraPose SetTransform(const struct FBlueprintCameraPose& CameraPose, const struct FTransform& Transform);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlueprintCameraPoseFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlueprintCameraPoseFunctionLibrary")
	}
	static class UBlueprintCameraPoseFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraPoseFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UBlueprintCameraPoseFunctionLibrary;

// Class GameplayCameras.BlueprintCameraVariableTableFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintCameraVariableTableFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetBooleanCameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UBooleanCameraVariable* Variable);
	static double GetDoubleCameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UDoubleCameraVariable* Variable);
	static float GetFloatCameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UFloatCameraVariable* Variable);
	static int32 GetInteger32CameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UInteger32CameraVariable* Variable);
	static struct FRotator GetRotatorCameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class URotator3dCameraVariable* Variable);
	static struct FTransform GetTransformCameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UTransform3dCameraVariable* Variable);
	static struct FVector2D GetVector2CameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UVector2dCameraVariable* Variable);
	static struct FVector GetVector3CameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UVector3dCameraVariable* Variable);
	static struct FVector4 GetVector4CameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UVector4dCameraVariable* Variable);
	static void SetBooleanCameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UBooleanCameraVariable* Variable, bool Value);
	static void SetDoubleCameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UDoubleCameraVariable* Variable, double Value);
	static void SetFloatCameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UFloatCameraVariable* Variable, float Value);
	static void SetInteger32CameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UInteger32CameraVariable* Variable, int32 Value);
	static void SetRotatorCameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class URotator3dCameraVariable* Variable, const struct FRotator& Value);
	static void SetTransformCameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UTransform3dCameraVariable* Variable, const struct FTransform& Value);
	static void SetVector2CameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UVector2dCameraVariable* Variable, const struct FVector2D& Value);
	static void SetVector3CameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UVector3dCameraVariable* Variable, const struct FVector& Value);
	static void SetVector4CameraVariable(const struct FBlueprintCameraVariableTable& VariableTable, class UVector4dCameraVariable* Variable, const struct FVector4& Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlueprintCameraVariableTableFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlueprintCameraVariableTableFunctionLibrary")
	}
	static class UBlueprintCameraVariableTableFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintCameraVariableTableFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UBlueprintCameraVariableTableFunctionLibrary;

// Class GameplayCameras.CameraRigParameterInterop
// 0x0000 (0x0028 - 0x0028)
class UCameraRigParameterInterop final : public UBlueprintFunctionLibrary
{
public:
	static void SetBooleanParameter(struct FBlueprintCameraVariableTable& VariableTable, class UCameraRigAsset* CameraRig, const class FString& ParameterName, bool bParameterValue);
	static void SetDoubleParameter(struct FBlueprintCameraVariableTable& VariableTable, class UCameraRigAsset* CameraRig, const class FString& ParameterName, double ParameterValue);
	static void SetFloatParameter(struct FBlueprintCameraVariableTable& VariableTable, class UCameraRigAsset* CameraRig, const class FString& ParameterName, double ParameterValue);
	static void SetIntegerParameter(struct FBlueprintCameraVariableTable& VariableTable, class UCameraRigAsset* CameraRig, const class FString& ParameterName, int32 ParameterValue);
	static void SetRotatorParameter(struct FBlueprintCameraVariableTable& VariableTable, class UCameraRigAsset* CameraRig, const class FString& ParameterName, const struct FRotator& ParameterValue);
	static void SetTransformParameter(struct FBlueprintCameraVariableTable& VariableTable, class UCameraRigAsset* CameraRig, const class FString& ParameterName, const struct FTransform& ParameterValue);
	static void SetVector2Parameter(struct FBlueprintCameraVariableTable& VariableTable, class UCameraRigAsset* CameraRig, const class FString& ParameterName, const struct FVector2D& ParameterValue);
	static void SetVector3Parameter(struct FBlueprintCameraVariableTable& VariableTable, class UCameraRigAsset* CameraRig, const class FString& ParameterName, const struct FVector& ParameterValue);
	static void SetVector4Parameter(struct FBlueprintCameraVariableTable& VariableTable, class UCameraRigAsset* CameraRig, const class FString& ParameterName, const struct FVector4& ParameterValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CameraRigParameterInterop")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraRigParameterInterop")
	}
	static class UCameraRigParameterInterop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraRigParameterInterop>();
	}
};
DUMPER7_ASSERTS_UCameraRigParameterInterop;

// Class GameplayCameras.ControllerGameplayCameraEvaluationComponent
// 0x0028 (0x00E0 - 0x00B8)
class UControllerGameplayCameraEvaluationComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x20];                                      // 0x00B8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayCameraSystemHost*              CameraSystemHost;                                  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ControllerGameplayCameraEvaluationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ControllerGameplayCameraEvaluationComponent")
	}
	static class UControllerGameplayCameraEvaluationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControllerGameplayCameraEvaluationComponent>();
	}
};
DUMPER7_ASSERTS_UControllerGameplayCameraEvaluationComponent;

// Class GameplayCameras.GameplayCameraActor
// 0x0008 (0x0488 - 0x0480)
class AGameplayCameraActor final : public AActor
{
public:
	class UGameplayCameraComponent*               CameraComponent;                                   // 0x0480(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	class UGameplayCameraComponent* GetCameraComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCameraActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCameraActor")
	}
	static class AGameplayCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayCameraActor>();
	}
};
DUMPER7_ASSERTS_AGameplayCameraActor;

// Class GameplayCameras.GameplayCameraComponent
// 0x0030 (0x0290 - 0x0260)
class UGameplayCameraComponent final : public USceneComponent
{
public:
	class UCameraAsset*                           Camera;                                            // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	EAutoReceiveInput                             AutoActivateForPlayer;                             // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_261[0x1F];                                     // 0x0261(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayCameraSystemHost*              CameraSystemHost;                                  // 0x0280(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateCameraForPlayerController(class APlayerController* PlayerController);
	void ActivateCameraForPlayerIndex(int32 PlayerIndex);
	void DeactivateCamera();
	void SetInitialPose(const struct FBlueprintCameraPose& CameraPose);

	struct FBlueprintCameraPose GetInitialPose() const;
	struct FBlueprintCameraVariableTable GetInitialVariableTable() const;

public:
	static class UClass* StaticClass()
	{
