#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryScriptingCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"


namespace SDK::Params
{

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.ApproximateConvexHullsWithSimplerCollisionShapes
// 0x0098 (0x0098 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_ApproximateConvexHullsWithSimplerCollisionShapes final
{
public:
	struct FGeometryScriptSimpleCollision         SimpleCollision;                                   // 0x0000(0x0080)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptConvexHullApproximationOptions ApproximateOptions;                         // 0x0080(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bHasApproximated;                                  // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0090(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_ApproximateConvexHullsWithSimplerCollisionShapes;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.CombineSimpleCollision
// 0x0108 (0x0108 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_CombineSimpleCollision final
{
public:
	struct FGeometryScriptSimpleCollision         CollisionToUpdate;                                 // 0x0000(0x0080)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptSimpleCollision         AppendCollision;                                   // 0x0080(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0100(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_CombineSimpleCollision;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.CombineSimpleCollisionArray
// 0x0098 (0x0098 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_CombineSimpleCollisionArray final
{
public:
	TArray<struct FGeometryScriptSimpleCollision> SimpleCollisionArray;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptSimpleCollision         SimpleCollision;                                   // 0x0010(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0090(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_CombineSimpleCollisionArray;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.ComputeNavigableConvexDecomposition
// 0x00C8 (0x00C8 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_ComputeNavigableConvexDecomposition final
{
public:
	const class UDynamicMesh*                     TargetMesh;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNavigableConvexDecompositionOptions   Options;                                           // 0x0008(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSimpleCollision         ReturnValue;                                       // 0x0048(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_ComputeNavigableConvexDecomposition;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.ComputeNegativeSpace
// 0x0060 (0x0060 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_ComputeNegativeSpace final
{
public:
	struct FGeometryScriptDynamicMeshBVH          MeshBVH;                                           // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FComputeNegativeSpaceOptions           NegativeSpaceOptions;                              // 0x0020(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSphereCovering          ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_ComputeNegativeSpace;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.Conv_GeometryScriptSphereCoveringToSphereArray
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_Conv_GeometryScriptSphereCoveringToSphereArray final
{
public:
	struct FGeometryScriptSphereCovering          SphereCovering;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FSphere>                        ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_Conv_GeometryScriptSphereCoveringToSphereArray;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.Conv_SphereArrayToGeometryScriptSphereCovering
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_Conv_SphereArrayToGeometryScriptSphereCovering final
{
public:
	TArray<struct FSphere>                        Spheres;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptSphereCovering          ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_Conv_SphereArrayToGeometryScriptSphereCovering;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.GenerateCollisionFromMesh
// 0x00C0 (0x00C0 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_GenerateCollisionFromMesh final
{
public:
	class UDynamicMesh*                           FromDynamicMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptCollisionFromMeshOptions Options;                                          // 0x0008(0x0030)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0038(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSimpleCollision         ReturnValue;                                       // 0x0040(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_GenerateCollisionFromMesh;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.GetSimpleCollisionFromComponent
// 0x0090 (0x0090 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_GetSimpleCollisionFromComponent final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSimpleCollision         ReturnValue;                                       // 0x0010(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_GetSimpleCollisionFromComponent;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.GetSimpleCollisionFromStaticMesh
// 0x0090 (0x0090 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_GetSimpleCollisionFromStaticMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSimpleCollision         ReturnValue;                                       // 0x0010(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_GetSimpleCollisionFromStaticMesh;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.GetSimpleCollisionShapeCount
// 0x0088 (0x0088 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_GetSimpleCollisionShapeCount final
{
public:
	struct FGeometryScriptSimpleCollision         SimpleCollision;                                   // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0080(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_GetSimpleCollisionShapeCount;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.MergeSimpleCollisionShapes
// 0x0180 (0x0180 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_MergeSimpleCollisionShapes final
{
public:
	struct FGeometryScriptSimpleCollision         SimpleCollision;                                   // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptMergeSimpleCollisionOptions MergeOptions;                                  // 0x0080(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bHasMerged;                                        // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x00F8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSimpleCollision         ReturnValue;                                       // 0x0100(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_MergeSimpleCollisionShapes;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.ResetDynamicMeshCollision
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision final
{
public:
	class UDynamicMeshComponent*                  Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEmitTransaction;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.ResetSimpleCollision
// 0x0080 (0x0080 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_ResetSimpleCollision final
{
public:
	struct FGeometryScriptSimpleCollision         SimpleCollision;                                   // 0x0000(0x0080)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_ResetSimpleCollision;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.SetDynamicMeshCollisionFromMesh
// 0x0050 (0x0050 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh final
{
public:
	class UDynamicMesh*                           FromDynamicMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMeshComponent*                  ToDynamicMeshComponent;                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptCollisionFromMeshOptions Options;                                          // 0x0010(0x0030)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.SetSimpleCollisionOfDynamicMeshComponent
// 0x0098 (0x0098 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_SetSimpleCollisionOfDynamicMeshComponent final
{
public:
	struct FGeometryScriptSimpleCollision         SimpleCollision;                                   // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UDynamicMeshComponent*                  DynamicMeshComponent;                              // 0x0080(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSetSimpleCollisionOptions Options;                                         // 0x0088(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0090(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_SetSimpleCollisionOfDynamicMeshComponent;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.SetSimpleCollisionOfStaticMesh
// 0x0098 (0x0098 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_SetSimpleCollisionOfStaticMesh final
{
public:
	struct FGeometryScriptSimpleCollision         SimpleCollision;                                   // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0080(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSetSimpleCollisionOptions Options;                                         // 0x0088(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGeometryScriptSetStaticMeshCollisionOptions StaticMeshCollisionOptions;                  // 0x0089(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0090(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_SetSimpleCollisionOfStaticMesh;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.SetStaticMeshCollisionFromComponent
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent final
{
public:
	class UStaticMesh*                            StaticMeshAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    SourceComponent;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSetSimpleCollisionOptions Options;                                         // 0x0010(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGeometryScriptSetStaticMeshCollisionOptions StaticMeshCollisionOptions;                  // 0x0011(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.SetStaticMeshCollisionFromMesh
// 0x0058 (0x0058 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh final
{
public:
	class UDynamicMesh*                           FromDynamicMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            ToStaticMeshAsset;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptCollisionFromMeshOptions Options;                                          // 0x0010(0x0030)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGeometryScriptSetStaticMeshCollisionOptions StaticMeshCollisionOptions;                  // 0x0040(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.SetStaticMeshCustomComplexCollision
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCustomComplexCollision final
{
public:
	class UStaticMesh*                            StaticMeshAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMeshCollisionAsset;                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEmitTransaction;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMarkCollisionAsCustomized;                        // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCustomComplexCollision;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.SimplifyConvexHulls
// 0x00A0 (0x00A0 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_SimplifyConvexHulls final
{
public:
	struct FGeometryScriptSimpleCollision         SimpleCollision;                                   // 0x0000(0x0080)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptConvexHullSimplificationOptions SimplifyOptions;                           // 0x0080(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bHasSimplified;                                    // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0098(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_SimplifyConvexHulls;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.StaticMeshHasCustomizedCollision
// 0x0010 (0x0010 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_StaticMeshHasCustomizedCollision final
{
public:
	class UStaticMesh*                            StaticMeshAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_StaticMeshHasCustomizedCollision;

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.TransformSimpleCollisionShapes
// 0x0170 (0x0170 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_TransformSimpleCollisionShapes final
{
public:
	struct FGeometryScriptSimpleCollision         SimpleCollision;                                   // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0080(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptTransformCollisionOptions TransformOptions;                                // 0x00E0(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x00E2(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x00E8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSimpleCollision         ReturnValue;                                       // 0x00F0(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_CollisionFunctions_TransformSimpleCollisionShapes;

// Function GeometryScriptingCore.GeometryScriptLibrary_ContainmentFunctions.ComputeMeshConvexDecomposition
// 0x0050 (0x0050 - 0x0000)
struct GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexDecomposition final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           CopyToMesh;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           CopyToMeshOut;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptConvexDecompositionOptions Options;                                        // 0x0018(0x0028)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexDecomposition;

// Function GeometryScriptingCore.GeometryScriptLibrary_ContainmentFunctions.ComputeMeshConvexHull
// 0x0048 (0x0048 - 0x0000)
struct GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           CopyToMesh;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           CopyToMeshOut;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptMeshSelection           Selection;                                         // 0x0018(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGeometryScriptConvexHullOptions       Options;                                           // 0x0028(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0038(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull;

// Function GeometryScriptingCore.GeometryScriptLibrary_ContainmentFunctions.ComputeMeshSweptHull
// 0x00B0 (0x00B0 - 0x0000)
struct GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           CopyToMesh;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           CopyToMeshOut;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ProjectionFrame;                                   // 0x0020(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSweptHullOptions        Options;                                           // 0x0080(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0098(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ClearColorList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ClearColorList final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLinearColor                           ClearColor;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ClearColorList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ClearIndexList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ClearIndexList final
{
public:
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ClearValue;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ClearIndexList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ClearScalarList
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ClearScalarList final
{
public:
	struct FGeometryScriptScalarList              ScalarList;                                        // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	double                                        ClearValue;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ClearScalarList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ClearUVList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ClearUVList final
{
public:
	struct FGeometryScriptUVList                  UVList;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector2D                              ClearUV;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ClearUVList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ClearVectorList
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ClearVectorList final
{
public:
	struct FGeometryScriptVectorList              VectorList;                                        // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                ClearValue;                                        // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ClearVectorList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertArrayToColorList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToColorList final
{
public:
	TArray<struct FLinearColor>                   ColorArray;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptColorList               ColorList;                                         // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToColorList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertArrayToIndexList
// 0x0030 (0x0030 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList final
{
public:
	TArray<int32>                                 IndexArray;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0010(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	EGeometryScriptIndexType                      IndexType;                                         // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertArrayToScalarList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToScalarList final
{
public:
	TArray<double>                                VectorArray;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptScalarList              ScalarList;                                        // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToScalarList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertArrayToTriangleList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToTriangleList final
{
public:
	TArray<struct FIntVector>                     TriangleArray;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptTriangleList            TriangleList;                                      // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToTriangleList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertArrayToUVList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToUVList final
{
public:
	TArray<struct FVector2D>                      UVArray;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptUVList                  UVList;                                            // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToUVList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertArrayToVectorList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToVectorList final
{
public:
	TArray<struct FVector>                        VectorArray;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptVectorList              VectorList;                                        // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToVectorList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertColorListToArray
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertColorListToArray final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   ColorArray;                                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertColorListToArray;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertIndexListToArray
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertIndexListToArray final
{
public:
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TArray<int32>                                 IndexArray;                                        // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertIndexListToArray;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertScalarListToArray
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertScalarListToArray final
{
public:
	struct FGeometryScriptScalarList              ScalarList;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	TArray<double>                                ScalarArray;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertScalarListToArray;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertTriangleListToArray
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertTriangleListToArray final
{
public:
	struct FGeometryScriptTriangleList            TriangleList;                                      // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FIntVector>                     TriangleArray;                                     // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertTriangleListToArray;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertUVListToArray
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertUVListToArray final
{
public:
	struct FGeometryScriptUVList                  UVList;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UVArray;                                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertUVListToArray;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertVectorListToArray
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertVectorListToArray final
{
public:
	struct FGeometryScriptVectorList              VectorList;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        VectorArray;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ConvertVectorListToArray;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.DuplicateColorList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_DuplicateColorList final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGeometryScriptColorList               DuplicateList;                                     // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_DuplicateColorList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.DuplicateIndexList
// 0x0030 (0x0030 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_DuplicateIndexList final
{
public:
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FGeometryScriptIndexList               DuplicateList;                                     // 0x0018(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_DuplicateIndexList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.DuplicateScalarList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_DuplicateScalarList final
{
public:
	struct FGeometryScriptScalarList              ScalarList;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGeometryScriptScalarList              DuplicateList;                                     // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_DuplicateScalarList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.DuplicateUVList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_DuplicateUVList final
{
public:
	struct FGeometryScriptUVList                  UVList;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGeometryScriptUVList                  DuplicateList;                                     // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_DuplicateUVList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.DuplicateVectorList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_DuplicateVectorList final
{
public:
	struct FGeometryScriptVectorList              VectorList;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGeometryScriptVectorList              DuplicateList;                                     // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_DuplicateVectorList;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ExtractColorListChannel
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ExtractColorListChannel final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGeometryScriptScalarList              ScalarList;                                        // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         ChannelIndex;                                      // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ExtractColorListChannel;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ExtractColorListChannels
// 0x0030 (0x0030 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ExtractColorListChannels final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGeometryScriptVectorList              VectorList;                                        // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         XChannelIndex;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         YChannelIndex;                                     // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ZChannelIndex;                                     // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_ExtractColorListChannels;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetColorListItem
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidIndex;                                     // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetColorListLastIndex
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetColorListLastIndex final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_GetColorListLastIndex;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetColorListLength
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetColorListLength final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_GetColorListLength;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetIndexListItem
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem final
{
public:
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidIndex;                                     // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetIndexListLastIndex
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLastIndex final
{
public:
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLastIndex;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetIndexListLength
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLength final
{
public:
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLength;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetScalarListItem
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetScalarListItem final
{
public:
	struct FGeometryScriptScalarList              ScalarList;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidIndex;                                     // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_GetScalarListItem;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetScalarListLastIndex
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetScalarListLastIndex final
{
public:
	struct FGeometryScriptScalarList              ScalarList;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_GetScalarListLastIndex;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetScalarListLength
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetScalarListLength final
{
public:
	struct FGeometryScriptScalarList              ScalarList;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryScriptLibrary_ListUtilityFunctions_GetScalarListLength;

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetTriangleListItem
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem final
{
public:
	struct FGeometryScriptTriangleList            TriangleList;                                      // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         Triangle;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidTriangle;                                  // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
