#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryCollectionEngine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Chaos_structs.hpp"
#include "GeometryCollectionEngine_structs.hpp"
#include "ChaosSolverEngine_structs.hpp"


namespace SDK::Params
{

// Function GeometryCollectionEngine.GeometryCollectionBlueprintLibrary.SetCustomInstanceDataByIndex
// 0x0010 (0x0010 - 0x0000)
struct GeometryCollectionBlueprintLibrary_SetCustomInstanceDataByIndex final
{
public:
	class UGeometryCollectionComponent*           GeometryCollectionComponent;                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomDataIndex;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomDataValue;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionBlueprintLibrary_SetCustomInstanceDataByIndex;

// Function GeometryCollectionEngine.GeometryCollectionBlueprintLibrary.SetCustomInstanceDataByName
// 0x0018 (0x0018 - 0x0000)
struct GeometryCollectionBlueprintLibrary_SetCustomInstanceDataByName final
{
public:
	class UGeometryCollectionComponent*           GeometryCollectionComponent;                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CustomDataName;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomDataValue;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryCollectionBlueprintLibrary_SetCustomInstanceDataByName;

// Function GeometryCollectionEngine.GeometryCollectionBlueprintLibrary.SetISMPoolCustomInstanceData
// 0x0010 (0x0010 - 0x0000)
struct GeometryCollectionBlueprintLibrary_SetISMPoolCustomInstanceData final
{
public:
	class UGeometryCollectionComponent*           GeometryCollectionComponent;                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomDataIndex;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomDataValue;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionBlueprintLibrary_SetISMPoolCustomInstanceData;

// Function GeometryCollectionEngine.GeometryCollectionISMPoolSubSystem.OnActorEndPlay
// 0x0010 (0x0010 - 0x0000)
struct GeometryCollectionISMPoolSubSystem_OnActorEndPlay final
{
public:
	class AActor*                                 InSource;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                Reason;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryCollectionISMPoolSubSystem_OnActorEndPlay;

// Function GeometryCollectionEngine.PrimalDestructibleActor.BPStartDestruction
// 0x0028 (0x0028 - 0x0000)
struct PrimalDestructibleActor_BPStartDestruction final
{
public:
	class UGeometryCollection*                    destructionAsset;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitDirection;                                      // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalHealth;                                       // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrimalDestructibleActor_BPStartDestruction;

// Function GeometryCollectionEngine.PrimalDestructibleActor.SetGeoCollection
// 0x0008 (0x0008 - 0x0000)
struct PrimalDestructibleActor_SetGeoCollection final
{
public:
	class UGeometryCollection*                    GeoCollection;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrimalDestructibleActor_SetGeoCollection;

// Function GeometryCollectionEngine.PrimalDestructibleActor.StaticBPPreDestructionHandleAttachedComponentClass
// 0x0068 (0x0068 - 0x0000)
struct PrimalDestructibleActor_StaticBPPreDestructionHandleAttachedComponentClass final
{
public:
	TSubclassOf<class UActorComponent>            AttachedComponentClass;                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInstancedStaticMeshComponent*          ForMeshComp;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InstancePosition;                                  // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InstanceRotation;                                  // 0x0028(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         InstanceIndex;                                     // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitDirection;                                      // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalHealth;                                       // 0x0064(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrimalDestructibleActor_StaticBPPreDestructionHandleAttachedComponentClass;

// Function GeometryCollectionEngine.ChaosDestructionListener.AddChaosSolverActor
// 0x0008 (0x0008 - 0x0000)
struct ChaosDestructionListener_AddChaosSolverActor final
{
public:
	class AChaosSolverActor*                      ChaosSolverActor;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_AddChaosSolverActor;

// Function GeometryCollectionEngine.ChaosDestructionListener.AddGeometryCollectionActor
// 0x0008 (0x0008 - 0x0000)
struct ChaosDestructionListener_AddGeometryCollectionActor final
{
public:
	class AGeometryCollectionActor*               GeometryCollectionActor;                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_AddGeometryCollectionActor;

// Function GeometryCollectionEngine.ChaosDestructionListener.RemoveChaosSolverActor
// 0x0008 (0x0008 - 0x0000)
struct ChaosDestructionListener_RemoveChaosSolverActor final
{
public:
	class AChaosSolverActor*                      ChaosSolverActor;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_RemoveChaosSolverActor;

// Function GeometryCollectionEngine.ChaosDestructionListener.RemoveGeometryCollectionActor
// 0x0008 (0x0008 - 0x0000)
struct ChaosDestructionListener_RemoveGeometryCollectionActor final
{
public:
	class AGeometryCollectionActor*               GeometryCollectionActor;                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_RemoveGeometryCollectionActor;

// Function GeometryCollectionEngine.ChaosDestructionListener.SetBreakingEventEnabled
// 0x0001 (0x0001 - 0x0000)
struct ChaosDestructionListener_SetBreakingEventEnabled final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_SetBreakingEventEnabled;

// Function GeometryCollectionEngine.ChaosDestructionListener.SetBreakingEventRequestSettings
// 0x0018 (0x0018 - 0x0000)
struct ChaosDestructionListener_SetBreakingEventRequestSettings final
{
public:
	struct FChaosBreakingEventRequestSettings     InSettings;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_SetBreakingEventRequestSettings;

// Function GeometryCollectionEngine.ChaosDestructionListener.SetCollisionEventEnabled
// 0x0001 (0x0001 - 0x0000)
struct ChaosDestructionListener_SetCollisionEventEnabled final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_SetCollisionEventEnabled;

// Function GeometryCollectionEngine.ChaosDestructionListener.SetCollisionEventRequestSettings
// 0x0018 (0x0018 - 0x0000)
struct ChaosDestructionListener_SetCollisionEventRequestSettings final
{
public:
	struct FChaosCollisionEventRequestSettings    InSettings;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_SetCollisionEventRequestSettings;

// Function GeometryCollectionEngine.ChaosDestructionListener.SetRemovalEventEnabled
// 0x0001 (0x0001 - 0x0000)
struct ChaosDestructionListener_SetRemovalEventEnabled final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_SetRemovalEventEnabled;

// Function GeometryCollectionEngine.ChaosDestructionListener.SetRemovalEventRequestSettings
// 0x0010 (0x0010 - 0x0000)
struct ChaosDestructionListener_SetRemovalEventRequestSettings final
{
public:
	struct FChaosRemovalEventRequestSettings      InSettings;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_SetRemovalEventRequestSettings;

// Function GeometryCollectionEngine.ChaosDestructionListener.SetTrailingEventEnabled
// 0x0001 (0x0001 - 0x0000)
struct ChaosDestructionListener_SetTrailingEventEnabled final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_SetTrailingEventEnabled;

// Function GeometryCollectionEngine.ChaosDestructionListener.SetTrailingEventRequestSettings
// 0x0018 (0x0018 - 0x0000)
struct ChaosDestructionListener_SetTrailingEventRequestSettings final
{
public:
	struct FChaosTrailingEventRequestSettings     InSettings;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_SetTrailingEventRequestSettings;

// Function GeometryCollectionEngine.ChaosDestructionListener.SortBreakingEvents
// 0x0018 (0x0018 - 0x0000)
struct ChaosDestructionListener_SortBreakingEvents final
{
public:
	TArray<struct FChaosBreakingEventData>        BreakingEvents;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EChaosBreakingSortMethod                      SortMethod;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosDestructionListener_SortBreakingEvents;

// Function GeometryCollectionEngine.ChaosDestructionListener.SortCollisionEvents
// 0x0018 (0x0018 - 0x0000)
struct ChaosDestructionListener_SortCollisionEvents final
{
public:
	TArray<struct FChaosCollisionEventData>       CollisionEvents;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EChaosCollisionSortMethod                     SortMethod;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosDestructionListener_SortCollisionEvents;

// Function GeometryCollectionEngine.ChaosDestructionListener.SortRemovalEvents
// 0x0018 (0x0018 - 0x0000)
struct ChaosDestructionListener_SortRemovalEvents final
{
public:
	TArray<struct FChaosRemovalEventData>         RemovalEvents;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EChaosRemovalSortMethod                       SortMethod;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosDestructionListener_SortRemovalEvents;

// Function GeometryCollectionEngine.ChaosDestructionListener.SortTrailingEvents
// 0x0018 (0x0018 - 0x0000)
struct ChaosDestructionListener_SortTrailingEvents final
{
public:
	TArray<struct FChaosTrailingEventData>        TrailingEvents;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EChaosTrailingSortMethod                      SortMethod;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChaosDestructionListener_SortTrailingEvents;

// Function GeometryCollectionEngine.ChaosDestructionListener.IsEventListening
// 0x0001 (0x0001 - 0x0000)
struct ChaosDestructionListener_IsEventListening final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosDestructionListener_IsEventListening;

// Function GeometryCollectionEngine.GeometryCollectionActor.RaycastSingle
// 0x0140 (0x0140 - 0x0000)
struct GeometryCollectionActor_RaycastSingle final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                End;                                               // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             OutHit;                                            // 0x0030(0x0108)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0138(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryCollectionActor_RaycastSingle;

// Function GeometryCollectionEngine.GeometryCollectionComponent.ApplyAngularVelocity
// 0x0020 (0x0020 - 0x0000)
struct GeometryCollectionComponent_ApplyAngularVelocity final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AngularVelocity;                                   // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_ApplyAngularVelocity;

// Function GeometryCollectionEngine.GeometryCollectionComponent.ApplyBreakingAngularVelocity
// 0x0020 (0x0020 - 0x0000)
struct GeometryCollectionComponent_ApplyBreakingAngularVelocity final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AngularVelocity;                                   // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_ApplyBreakingAngularVelocity;

// Function GeometryCollectionEngine.GeometryCollectionComponent.ApplyBreakingLinearVelocity
// 0x0020 (0x0020 - 0x0000)
struct GeometryCollectionComponent_ApplyBreakingLinearVelocity final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LinearVelocity;                                    // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_ApplyBreakingLinearVelocity;

// Function GeometryCollectionEngine.GeometryCollectionComponent.ApplyExternalStrain
// 0x0030 (0x0030 - 0x0000)
struct GeometryCollectionComponent_ApplyExternalStrain final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropagationDepth;                                  // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropagationFactor;                                 // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strain;                                            // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_ApplyExternalStrain;

// Function GeometryCollectionEngine.GeometryCollectionComponent.ApplyInternalStrain
// 0x0030 (0x0030 - 0x0000)
struct GeometryCollectionComponent_ApplyInternalStrain final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PropagationDepth;                                  // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropagationFactor;                                 // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strain;                                            // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_ApplyInternalStrain;

// Function GeometryCollectionEngine.GeometryCollectionComponent.ApplyKinematicField
// 0x0020 (0x0020 - 0x0000)
struct GeometryCollectionComponent_ApplyKinematicField final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                position;                                          // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_ApplyKinematicField;

// Function GeometryCollectionEngine.GeometryCollectionComponent.ApplyLinearVelocity
// 0x0020 (0x0020 - 0x0000)
struct GeometryCollectionComponent_ApplyLinearVelocity final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LinearVelocity;                                    // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_ApplyLinearVelocity;

// Function GeometryCollectionEngine.GeometryCollectionComponent.ApplyPhysicsField
// 0x0018 (0x0018 - 0x0000)
struct GeometryCollectionComponent_ApplyPhysicsField final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryCollectionPhysicsTypeEnum            Target;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFieldSystemMetaData*                   MetaData;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFieldNodeBase*                         Field;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_ApplyPhysicsField;

// Function GeometryCollectionEngine.GeometryCollectionComponent.BPGetMaxIndex
// 0x0004 (0x0004 - 0x0000)
struct GeometryCollectionComponent_BPGetMaxIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_BPGetMaxIndex;

// Function GeometryCollectionEngine.GeometryCollectionComponent.CrumbleCluster
// 0x0004 (0x0004 - 0x0000)
struct GeometryCollectionComponent_CrumbleCluster final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_CrumbleCluster;

// Function GeometryCollectionEngine.GeometryCollectionComponent.EnableRootProxyForCustomRenderer
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_EnableRootProxyForCustomRenderer final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_EnableRootProxyForCustomRenderer;

// Function GeometryCollectionEngine.GeometryCollectionComponent.ForceBrokenForCustomRenderer
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_ForceBrokenForCustomRenderer final
{
public:
	bool                                          bForceBroken;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_ForceBrokenForCustomRenderer;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetDebugInfo
// 0x0010 (0x0010 - 0x0000)
struct GeometryCollectionComponent_GetDebugInfo final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetDebugInfo;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetInitialLevel
// 0x0008 (0x0008 - 0x0000)
struct GeometryCollectionComponent_GetInitialLevel final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetInitialLevel;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetMassAndExtents
// 0x0040 (0x0040 - 0x0000)
struct GeometryCollectionComponent_GetMassAndExtents final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutMass;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   OutExtents;                                        // 0x0008(0x0038)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetMassAndExtents;

// Function GeometryCollectionEngine.GeometryCollectionComponent.ReceivePhysicsCollision
// 0x00C0 (0x00C0 - 0x0000)
struct GeometryCollectionComponent_ReceivePhysicsCollision final
{
public:
	struct FChaosPhysicsCollisionInfo             CollisionInfo;                                     // 0x0000(0x00C0)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_ReceivePhysicsCollision;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetAbandonedParticleCollisionProfileName
// 0x0008 (0x0008 - 0x0000)
struct GeometryCollectionComponent_SetAbandonedParticleCollisionProfileName final
{
public:
	class FName                                   CollisionProfile;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetAbandonedParticleCollisionProfileName;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetAnchoredByBox
// 0x0040 (0x0040 - 0x0000)
struct GeometryCollectionComponent_SetAnchoredByBox final
{
public:
	struct FBox                                   WorldSpaceBox;                                     // 0x0000(0x0038)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bAnchored;                                         // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxLevel;                                          // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetAnchoredByBox;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetAnchoredByIndex
// 0x0008 (0x0008 - 0x0000)
struct GeometryCollectionComponent_SetAnchoredByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnchored;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetAnchoredByIndex;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetAnchoredByTransformedBox
// 0x00B0 (0x00B0 - 0x0000)
struct GeometryCollectionComponent_SetAnchoredByTransformedBox final
{
public:
	struct FBox                                   Box;                                               // 0x0000(0x0038)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0040(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnchored;                                         // 0x00A0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxLevel;                                          // 0x00A4(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetAnchoredByTransformedBox;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetDamageModel
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_SetDamageModel final
{
public:
	EDamageModelTypeEnum                          InDamageModel;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetDamageModel;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetDamagePropagationData
// 0x000C (0x000C - 0x0000)
struct GeometryCollectionComponent_SetDamagePropagationData final
{
public:
	struct FGeometryCollectionDamagePropagationData InDamagePropagationData;                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetDamagePropagationData;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetDamageThreshold
// 0x0010 (0x0010 - 0x0000)
struct GeometryCollectionComponent_SetDamageThreshold final
{
public:
	TArray<float>                                 InDamageThreshold;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetDamageThreshold;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetDensityFromPhysicsMaterial
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_SetDensityFromPhysicsMaterial final
{
public:
	bool                                          bInDensityFromPhysicsMaterial;                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetDensityFromPhysicsMaterial;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetEnableDamageFromCollision
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_SetEnableDamageFromCollision final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetEnableDamageFromCollision;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetGravityGroupIndex
// 0x0004 (0x0004 - 0x0000)
struct GeometryCollectionComponent_SetGravityGroupIndex final
{
public:
	int32                                         InGravityGroupIndex;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetGravityGroupIndex;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetLocalRestTransforms
// 0x0018 (0x0018 - 0x0000)
struct GeometryCollectionComponent_SetLocalRestTransforms final
{
public:
	TArray<struct FTransform>                     Transforms;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bOnlyLeaves;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetLocalRestTransforms;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetNotifyBreaks
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_SetNotifyBreaks final
{
public:
	bool                                          bNewNotifyBreaks;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetNotifyBreaks;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetNotifyCrumblings
// 0x0002 (0x0002 - 0x0000)
struct GeometryCollectionComponent_SetNotifyCrumblings final
{
public:
	bool                                          bNewNotifyCrumblings;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewCrumblingEventIncludesChildren;                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetNotifyCrumblings;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetNotifyGlobalBreaks
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_SetNotifyGlobalBreaks final
{
public:
	bool                                          bNewNotifyGlobalBreaks;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetNotifyGlobalBreaks;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetNotifyGlobalCollision
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_SetNotifyGlobalCollision final
{
public:
	bool                                          bNewNotifyGlobalCollisions;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetNotifyGlobalCollision;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetNotifyGlobalCrumblings
// 0x0002 (0x0002 - 0x0000)
struct GeometryCollectionComponent_SetNotifyGlobalCrumblings final
{
public:
	bool                                          bNewNotifyGlobalCrumblings;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGlobalNewCrumblingEventIncludesChildren;          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetNotifyGlobalCrumblings;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetNotifyGlobalRemovals
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_SetNotifyGlobalRemovals final
{
public:
	bool                                          bNewNotifyGlobalRemovals;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetNotifyGlobalRemovals;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetNotifyRemovals
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_SetNotifyRemovals final
{
public:
	bool                                          bNewNotifyRemovals;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetNotifyRemovals;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetOneWayInteractionLevel
// 0x0004 (0x0004 - 0x0000)
struct GeometryCollectionComponent_SetOneWayInteractionLevel final
{
public:
	int32                                         InOneWayInteractionLevel;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetOneWayInteractionLevel;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetPerLevelCollisionProfileNames
// 0x0010 (0x0010 - 0x0000)
struct GeometryCollectionComponent_SetPerLevelCollisionProfileNames final
{
public:
	TArray<class FName>                           ProfileNames;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetPerLevelCollisionProfileNames;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetPerParticleCollisionProfileName
// 0x0018 (0x0018 - 0x0000)
struct GeometryCollectionComponent_SetPerParticleCollisionProfileName final
{
public:
	TArray<int32>                                 BoneIds;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ProfileName;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetPerParticleCollisionProfileName;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetRestCollection
// 0x0010 (0x0010 - 0x0000)
struct GeometryCollectionComponent_SetRestCollection final
{
public:
	const class UGeometryCollection*              RestCollectionIn;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyAssetDefaults;                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetRestCollection;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetRootProxyComponentSpaceTransform
// 0x0070 (0x0070 - 0x0000)
struct GeometryCollectionComponent_SetRootProxyComponentSpaceTransform final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RootProxyTransform;                                // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetRootProxyComponentSpaceTransform;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetSolverActor
// 0x0008 (0x0008 - 0x0000)
struct GeometryCollectionComponent_SetSolverActor final
{
public:
	class AChaosSolverActor*                      InSolverActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetSolverActor;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetUseMaterialDamageModifiers
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_SetUseMaterialDamageModifiers final
{
public:
	bool                                          bInUseMaterialDamageModifiers;                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetUseMaterialDamageModifiers;

// Function GeometryCollectionEngine.GeometryCollectionComponent.SetUseStaticMeshCollisionForTraces
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_SetUseStaticMeshCollisionForTraces final
{
public:
	bool                                          bInUseStaticMeshCollisionForTraces;                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_SetUseStaticMeshCollisionForTraces;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetDamageThreshold
// 0x0010 (0x0010 - 0x0000)
struct GeometryCollectionComponent_GetDamageThreshold final
{
public:
	TArray<float>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetDamageThreshold;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetInitialLocalRestTransforms
// 0x0010 (0x0010 - 0x0000)
struct GeometryCollectionComponent_GetInitialLocalRestTransforms final
{
public:
	TArray<struct FTransform>                     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetInitialLocalRestTransforms;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetLocalBounds
// 0x0038 (0x0038 - 0x0000)
struct GeometryCollectionComponent_GetLocalBounds final
{
public:
	struct FBox                                   ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetLocalBounds;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetLocalRestTransforms
// 0x0018 (0x0018 - 0x0000)
struct GeometryCollectionComponent_GetLocalRestTransforms final
{
public:
	bool                                          bInitialTransforms;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetLocalRestTransforms;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetRootCurrentTransform
// 0x0060 (0x0060 - 0x0000)
struct GeometryCollectionComponent_GetRootCurrentTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetRootCurrentTransform;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetRootIndex
// 0x0004 (0x0004 - 0x0000)
struct GeometryCollectionComponent_GetRootIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetRootIndex;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetRootInitialTransform
// 0x0060 (0x0060 - 0x0000)
struct GeometryCollectionComponent_GetRootInitialTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetRootInitialTransform;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetSolverActor
// 0x0008 (0x0008 - 0x0000)
struct GeometryCollectionComponent_GetSolverActor final
{
public:
	class AChaosSolverActor*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetSolverActor;

// Function GeometryCollectionEngine.GeometryCollectionComponent.GetUseStaticMeshCollisionForTraces
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_GetUseStaticMeshCollisionForTraces final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_GetUseStaticMeshCollisionForTraces;

// Function GeometryCollectionEngine.GeometryCollectionComponent.IsRootBroken
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollectionComponent_IsRootBroken final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollectionComponent_IsRootBroken;

// Function GeometryCollectionEngine.GeometryCollection.SetConvertVertexColorsToSRGB
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollection_SetConvertVertexColorsToSRGB final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollection_SetConvertVertexColorsToSRGB;

// Function GeometryCollectionEngine.GeometryCollection.SetEnableNanite
// 0x0001 (0x0001 - 0x0000)
struct GeometryCollection_SetEnableNanite final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GeometryCollection_SetEnableNanite;

}

