#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryScriptingCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GeometryScriptingCore.EGeometryScriptOutcomePins
// NumValues: 0x0003
enum class EGeometryScriptOutcomePins : uint8
{
	Failure                                  = 0,
	Success                                  = 1,
	EGeometryScriptOutcomePins_MAX           = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptSearchOutcomePins
// NumValues: 0x0003
enum class EGeometryScriptSearchOutcomePins : uint8
{
	Found                                    = 0,
	NotFound                                 = 1,
	EGeometryScriptSearchOutcomePins_MAX     = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptContainmentOutcomePins
// NumValues: 0x0003
enum class EGeometryScriptContainmentOutcomePins : uint8
{
	Inside                                   = 0,
	Outside                                  = 1,
	EGeometryScriptContainmentOutcomePins_MAX = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptLODType
// NumValues: 0x0005
enum class EGeometryScriptLODType : uint8
{
	MaxAvailable                             = 0,
	HiResSourceModel                         = 1,
	SourceModel                              = 2,
	RenderData                               = 3,
	EGeometryScriptLODType_MAX               = 4,
};

// Enum GeometryScriptingCore.EGeometryScriptAxis
// NumValues: 0x0004
enum class EGeometryScriptAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	EGeometryScriptAxis_MAX                  = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptCoordinateSpace
// NumValues: 0x0003
enum class EGeometryScriptCoordinateSpace : uint8
{
	Local                                    = 0,
	World                                    = 1,
	EGeometryScriptCoordinateSpace_MAX       = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptIndexType
// NumValues: 0x0007
enum class EGeometryScriptIndexType : uint8
{
	Any                                      = 0,
	Triangle                                 = 1,
	Edge                                     = 2,
	Vertex                                   = 3,
	MaterialID                               = 4,
	PolygroupID                              = 5,
	EGeometryScriptIndexType_MAX             = 6,
};

// Enum GeometryScriptingCore.EGeometryScriptDebugMessageType
// NumValues: 0x0003
enum class EGeometryScriptDebugMessageType : uint8
{
	ErrorMessage                             = 0,
	WarningMessage                           = 1,
	EGeometryScriptDebugMessageType_MAX      = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptErrorType
// NumValues: 0x0005
enum class EGeometryScriptErrorType : uint8
{
	NoError                                  = 0,
	UnknownError                             = 1,
	InvalidInputs                            = 2,
	OperationFailed                          = 3,
	EGeometryScriptErrorType_MAX             = 4,
};

// Enum GeometryScriptingCore.EGeometryScriptCollisionGenerationMethod
// NumValues: 0x0009
enum class EGeometryScriptCollisionGenerationMethod : uint8
{
	AlignedBoxes                             = 0,
	OrientedBoxes                            = 1,
	MinimalSpheres                           = 2,
	Capsules                                 = 3,
	ConvexHulls                              = 4,
	SweptHulls                               = 5,
	MinVolumeShapes                          = 6,
	LevelSets                                = 7,
	EGeometryScriptCollisionGenerationMethod_MAX = 8,
};

// Enum GeometryScriptingCore.EGeometryScriptSweptHullAxis
// NumValues: 0x0006
enum class EGeometryScriptSweptHullAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	SmallestBoxDimension                     = 3,
	SmallestVolume                           = 4,
	EGeometryScriptSweptHullAxis_MAX         = 5,
};

// Enum GeometryScriptingCore.ENegativeSpaceSampleMethod
// NumValues: 0x0004
enum class ENegativeSpaceSampleMethod : uint8
{
	Uniform                                  = 0,
	VoxelSearch                              = 1,
	NavigableVoxelSearch                     = 2,
	ENegativeSpaceSampleMethod_MAX           = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptConvexHullSimplifyMethod
// NumValues: 0x0003
enum class EGeometryScriptConvexHullSimplifyMethod : uint8
{
	MeshQSlim                                = 0,
	AngleTolerance                           = 1,
	EGeometryScriptConvexHullSimplifyMethod_MAX = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptMeshSelectionType
// NumValues: 0x0005
enum class EGeometryScriptMeshSelectionType : uint8
{
	Vertices                                 = 0,
	Edges                                    = 3,
	Triangles                                = 1,
	Polygroups                               = 2,
	EGeometryScriptMeshSelectionType_MAX     = 4,
};

// Enum GeometryScriptingCore.EGeometryScriptMeshSelectionConversionType
// NumValues: 0x0005
enum class EGeometryScriptMeshSelectionConversionType : uint8
{
	NoConversion                             = 0,
	ToVertices                               = 1,
	ToTriangles                              = 2,
	ToPolygroups                             = 3,
	EGeometryScriptMeshSelectionConversionType_MAX = 4,
};

// Enum GeometryScriptingCore.EGeometryScriptCombineSelectionMode
// NumValues: 0x0004
enum class EGeometryScriptCombineSelectionMode : uint8
{
	Add                                      = 0,
	Subtract                                 = 1,
	Intersection                             = 2,
	EGeometryScriptCombineSelectionMode_MAX  = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptEmptySelectionBehavior
// NumValues: 0x0003
enum class EGeometryScriptEmptySelectionBehavior : uint8
{
	FullMeshSelection                        = 0,
	EmptySelection                           = 1,
	EGeometryScriptEmptySelectionBehavior_MAX = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptBakeResolution
// NumValues: 0x000B
enum class EGeometryScriptBakeResolution : uint8
{
	Resolution16                             = 0,
	Resolution32                             = 1,
	Resolution64                             = 2,
	Resolution128                            = 3,
	Resolution256                            = 4,
	Resolution512                            = 5,
	Resolution1024                           = 6,
	Resolution2048                           = 7,
	Resolution4096                           = 8,
	Resolution8192                           = 9,
	EGeometryScriptBakeResolution_MAX        = 10,
};

// Enum GeometryScriptingCore.EGeometryScriptBakeBitDepth
// NumValues: 0x0003
enum class EGeometryScriptBakeBitDepth : uint8
{
	ChannelBits8                             = 0,
	ChannelBits16                            = 1,
	EGeometryScriptBakeBitDepth_MAX          = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptBakeSamplesPerPixel
// NumValues: 0x0006
enum class EGeometryScriptBakeSamplesPerPixel : uint8
{
	Sample1                                  = 0,
	Sample4                                  = 1,
	Sample16                                 = 2,
	Sample64                                 = 3,
	Samples256                               = 4,
	EGeometryScriptBakeSamplesPerPixel_MAX   = 5,
};

// Enum GeometryScriptingCore.EGeometryScriptBakeFilteringType
// NumValues: 0x0003
enum class EGeometryScriptBakeFilteringType : uint8
{
	BSpline                                  = 0,
	Box                                      = 1,
	EGeometryScriptBakeFilteringType_MAX     = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptBakeTypes
// NumValues: 0x000F
enum class EGeometryScriptBakeTypes : uint8
{
	None                                     = 0,
	TangentSpaceNormal                       = 1,
	ObjectSpaceNormal                        = 2,
	FaceNormal                               = 3,
	BentNormal                               = 4,
	Position                                 = 5,
	Curvature                                = 6,
	AmbientOcclusion                         = 7,
	Texture                                  = 8,
	MultiTexture                             = 9,
	VertexColor                              = 10,
	MaterialID                               = 11,
	Constant                                 = 12,
	UVShell                                  = 13,
	EGeometryScriptBakeTypes_MAX             = 14,
};

// Enum GeometryScriptingCore.EGeometryScriptBakeOutputMode
// NumValues: 0x0003
enum class EGeometryScriptBakeOutputMode : uint8
{
	RGBA                                     = 0,
	PerChannel                               = 1,
	EGeometryScriptBakeOutputMode_MAX        = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptBakeNormalSpace
// NumValues: 0x0003
enum class EGeometryScriptBakeNormalSpace : uint8
{
	Tangent                                  = 0,
	Object                                   = 1,
	EGeometryScriptBakeNormalSpace_MAX       = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptBakeCurvatureTypeMode
// NumValues: 0x0004
enum class EGeometryScriptBakeCurvatureTypeMode : uint8
{
	Mean                                     = 0,
	Max                                      = 1,
	Min                                      = 2,
	Gaussian                                 = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptBakeCurvatureColorMode
// NumValues: 0x0004
enum class EGeometryScriptBakeCurvatureColorMode : uint8
{
	Grayscale                                = 0,
	RedBlue                                  = 1,
	RedGreenBlue                             = 2,
	EGeometryScriptBakeCurvatureColorMode_MAX = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptBakeCurvatureClampMode
// NumValues: 0x0004
enum class EGeometryScriptBakeCurvatureClampMode : uint8
{
	None                                     = 0,
	OnlyPositive                             = 1,
	OnlyNegative                             = 2,
	EGeometryScriptBakeCurvatureClampMode_MAX = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptCombineAttributesMode
// NumValues: 0x0004
enum class EGeometryScriptCombineAttributesMode : uint8
{
	EnableAllMatching                        = 0,
	UseTarget                                = 1,
	UseSource                                = 2,
	EGeometryScriptCombineAttributesMode_MAX = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptPruneBoneWeightsAssignmentType
// NumValues: 0x0003
enum class EGeometryScriptPruneBoneWeightsAssignmentType : uint8
{
	RenormalizeRemaining                     = 0,
	ReassignToParent                         = 1,
	EGeometryScriptPruneBoneWeightsAssignmentType_MAX = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptSmoothBoneWeightsType
// NumValues: 0x0003
enum class EGeometryScriptSmoothBoneWeightsType : uint8
{
	DirectDistance                           = 0,
	GeodesicVoxel                            = 1,
	EGeometryScriptSmoothBoneWeightsType_MAX = 2,
};

// Enum GeometryScriptingCore.ETransferBoneWeightsMethod
// NumValues: 0x0003
enum class ETransferBoneWeightsMethod : uint8
{
	ClosestPointOnSurface                    = 0,
	InpaintWeights                           = 1,
	ETransferBoneWeightsMethod_MAX           = 2,
};

// Enum GeometryScriptingCore.EOutputTargetMeshBones
// NumValues: 0x0003
enum class EOutputTargetMeshBones : uint8
{
	SourceBones                              = 0,
	TargetBones                              = 1,
	EOutputTargetMeshBones_MAX               = 2,
};

// Enum GeometryScriptingCore.EBonesToCopyFromSource
// NumValues: 0x0004
enum class EBonesToCopyFromSource : uint8
{
	AllBones                                 = 0,
	OnlyBoundAndParents                      = 1,
	OnlyBoundAndRoot                         = 2,
	EBonesToCopyFromSource_MAX               = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptBooleanOperation
// NumValues: 0x0004
enum class EGeometryScriptBooleanOperation : uint8
{
	Union                                    = 0,
	Intersection                             = 1,
	Subtract                                 = 2,
	EGeometryScriptBooleanOperation_MAX      = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptMeshDifferenceReason
// NumValues: 0x000E
enum class EGeometryScriptMeshDifferenceReason : uint8
{
	Unknown                                  = 0,
	VertexCount                              = 1,
	TriangleCount                            = 2,
	EdgeCount                                = 3,
	Vertex                                   = 4,
	Triangle                                 = 5,
	Edge                                     = 6,
	Connectivity                             = 7,
	Normal                                   = 8,
	Color                                    = 9,
	UV                                       = 10,
	Group                                    = 11,
	Attribute                                = 12,
	EGeometryScriptMeshDifferenceReason_MAX  = 13,
};

// Enum GeometryScriptingCore.EGeometryScriptFlareType
// NumValues: 0x0004
enum class EGeometryScriptFlareType : uint8
{
	SinMode                                  = 0,
	SinSquaredMode                           = 1,
	TriangleMode                             = 2,
	EGeometryScriptFlareType_MAX             = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptMathWarpType
// NumValues: 0x0004
enum class EGeometryScriptMathWarpType : uint8
{
	SinWave1D                                = 0,
	SinWave2D                                = 1,
	SinWave3D                                = 2,
	EGeometryScriptMathWarpType_MAX          = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptMeshEditPolygroupMode
// NumValues: 0x0004
enum class EGeometryScriptMeshEditPolygroupMode : uint8
{
	PreserveExisting                         = 0,
	AutoGenerateNew                          = 1,
	SetConstant                              = 2,
	EGeometryScriptMeshEditPolygroupMode_MAX = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptPolyOperationArea
// NumValues: 0x0004
enum class EGeometryScriptPolyOperationArea : uint8
{
	EntireSelection                          = 0,
	PerPolygroup                             = 1,
	PerTriangle                              = 2,
	EGeometryScriptPolyOperationArea_MAX     = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptLinearExtrudeDirection
// NumValues: 0x0003
enum class EGeometryScriptLinearExtrudeDirection : uint8
{
	FixedDirection                           = 0,
	AverageFaceNormal                        = 1,
	EGeometryScriptLinearExtrudeDirection_MAX = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptOffsetFacesType
// NumValues: 0x0004
enum class EGeometryScriptOffsetFacesType : uint8
{
	VertexNormal                             = 0,
	FaceNormal                               = 1,
	ParallelFaceOffset                       = 2,
	EGeometryScriptOffsetFacesType_MAX       = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptMeshBevelSelectionMode
// NumValues: 0x0005
enum class EGeometryScriptMeshBevelSelectionMode : uint8
{
	TriangleArea                             = 0,
	AllPolygroupEdges                        = 1,
	SharedPolygroupEdges                     = 2,
	SelectedEdges                            = 3,
	EGeometryScriptMeshBevelSelectionMode_MAX = 4,
};

// Enum GeometryScriptingCore.EGeometryScriptTangentTypes
// NumValues: 0x0003
enum class EGeometryScriptTangentTypes : uint8
{
	FastMikkT                                = 0,
	PerTriangle                              = 1,
	EGeometryScriptTangentTypes_MAX          = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptPrimitivePolygroupMode
// NumValues: 0x0004
enum class EGeometryScriptPrimitivePolygroupMode : uint8
{
	SingleGroup                              = 0,
	PerFace                                  = 1,
	PerQuad                                  = 2,
	EGeometryScriptPrimitivePolygroupMode_MAX = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptPrimitiveOriginMode
// NumValues: 0x0003
enum class EGeometryScriptPrimitiveOriginMode : uint8
{
	Center                                   = 0,
	Base                                     = 1,
	EGeometryScriptPrimitiveOriginMode_MAX   = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptPrimitiveUVMode
// NumValues: 0x0003
enum class EGeometryScriptPrimitiveUVMode : uint8
{
	Uniform                                  = 0,
	ScaleToFill                              = 1,
	EGeometryScriptPrimitiveUVMode_MAX       = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptPolygonFillMode
// NumValues: 0x0007
enum class EGeometryScriptPolygonFillMode : uint8
{
	All                                      = 0,
	Solid                                    = 1,
	PositiveWinding                          = 2,
	NonZeroWinding                           = 3,
	NegativeWinding                          = 4,
	OddWinding                               = 5,
	EGeometryScriptPolygonFillMode_MAX       = 6,
};

// Enum GeometryScriptingCore.EGeometryScriptUniformRemeshTargetType
// NumValues: 0x0003
enum class EGeometryScriptUniformRemeshTargetType : uint8
{
	TriangleCount                            = 0,
	TargetEdgeLength                         = 1,
	EGeometryScriptUniformRemeshTargetType_MAX = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptRemeshEdgeConstraintType
// NumValues: 0x0005
enum class EGeometryScriptRemeshEdgeConstraintType : uint8
{
	Fixed                                    = 0,
	Refine                                   = 1,
	Free                                     = 2,
	Ignore                                   = 3,
	EGeometryScriptRemeshEdgeConstraintType_MAX = 4,
};

// Enum GeometryScriptingCore.EGeometryScriptRemeshSmoothingType
// NumValues: 0x0004
enum class EGeometryScriptRemeshSmoothingType : uint8
{
	Uniform                                  = 0,
	UVPreserving                             = 1,
	Mixed                                    = 2,
	EGeometryScriptRemeshSmoothingType_MAX   = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptFillHolesMethod
// NumValues: 0x0006
enum class EGeometryScriptFillHolesMethod : uint8
{
	Automatic                                = 0,
	MinimalFill                              = 1,
	PolygonTriangulation                     = 2,
	TriangleFan                              = 3,
	PlanarProjection                         = 4,
	EGeometryScriptFillHolesMethod_MAX       = 5,
};

// Enum GeometryScriptingCore.EGeometryScriptRemoveHiddenTrianglesMethod
// NumValues: 0x0003
enum class EGeometryScriptRemoveHiddenTrianglesMethod : uint8
{
	FastWindingNumber                        = 0,
	RaycastOcclusionTest                     = 1,
	EGeometryScriptRemoveHiddenTrianglesMethod_MAX = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptRepairMeshMode
// NumValues: 0x0004
enum class EGeometryScriptRepairMeshMode : uint8
{
	DeleteOnly                               = 0,
	RepairOrDelete                           = 1,
	RepairOrSkip                             = 2,
	EGeometryScriptRepairMeshMode_MAX        = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptSamplingWeightMode
// NumValues: 0x0004
enum class EGeometryScriptSamplingWeightMode : uint8
{
	WeightToRadius                           = 0,
	FilledWeightToRadius                     = 1,
	WeightedRandom                           = 2,
	EGeometryScriptSamplingWeightMode_MAX    = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptSamplingDistributionMode
// NumValues: 0x0004
enum class EGeometryScriptSamplingDistributionMode : uint8
{
	Uniform                                  = 0,
	Smaller                                  = 1,
	Larger                                   = 2,
	EGeometryScriptSamplingDistributionMode_MAX = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptTopologyConnectionType
// NumValues: 0x0004
enum class EGeometryScriptTopologyConnectionType : uint8
{
	Geometric                                = 0,
	Polygroup                                = 1,
	MaterialID                               = 2,
	EGeometryScriptTopologyConnectionType_MAX = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptRemoveMeshSimplificationType
// NumValues: 0x0004
enum class EGeometryScriptRemoveMeshSimplificationType : uint8
{
	StandardQEM                              = 0,
	VolumePreserving                         = 1,
	AttributeAware                           = 2,
	EGeometryScriptRemoveMeshSimplificationType_MAX = 3,
};

// Enum GeometryScriptingCore.ESelectiveTessellatePatternType
// NumValues: 0x0002
enum class ESelectiveTessellatePatternType : uint8
{
	ConcentricRings                          = 0,
	ESelectiveTessellatePatternType_MAX      = 1,
};

// Enum GeometryScriptingCore.EGeometryScriptUVLayoutType
// NumValues: 0x0005
enum class EGeometryScriptUVLayoutType : uint8
{
	Transform                                = 0,
	Stack                                    = 1,
	Repack                                   = 2,
	Normalize                                = 3,
	EGeometryScriptUVLayoutType_MAX          = 4,
};

// Enum GeometryScriptingCore.EGeometryScriptUVFlattenMethod
// NumValues: 0x0004
enum class EGeometryScriptUVFlattenMethod : uint8
{
	ExpMap                                   = 0,
	Conformal                                = 1,
	SpectralConformal                        = 2,
	EGeometryScriptUVFlattenMethod_MAX       = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptUVIslandSource
// NumValues: 0x0003
enum class EGeometryScriptUVIslandSource : uint8
{
	PolyGroups                               = 0,
	UVIslands                                = 1,
	EGeometryScriptUVIslandSource_MAX        = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptTexelDensityMode
// NumValues: 0x0004
enum class EGeometryScriptTexelDensityMode : uint8
{
	ApplyToIslands                           = 0,
	ApplyToWhole                             = 1,
	Normalize                                = 2,
	EGeometryScriptTexelDensityMode_MAX      = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptBlurColorMode
// NumValues: 0x0004
enum class EGeometryScriptBlurColorMode : uint8
{
	Uniform                                  = 0,
	EdgeLength                               = 1,
	CotanWeights                             = 2,
	EGeometryScriptBlurColorMode_MAX         = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptGridSizingMethod
// NumValues: 0x0003
enum class EGeometryScriptGridSizingMethod : uint8
{
	GridCellSize                             = 0,
	GridResolution                           = 1,
	EGeometryScriptGridSizingMethod_MAX      = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptMorphologicalOpType
// NumValues: 0x0005
enum class EGeometryScriptMorphologicalOpType : uint8
{
	Dilate                                   = 0,
	Contract                                 = 1,
	Close                                    = 2,
	Open                                     = 3,
	EGeometryScriptMorphologicalOpType_MAX   = 4,
};

// Enum GeometryScriptingCore.EGeometryScriptInitKMeansMethod
// NumValues: 0x0003
enum class EGeometryScriptInitKMeansMethod : uint8
{
	Random                                   = 0,
	UniformSpacing                           = 1,
	EGeometryScriptInitKMeansMethod_MAX      = 2,
};

// Enum GeometryScriptingCore.EGeometryScriptPolyOffsetJoinType
// NumValues: 0x0004
enum class EGeometryScriptPolyOffsetJoinType : uint8
{
	Square                                   = 0,
	Round                                    = 1,
	Miter                                    = 2,
	EGeometryScriptPolyOffsetJoinType_MAX    = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptPathOffsetEndType
// NumValues: 0x0004
enum class EGeometryScriptPathOffsetEndType : uint8
{
	Butt                                     = 0,
	Square                                   = 1,
	Round                                    = 2,
	EGeometryScriptPathOffsetEndType_MAX     = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptSampleSpacing
// NumValues: 0x0004
enum class EGeometryScriptSampleSpacing : uint8
{
	UniformDistance                          = 0,
	UniformTime                              = 1,
	ErrorTolerance                           = 2,
	EGeometryScriptSampleSpacing_MAX         = 3,
};

// Enum GeometryScriptingCore.EGeometryScriptEvaluateSplineRange
// NumValues: 0x0005
enum class EGeometryScriptEvaluateSplineRange : uint8
{
	FullSpline                               = 0,
	DistanceRange                            = 1,
	TimeRange_ConstantSpeed                  = 2,
	TimeRange_VariableSpeed                  = 3,
	EGeometryScriptEvaluateSplineRange_MAX   = 4,
};

// Enum GeometryScriptingCore.EGeometryScriptPixelSamplingMethod
// NumValues: 0x0003
enum class EGeometryScriptPixelSamplingMethod : uint8
{
	Bilinear                                 = 0,
	Nearest                                  = 1,
	EGeometryScriptPixelSamplingMethod_MAX   = 2,
};

// Enum GeometryScriptingCore.EDistanceFieldComputeMode
// NumValues: 0x0003
enum class EDistanceFieldComputeMode : uint8
{
	NarrowBand                               = 0,
	FullGrid                                 = 1,
	EDistanceFieldComputeMode_MAX            = 2,
};

// Enum GeometryScriptingCore.EDistanceFieldUnits
// NumValues: 0x0003
enum class EDistanceFieldUnits : uint8
{
	NumberOfVoxels                           = 0,
	Distance                                 = 1,
	EDistanceFieldUnits_MAX                  = 2,
};

// ScriptStruct GeometryScriptingCore.GeometryScriptMeshReadLOD
// 0x0008 (0x0008 - 0x0000)
struct FGeometryScriptMeshReadLOD final
{
public:
	EGeometryScriptLODType                        LODType;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LODIndex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptMeshReadLOD;

// ScriptStruct GeometryScriptingCore.GeometryScriptPruneBoneWeightsOptions
// 0x0002 (0x0002 - 0x0000)
struct FGeometryScriptPruneBoneWeightsOptions final
{
public:
	EGeometryScriptPruneBoneWeightsAssignmentType ReassignmentType;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoredInvalidBones;                              // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptPruneBoneWeightsOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptMeshWriteLOD
// 0x0008 (0x0008 - 0x0000)
struct FGeometryScriptMeshWriteLOD final
{
public:
	bool                                          bWriteHiResSource;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LODIndex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptMeshWriteLOD;

// ScriptStruct GeometryScriptingCore.GeometryScriptSimpleCollision
// 0x0080 (0x0080 - 0x0000)
struct FGeometryScriptSimpleCollision final
{
public:
	struct FKAggregateGeom                        AggGeom;                                           // 0x0000(0x0080)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptSimpleCollision;

// ScriptStruct GeometryScriptingCore.GeometryScriptBakeVertexOptions
// 0x000C (0x000C - 0x0000)
struct FGeometryScriptBakeVertexOptions final
{
public:
	bool                                          bSplitAtNormalSeams;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSplitAtUVSeams;                                   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProjectionDistance;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProjectionInWorldSpace;                           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeometryScriptBakeVertexOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptSphereCovering
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FGeometryScriptSphereCovering final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeometryScriptSphereCovering;

// ScriptStruct GeometryScriptingCore.GeometryScriptSimpleMeshBuffers
// 0x00D0 (0x00D0 - 0x0000)
struct FGeometryScriptSimpleMeshBuffers final
{
public:
	TArray<struct FVector>                        Vertices;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Normals;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV0;                                               // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV1;                                               // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV2;                                               // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV3;                                               // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV4;                                               // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV5;                                               // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV6;                                               // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV7;                                               // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   VertexColors;                                      // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FIntVector>                     Triangles;                                         // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 TriGroupIDs;                                       // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptSimpleMeshBuffers;

// ScriptStruct GeometryScriptingCore.GeometryScriptExpMapUVOptions
// 0x0008 (0x0008 - 0x0000)
struct FGeometryScriptExpMapUVOptions final
{
public:
	int32                                         NormalSmoothingRounds;                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalSmoothingAlpha;                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptExpMapUVOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptGroupLayer
// 0x0008 (0x0008 - 0x0000)
struct FGeometryScriptGroupLayer final
{
public:
	bool                                          bDefaultLayer;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ExtendedLayerIndex;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptGroupLayer;

// ScriptStruct GeometryScriptingCore.GeometryScriptRepackUVsOptions
// 0x0008 (0x0008 - 0x0000)
struct FGeometryScriptRepackUVsOptions final
{
public:
	int32                                         TargetImageWidth;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOptimizeIslandRotation;                           // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeometryScriptRepackUVsOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptPatchBuilderOptions
// 0x0034 (0x0034 - 0x0000)
struct FGeometryScriptPatchBuilderOptions final
{
public:
	int32                                         InitialPatchCount;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinPatchSize;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PatchCurvatureAlignmentWeight;                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PatchMergingMetricThresh;                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PatchMergingAngleThresh;                           // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptExpMapUVOptions         ExpMapOptions;                                     // 0x0014(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRespectInputGroups;                               // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryScriptGroupLayer              GroupLayer;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bAutoPack;                                         // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryScriptRepackUVsOptions        PackingOptions;                                    // 0x002C(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptPatchBuilderOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptSimpleCollisionTriangulationOptions
// 0x0010 (0x0010 - 0x0000)
struct FGeometryScriptSimpleCollisionTriangulationOptions final
{
public:
	int32                                         SphereStepsPerSide;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CapsuleHemisphereSteps;                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CapsuleCircleSteps;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApproximateLevelSetsWithCubes;                    // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeometryScriptSimpleCollisionTriangulationOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptTriangle
// 0x0048 (0x0048 - 0x0000)
struct FGeometryScriptTriangle final
{
public:
	struct FVector                                Vector0;                                           // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Vector1;                                           // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Vector2;                                           // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptTriangle;

// ScriptStruct GeometryScriptingCore.GeometryScriptTrianglePoint
// 0x0038 (0x0038 - 0x0000)
struct FGeometryScriptTrianglePoint final
{
public:
	bool                                          bValid;                                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TriangleID;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                position;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BaryCoords;                                        // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptTrianglePoint;

// ScriptStruct GeometryScriptingCore.GeometryScriptSmoothBoneWeightsOptions
// 0x0010 (0x0010 - 0x0000)
struct FGeometryScriptSmoothBoneWeightsOptions final
{
public:
	EGeometryScriptSmoothBoneWeightsType          DistanceWeighingType;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Stiffness;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxInfluences;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VoxelResolution;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptSmoothBoneWeightsOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptUVTriangle
// 0x0030 (0x0030 - 0x0000)
struct FGeometryScriptUVTriangle final
{
public:
	struct FVector2D                              UV0;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV1;                                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV2;                                               // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptUVTriangle;

// ScriptStruct GeometryScriptingCore.GeometryScriptMeshPlaneSliceOptions
// 0x0014 (0x0014 - 0x0000)
struct FGeometryScriptMeshPlaneSliceOptions final
{
public:
	bool                                          bFillHoles;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HoleFillMaterialID;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFillSpans;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GapWidth;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UVWorldDimension;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptMeshPlaneSliceOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptSplineSamplingOptions
// 0x0014 (0x0014 - 0x0000)
struct FGeometryScriptSplineSamplingOptions final
{
public:
	int32                                         NumSamples;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ErrorTolerance;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryScriptSampleSpacing                  SampleSpacing;                                     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESplineCoordinateSpace                        CoordinateSpace;                                   // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryScriptEvaluateSplineRange            RangeMethod;                                       // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RangeStart;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RangeEnd;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptSplineSamplingOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptColorFlags
// 0x0004 (0x0004 - 0x0000)
struct FGeometryScriptColorFlags final
{
public:
	bool                                          bRed;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGreen;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlue;                                             // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlpha;                                            // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptColorFlags;

// ScriptStruct GeometryScriptingCore.ComputeNegativeSpaceOptions
// 0x0028 (0x0028 - 0x0000)
struct FComputeNegativeSpaceOptions final
{
public:
	ENegativeSpaceSampleMethod                    SampleMethod;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireSearchSampleCoverage;                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyConnectedToHull;                              // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxVoxelsPerDim;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetNumSamples;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinSampleSpacing;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        NegativeSpaceTolerance;                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MinRadius;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FComputeNegativeSpaceOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptMergeSimpleCollisionOptions
// 0x0070 (0x0070 - 0x0000)
struct FGeometryScriptMergeSimpleCollisionOptions final
{
public:
	int32                                         MaxShapeCount;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ErrorTolerance;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MinThicknessTolerance;                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsiderAllPossibleMerges;                        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryScriptSphereCovering          PrecomputedNegativeSpace;                          // 0x0020(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bComputeNegativeSpace;                             // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComputeNegativeSpaceOptions           ComputeNegativeSpaceOptions;                       // 0x0038(0x0028)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FGeometryScriptSimpleCollisionTriangulationOptions ShapeToHullTriangulation;              // 0x0060(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptMergeSimpleCollisionOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptIndexList
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FGeometryScriptIndexList final
{
public:
	EGeometryScriptIndexType                      IndexType;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x17];                                       // 0x0001(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeometryScriptIndexList;

// ScriptStruct GeometryScriptingCore.GeometryScriptBoneWeight
// 0x0008 (0x0008 - 0x0000)
struct FGeometryScriptBoneWeight final
{
public:
	int32                                         BoneIndex;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptBoneWeight;

// ScriptStruct GeometryScriptingCore.GeometryScriptConvexDecompositionOptions
// 0x0028 (0x0028 - 0x0000)
struct FGeometryScriptConvexDecompositionOptions final
{
public:
	int32                                         NumHulls;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SearchFactor;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ErrorTolerance;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MinPartThickness;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SimplifyToFaceCount;                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeometryScriptConvexDecompositionOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptTriangleList
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FGeometryScriptTriangleList final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeometryScriptTriangleList;

// ScriptStruct GeometryScriptingCore.GeometryScriptCopyBonesFromMeshOptions
// 0x0002 (0x0002 - 0x0000)
struct FGeometryScriptCopyBonesFromMeshOptions final
{
public:
	bool                                          ReindexWeights;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBonesToCopyFromSource                        BonesToCopyFromSource;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptCopyBonesFromMeshOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptPointPriorityOptions
// 0x0018 (0x0018 - 0x0000)
struct FGeometryScriptPointPriorityOptions final
{
public:
	TArray<float>                                 OptionalPriorityWeights;                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUniformSpacing;                                   // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeometryScriptPointPriorityOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptScalarList
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FGeometryScriptScalarList final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeometryScriptScalarList;

// ScriptStruct GeometryScriptingCore.GeometryScriptVectorList
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FGeometryScriptVectorList final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeometryScriptVectorList;

// ScriptStruct GeometryScriptingCore.GeometryScriptTransformCollisionOptions
// 0x0002 (0x0002 - 0x0000)
struct FGeometryScriptTransformCollisionOptions final
{
public:
	bool                                          bWarnOnInvalidTransforms;                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCenterTransformPivotPerShape;                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryScriptTransformCollisionOptions;

// ScriptStruct GeometryScriptingCore.GeometryScriptFillHolesOptions
// 0x0002 (0x0002 - 0x0000)
struct FGeometryScriptFillHolesOptions final
{
public:
