#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GetPointBehindParentAwayFromAttacker_TK

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GetPointBehindParentAwayFromAttacker_TK.GetPointBehindParentAwayFromAttacker_TK_C
// 0x0068 (0x0110 - 0x00A8)
class UGetPointBehindParentAwayFromAttacker_TK_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        FixedDistance;                                     // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RandomDistance;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 NavigationTargetKey;                               // 0x00C0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 NavigationTargetActor;                             // 0x00E8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_GetPointBehindParentAwayFromAttacker_TK(int32 EntryPoint);
	void ReceiveExecute(class AActor* OwnerActor);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GetPointBehindParentAwayFromAttacker_TK_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GetPointBehindParentAwayFromAttacker_TK_C")
	}
	static class UGetPointBehindParentAwayFromAttacker_TK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGetPointBehindParentAwayFromAttacker_TK_C>();
	}
};
DUMPER7_ASSERTS_UGetPointBehindParentAwayFromAttacker_TK_C;

}

