#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HairStrandsDeformer

#include "Basic.hpp"

#include "OptimusCore_classes.hpp"
#include "ComputeFramework_classes.hpp"
#include "HairStrandsDeformer_structs.hpp"


namespace SDK
{

// Class HairStrandsDeformer.OptimusGroomDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGroomDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGroomDataInterface")
	}
	static class UOptimusGroomDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusGroomDataInterface;

// Class HairStrandsDeformer.OptimusGroomDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomDataProvider final : public UComputeDataProvider
{
public:
	class UGroomComponent*                        Groom;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGroomDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGroomDataProvider")
	}
	static class UOptimusGroomDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusGroomDataProvider;

// Class HairStrandsDeformer.OptimusGroomExecDataInterface
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomExecDataInterface final : public UOptimusComputeDataInterface
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EOptimusGroomExecDomain                       domain;                                            // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGroomExecDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGroomExecDataInterface")
	}
	static class UOptimusGroomExecDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomExecDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusGroomExecDataInterface;

// Class HairStrandsDeformer.OptimusGroomExecDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomExecDataProvider final : public UComputeDataProvider
{
public:
	class UGroomComponent*                        GroomComponent;                                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	EOptimusGroomExecDomain                       domain;                                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGroomExecDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGroomExecDataProvider")
	}
	static class UOptimusGroomExecDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomExecDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusGroomExecDataProvider;

// Class HairStrandsDeformer.OptimusGroomGuideDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomGuideDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGroomGuideDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGroomGuideDataInterface")
	}
	static class UOptimusGroomGuideDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuideDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusGroomGuideDataInterface;

// Class HairStrandsDeformer.OptimusGroomGuideDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomGuideDataProvider final : public UComputeDataProvider
{
public:
	class UGroomComponent*                        Groom;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGroomGuideDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGroomGuideDataProvider")
	}
	static class UOptimusGroomGuideDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuideDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusGroomGuideDataProvider;

// Class HairStrandsDeformer.OptimusGroomWriteDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomWriteDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGroomWriteDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGroomWriteDataInterface")
	}
	static class UOptimusGroomWriteDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomWriteDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusGroomWriteDataInterface;

// Class HairStrandsDeformer.OptimusGroomWriteDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomWriteDataProvider final : public UComputeDataProvider
{
public:
	class UGroomComponent*                        GroomComponent;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGroomWriteDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGroomWriteDataProvider")
	}
	static class UOptimusGroomWriteDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomWriteDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusGroomWriteDataProvider;

// Class HairStrandsDeformer.OptimusGroomComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGroomComponentSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGroomComponentSource")
	}
	static class UOptimusGroomComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomComponentSource>();
	}
};
DUMPER7_ASSERTS_UOptimusGroomComponentSource;

}

