#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HairStrandsCore

#include "Basic.hpp"

#include "HairStrandsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Niagara_classes.hpp"
#include "Engine_classes.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class HairStrandsCore.GroomCacheImportOptions
// 0x0068 (0x0090 - 0x0028)
class UGroomCacheImportOptions final : public UObject
{
public:
	struct FGroomCacheImportSettings              ImportSettings;                                    // 0x0028(0x0068)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCacheImportOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCacheImportOptions")
	}
	static class UGroomCacheImportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCacheImportOptions>();
	}
};
DUMPER7_ASSERTS_UGroomCacheImportOptions;

// Class HairStrandsCore.GroomCacheImportData
// 0x0068 (0x0090 - 0x0028)
class UGroomCacheImportData final : public UAssetImportData
{
public:
	struct FGroomCacheImportSettings              Settings;                                          // 0x0028(0x0068)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCacheImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCacheImportData")
	}
	static class UGroomCacheImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCacheImportData>();
	}
};
DUMPER7_ASSERTS_UGroomCacheImportData;

// Class HairStrandsCore.GroomActor
// 0x0008 (0x0488 - 0x0480)
class AGroomActor final : public AActor
{
public:
	class UGroomComponent*                        GroomComponent;                                    // 0x0480(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomActor")
	}
	static class AGroomActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGroomActor>();
	}
};
DUMPER7_ASSERTS_AGroomActor;

// Class HairStrandsCore.GroomAsset
// 0x0100 (0x0128 - 0x0028)
class UGroomAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EGroomLODMode                                 LODMode;                                           // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AutoLODBias;                                       // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FHairGroupInfoWithVisibility>   HairGroupsInfo;                                    // 0x0038(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsRendering>           HairGroupsRendering;                               // 0x0048(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsPhysics>             HairGroupsPhysics;                                 // 0x0058(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsInterpolation>       HairGroupsInterpolation;                           // 0x0068(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsLOD>                 HairGroupsLOD;                                     // 0x0078(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsCardsSourceDescription> HairGroupsCards;                                // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsMeshesSourceDescription> HairGroupsMeshes;                              // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsMaterial>            HairGroupsMaterials;                               // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          EnableGlobalInterpolation;                         // 0x00B8(0x0001)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableSimulationCache;                             // 0x00B9(0x0001)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomInterpolationType                       HairInterpolationType;                             // 0x00BA(0x0001)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          RiggedSkeletalMesh;                                // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<int32>                                 DeformedGroupSections;                             // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPerPlatformInt                        MinLOD;                                            // 0x00D8(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerPlatformBool                       DisableBelowMinLodStripping;                       // 0x00DC(0x0001)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 EffectiveLODBias;                                  // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x20];                                      // 0x00F0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x0110(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<int32> GetDeformedGroupSections();
	TArray<struct FHairGroupsCardsSourceDescription> GetHairGroupsCards();
	TArray<struct FHairGroupsInterpolation> GetHairGroupsInterpolation();
	TArray<struct FHairGroupsLOD> GetHairGroupsLOD();
	TArray<struct FHairGroupsMaterial> GetHairGroupsMaterials();
	TArray<struct FHairGroupsMeshesSourceDescription> GetHairGroupsMeshes();
	TArray<struct FHairGroupsPhysics> GetHairGroupsPhysics();
	TArray<struct FHairGroupsRendering> GetHairGroupsRendering();
	void SetDeformedGroupSections(const TArray<int32>& In);
	void SetEnableGlobalInterpolation(bool In);
	void SetEnableSimulationCache(bool In);
	void SetHairGroupsCards(const TArray<struct FHairGroupsCardsSourceDescription>& In);
	void SetHairGroupsInterpolation(const TArray<struct FHairGroupsInterpolation>& In);
	void SetHairGroupsLOD(const TArray<struct FHairGroupsLOD>& In);
	void SetHairGroupsMaterials(const TArray<struct FHairGroupsMaterial>& In);
	void SetHairGroupsMeshes(const TArray<struct FHairGroupsMeshesSourceDescription>& In);
	void SetHairGroupsPhysics(const TArray<struct FHairGroupsPhysics>& In);
	void SetHairGroupsRendering(const TArray<struct FHairGroupsRendering>& In);
	void SetHairInterpolationType(EGroomInterpolationType In);
	void SetRiggedSkeletalMesh(class USkeletalMesh* In);

	bool GetEnableGlobalInterpolation() const;
	bool GetEnableSimulationCache() const;
	EGroomInterpolationType GetHairInterpolationType() const;
	class USkeletalMesh* GetRiggedSkeletalMesh() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomAsset")
	}
	static class UGroomAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomAsset>();
	}
};
DUMPER7_ASSERTS_UGroomAsset;

// Class HairStrandsCore.HairCardGenerationSettings
// 0x0000 (0x0028 - 0x0028)
class UHairCardGenerationSettings final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HairCardGenerationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HairCardGenerationSettings")
	}
	static class UHairCardGenerationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHairCardGenerationSettings>();
	}
};
DUMPER7_ASSERTS_UHairCardGenerationSettings;

// Class HairStrandsCore.GroomAssetImportData
// 0x0010 (0x0038 - 0x0028)
class UGroomAssetImportData final : public UAssetImportData
{
public:
	class UGroomImportOptions*                    ImportOptions;                                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UGroomCreateStrandsTexturesOptions*     HairStrandsTexturesOptions;                        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomAssetImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomAssetImportData")
	}
	static class UGroomAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomAssetImportData>();
	}
};
DUMPER7_ASSERTS_UGroomAssetImportData;

// Class HairStrandsCore.GroomBindingAsset
// 0x0098 (0x00C0 - 0x0028)
class alignas(0x10) UGroomBindingAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EGroomBindingMeshType                         GroomBindingType;                                  // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomAsset*                            Groom;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class UGeometryCache*                         SourceGeometryCache;                               // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class UGeometryCache*                         TargetGeometryCache;                               // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	int32                                         NumInterpolationPoints;                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MatchingSection;                                   // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGoomBindingGroupInfo>          GroupInfos;                                        // 0x0068(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x48];                                      // 0x0078(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetGroom(class UGroomAsset* InGroom);
	void SetGroomBindingType(EGroomBindingMeshType InGroomBindingType);
	void SetGroupInfos(const TArray<struct FGoomBindingGroupInfo>& InGroupInfos);
	void SetMatchingSection(int32 InMatchingSection);
	void SetNumInterpolationPoints(int32 InNumInterpolationPoints);
	void SetSourceGeometryCache(class UGeometryCache* InGeometryCache);
	void SetSourceSkeletalMesh(class USkeletalMesh* InSkeletalMesh);
	void SetTargetGeometryCache(class UGeometryCache* InGeometryCache);
	void SetTargetSkeletalMesh(class USkeletalMesh* InSkeletalMesh);

	class UGroomAsset* GetGroom() const;
	EGroomBindingMeshType GetGroomBindingType() const;
	const TArray<struct FGoomBindingGroupInfo> GetGroupInfos() const;
	int32 GetMatchingSection() const;
	int32 GetNumInterpolationPoints() const;
	class UGeometryCache* GetSourceGeometryCache() const;
	class USkeletalMesh* GetSourceSkeletalMesh() const;
	class UGeometryCache* GetTargetGeometryCache() const;
	class USkeletalMesh* GetTargetSkeletalMesh() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomBindingAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomBindingAsset")
	}
	static class UGroomBindingAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomBindingAsset>();
	}
};
DUMPER7_ASSERTS_UGroomBindingAsset;

// Class HairStrandsCore.GroomBindingAssetList
// 0x0010 (0x0038 - 0x0028)
class UGroomBindingAssetList final : public UObject
{
public:
	TArray<class UGroomBindingAsset*>             Bindings;                                          // 0x0028(0x0010)(Edit, EditFixedSize, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomBindingAssetList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomBindingAssetList")
	}
	static class UGroomBindingAssetList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomBindingAssetList>();
	}
};
DUMPER7_ASSERTS_UGroomBindingAssetList;

// Class HairStrandsCore.GroomBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UGroomBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UGroomBindingAsset* CreateNewGeometryCacheGroomBindingAsset(class UGroomAsset* GroomAsset, class UGeometryCache* GeometryCache, int32 NumInterpolationPoints, class UGeometryCache* SourceGeometryCacheForTransfer, int32 MatchingSection);
	static class UGroomBindingAsset* CreateNewGeometryCacheGroomBindingAssetWithPath(const class FString& DesiredPackagePath, class UGroomAsset* GroomAsset, class UGeometryCache* GeometryCache, int32 NumInterpolationPoints, class UGeometryCache* SourceGeometryCacheForTransfer, int32 MatchingSection);
	static class UGroomBindingAsset* CreateNewGroomBindingAsset(class UGroomAsset* InGroomAsset, class USkeletalMesh* InSkeletalMesh, int32 InNumInterpolationPoints, class USkeletalMesh* InSourceSkeletalMeshForTransfer, int32 InMatchingSection);
	static class UGroomBindingAsset* CreateNewGroomBindingAssetWithPath(const class FString& InDesiredPackagePath, class UGroomAsset* InGroomAsset, class USkeletalMesh* InSkeletalMesh, int32 InNumInterpolationPoints, class USkeletalMesh* InSourceSkeletalMeshForTransfer, int32 InMatchingSection);
	static bool IsHairStrandsSupportedInWorld(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomBlueprintLibrary")
	}
	static class UGroomBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UGroomBlueprintLibrary;

// Class HairStrandsCore.GroomCache
// 0x0060 (0x0088 - 0x0028)
class UGroomCache final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x0040(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FGroomCacheInfo                        GroomCacheInfo;                                    // 0x0050(0x0028)(Edit, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCache")
	}
	static class UGroomCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCache>();
	}
};
DUMPER7_ASSERTS_UGroomCache;

// Class HairStrandsCore.GroomComponent
// 0x0230 (0x0860 - 0x0630)
class UGroomComponent final : public UMeshComponent
{
public:
	uint8                                         Pad_630[0x10];                                     // 0x0630(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomAsset*                            GroomAsset;                                        // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UGroomCache*                            GroomCache;                                        // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<class UNiagaraComponent*>              NiagaraComponents;                                 // 0x0650(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0660(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UGroomBindingAsset*                     BindingAsset;                                      // 0x0668(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_678[0x10];                                     // 0x0678(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHairSimulationSettings                SimulationSettings;                                // 0x0688(0x0090)(Edit, BlueprintVisible, Interp, NativeAccessSpecifierPublic)
	class UMeshDeformer*                          MeshDeformer;                                      // 0x0718(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UMeshDeformerInstance*                  MeshDeformerInstance;                              // 0x0720(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UMeshDeformerInstanceSettings*          MeshDeformerInstanceSettings;                      // 0x0728(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UMaterialInterface*                     Strands_DebugMaterial;                             // 0x0730(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UMaterialInterface*                     Strands_DefaultMaterial;                           // 0x0738(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UMaterialInterface*                     Cards_DefaultMaterial;                             // 0x0740(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UMaterialInterface*                     Meshes_DefaultMaterial;                            // 0x0748(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UNiagaraSystem*                         AngularSpringsSystem;                              // 0x0750(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UNiagaraSystem*                         CosseratRodsSystem;                                // 0x0758(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class FString                                 AttachmentName;                                    // 0x0760(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Interp, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_770[0x90];                                     // 0x0770(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHairGroupDesc>                 GroomGroupsDesc;                                   // 0x0800(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseCards;                                         // 0x0810(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRunning;                                          // 0x0811(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLooping;                                          // 0x0812(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bManualTick;                                       // 0x0813(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ElapsedTime;                                       // 0x0814(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_818[0x48];                                     // 0x0818(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddCollisionComponent(class USkeletalMeshComponent* SkeletalMeshComponent);
	bool GetIsHairLengthScaleEnabled();
	class UNiagaraComponent* GetNiagaraComponent(const int32 GroupIndex);
	void ResetCollisionComponents();
	void ResetSimulation();
	void SetBindingAsset(class UGroomBindingAsset* InBinding);
	void SetEnableSimulation(bool bInEnableSimulation);
	void SetGroomAsset(class UGroomAsset* Asset);
	void SetGroomCache(class UGroomCache* InGroomCache);
	void SetHairLengthScale(float Scale);
	void SetHairLengthScaleEnable(bool bEnable);
	void SetMeshDeformer(class UMeshDeformer* InMeshDeformer);
	void SetPhysicsAsset(class UPhysicsAsset* InPhysicsAsset);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomComponent")
	}
	static class UGroomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomComponent>();
	}
};
DUMPER7_ASSERTS_UGroomComponent;

// Class HairStrandsCore.GroomCreateBindingOptions
// 0x0038 (0x0060 - 0x0028)
class UGroomCreateBindingOptions final : public UObject
{
public:
	TWeakObjectPtr<class UGroomAsset>             GroomAsset;                                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomBindingMeshType                         GroomBindingType;                                  // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UGeometryCache*                         SourceGeometryCache;                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UGeometryCache*                         TargetGeometryCache;                               // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	int32                                         NumInterpolationPoints;                            // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MatchingSection;                                   // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCreateBindingOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCreateBindingOptions")
	}
	static class UGroomCreateBindingOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCreateBindingOptions>();
	}
};
DUMPER7_ASSERTS_UGroomCreateBindingOptions;

// Class HairStrandsCore.GroomCreateFollicleMaskOptions
// 0x0018 (0x0040 - 0x0028)
class UGroomCreateFollicleMaskOptions final : public UObject
{
public:
	int32                                         Resolution;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RootRadius;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFollicleMaskOptions>           Grooms;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCreateFollicleMaskOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCreateFollicleMaskOptions")
	}
	static class UGroomCreateFollicleMaskOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCreateFollicleMaskOptions>();
	}
};
DUMPER7_ASSERTS_UGroomCreateFollicleMaskOptions;

// Class HairStrandsCore.GroomCreateStrandsTexturesOptions
// 0x0050 (0x0078 - 0x0028)
class UGroomCreateStrandsTexturesOptions final : public UObject
{
public:
	EHairTextureLayout                            layout;                                            // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Resolution;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStrandsTexturesTraceType                     TraceType;                                         // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TraceDistance;                                     // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStrandsTexturesMeshType                      MeshType;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StaticMesh;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	int32                                         LODIndex;                                          // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UVChannelIndex;                                    // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 GroupIndex;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         Dilation;                                          // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCreateStrandsTexturesOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCreateStrandsTexturesOptions")
	}
	static class UGroomCreateStrandsTexturesOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCreateStrandsTexturesOptions>();
	}
};
DUMPER7_ASSERTS_UGroomCreateStrandsTexturesOptions;

// Class HairStrandsCore.GroomImportOptions
// 0x0040 (0x0068 - 0x0028)
class UGroomImportOptions final : public UObject
{
public:
	struct FGroomConversionSettings               ConversionSettings;                                // 0x0028(0x0030)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsInterpolation>       InterpolationSettings;                             // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomImportOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomImportOptions")
	}
	static class UGroomImportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomImportOptions>();
	}
};
DUMPER7_ASSERTS_UGroomImportOptions;

// Class HairStrandsCore.GroomHairGroupsPreview
// 0x0010 (0x0038 - 0x0028)
class UGroomHairGroupsPreview final : public UObject
{
public:
	TArray<struct FGroomHairGroupPreview>         Groups;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomHairGroupsPreview")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomHairGroupsPreview")
	}
	static class UGroomHairGroupsPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomHairGroupsPreview>();
	}
};
DUMPER7_ASSERTS_UGroomHairGroupsPreview;

// Class HairStrandsCore.GroomPluginSettings
// 0x0008 (0x0030 - 0x0028)
class UGroomPluginSettings final : public UObject
{
public:
	float                                         GroomCacheLookAheadBuffer;                         // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomPluginSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomPluginSettings")
	}
	static class UGroomPluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomPluginSettings>();
	}
};
DUMPER7_ASSERTS_UGroomPluginSettings;

// Class HairStrandsCore.MovieSceneGroomCacheSection
// 0x0020 (0x0118 - 0x00F8)
class UMovieSceneGroomCacheSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneGroomCacheParams            Params_0;                                          // 0x00F8(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneGroomCacheSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneGroomCacheSection")
	}
	static class UMovieSceneGroomCacheSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGroomCacheSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneGroomCacheSection;

// Class HairStrandsCore.MovieSceneGroomCacheTrack
// 0x0018 (0x0110 - 0x00F8)
class UMovieSceneGroomCacheTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             AnimationSections;                                 // 0x0100(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneGroomCacheTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneGroomCacheTrack")
	}
	static class UMovieSceneGroomCacheTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGroomCacheTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneGroomCacheTrack;

// Class HairStrandsCore.NiagaraDataInterfaceHairStrands
// 0x0020 (0x0058 - 0x0038)
class UNiagaraDataInterfaceHairStrands final : public UNiagaraDataInterface
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomAsset*                            DefaultSource;                                     // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class AActor*                                 SourceActor;                                       // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceHairStrands")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceHairStrands")
	}
	static class UNiagaraDataInterfaceHairStrands* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceHairStrands>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceHairStrands;

// Class HairStrandsCore.NiagaraDataInterfaceVelocityGrid
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceVelocityGrid : public UNiagaraDataInterfaceRWBase
{
public:
	struct FIntVector                             GridSize;                                          // 0x0038(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceVelocityGrid")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceVelocityGrid")
	}
	static class UNiagaraDataInterfaceVelocityGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceVelocityGrid>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceVelocityGrid;

// Class HairStrandsCore.NiagaraDataInterfacePressureGrid
// 0x0000 (0x0048 - 0x0048)
class UNiagaraDataInterfacePressureGrid final : public UNiagaraDataInterfaceVelocityGrid
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfacePressureGrid")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfacePressureGrid")
	}
	static class UNiagaraDataInterfacePressureGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfacePressureGrid>();
	}
};
