#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HarnessStructureBase

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass HarnessStructureBase.HarnessStructureBase_C
// 0x0060 (0x0BA0 - 0x0B40)
class AHarnessStructureBase_C final : public APrimalStructure
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          BuildingBounds;                                    // 0x0B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        HarnessSounds;                                     // 0x0B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       StasisComponent;                                   // 0x0B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        OverrideAttachedTurretMaxYawRange;                 // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCreatureMoving;                                  // 0x0B68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCreatureRunning;                                 // 0x0B69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6A[0x6];                                      // 0x0B6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundCue*                              MovingSound;                                       // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              RunningSound;                                      // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              LandingSound;                                      // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ConsumablesTransferInterval;                       // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ConsumablesTransferRange;                          // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TransferConsumableTimer;                           // 0x0B98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPPostLoadedFromSaveGame();
	void ClientSpeedUpdate();
	void ExecuteUbergraph_HarnessStructureBase(int32 EntryPoint);
	struct FVector GetAttachedTurretYawLimitsOverride(class APrimalStructure* ForStructure, double* ReturnValue_X, double* ReturnValue_Y, double* ReturnValue_Z);
	void MovementModeChanged(EMovementMode PrevMode, EMovementMode NewMode);
	void Multi_PlayLandingSound();
	void MySpeedChanged(bool bIsMoving, bool bIsRunning);
	void ReceiveBeginPlay();
	void SpeedChanged();
	void TryTransferConsumable();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HarnessStructureBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HarnessStructureBase_C")
	}
	static class AHarnessStructureBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHarnessStructureBase_C>();
	}
};
DUMPER7_ASSERTS_AHarnessStructureBase_C;

}

