#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoldoutComposite

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class HoldoutComposite.HoldoutCompositeComponent
// 0x0000 (0x0260 - 0x0260)
class UHoldoutCompositeComponent final : public USceneComponent
{
public:
	bool                                          bIsEnabled;                                        // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetEnabled(bool bInEnabled);

	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoldoutCompositeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoldoutCompositeComponent")
	}
	static class UHoldoutCompositeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoldoutCompositeComponent>();
	}
};
DUMPER7_ASSERTS_UHoldoutCompositeComponent;

// Class HoldoutComposite.HoldoutCompositeSubsystem
// 0x0010 (0x0040 - 0x0030)
class UHoldoutCompositeSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RegisterPrimitive(TSoftObjectPtr<class UPrimitiveComponent> InPrimitiveComponent, bool bInHoldoutState);
	void UnregisterPrimitive(TSoftObjectPtr<class UPrimitiveComponent> InPrimitiveComponent, bool bInHoldoutState);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoldoutCompositeSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoldoutCompositeSubsystem")
	}
	static class UHoldoutCompositeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoldoutCompositeSubsystem>();
	}
};
DUMPER7_ASSERTS_UHoldoutCompositeSubsystem;

// Class HoldoutComposite.HoldoutCompositeSettings
// 0x0018 (0x0050 - 0x0038)
class UHoldoutCompositeSettings final : public UDeveloperSettings
{
public:
	bool                                          bCompositeFollowsSceneExposure;                    // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompositeSupportsSSR;                             // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SceneViewExtensionPriority;                        // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 DisabledPrimitiveClasses;                          // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoldoutCompositeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoldoutCompositeSettings")
	}
	static class UHoldoutCompositeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoldoutCompositeSettings>();
	}
};
DUMPER7_ASSERTS_UHoldoutCompositeSettings;

}

