#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoudiniEngineRuntime

#include "Basic.hpp"

#include "HoudiniEngineRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class HoudiniEngineRuntime.HoudiniAsset
// 0x0028 (0x0050 - 0x0028)
class UHoudiniAsset final : public UObject
{
public:
	class FString                                 AssetFileName;                                     // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 AssetBytes;                                        // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint32                                        AssetBytesCount;                                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetLimitedCommercial;                           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetNonCommercial;                               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetExpanded;                                    // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAsset")
	}
	static class UHoudiniAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAsset>();
	}
};
DUMPER7_ASSERTS_UHoudiniAsset;

// Class HoudiniEngineRuntime.HoudiniAssetActor
// 0x0008 (0x0488 - 0x0480)
class AHoudiniAssetActor final : public AActor
{
public:
	class UHoudiniAssetComponent*                 HoudiniAssetComponent;                             // 0x0480(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetActor")
	}
	static class AHoudiniAssetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHoudiniAssetActor>();
	}
};
DUMPER7_ASSERTS_AHoudiniAssetActor;

// Class HoudiniEngineRuntime.HoudiniAssetComponent
// 0x0530 (0x0B30 - 0x0600)
class UHoudiniAssetComponent : public UPrimitiveComponent
{
public:
	uint8                                         Pad_5F8[0x8];                                      // 0x05F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UHoudiniAsset*                          HoudiniAsset;                                      // 0x0600(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	bool                                          bCookOnParameterChange;                            // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUploadTransformsToHoudiniEngine;                  // 0x0609(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnTransformChange;                            // 0x060A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnAssetInputCook;                             // 0x060B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputless;                                       // 0x060C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputTemplateGeos;                               // 0x060D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOutputNodes;                                   // 0x060E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60F[0x1];                                      // 0x060F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         TemporaryCookFolder;                               // 0x0610(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         BakeFolder;                                        // 0x0620(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSplitMeshSupport;                                 // 0x0630(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHoudiniStaticMeshGenerationProperties StaticMeshGenerationProperties;                    // 0x0638(0x01A0)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMeshBuildSettings                     StaticMeshBuildSettings;                           // 0x07D8(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideGlobalProxyStaticMeshSettings;            // 0x0820(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshOverride;                    // 0x0821(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementByTimerOverride;   // 0x0822(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_823[0x1];                                      // 0x0823(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProxyMeshAutoRefineTimeoutSecondsOverride;         // 0x0824(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementOnPreSaveWorldOverride; // 0x0828(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementOnPreBeginPIEOverride; // 0x0829(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82A[0x2];                                      // 0x082A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AssetId;                                           // 0x082C(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                 NodeIdsToCook;                                     // 0x0830(0x0010)(ZeroConstructor, Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TMap<int32, int32>                            OutputNodeCookCounts;                              // 0x0840(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TSet<class UHoudiniAssetComponent*>           DownstreamHoudiniAssets;                           // 0x0890(0x0050)(ExportObject, DuplicateTransient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	struct FGuid                                  ComponentGUID;                                     // 0x08E0(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  HapiGUID;                                          // 0x08F0(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 HapiAssetName;                                     // 0x0900(0x0010)(ZeroConstructor, DuplicateTransient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetState                            AssetState;                                        // 0x0910(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetState                            DebugLastAssetState;                               // 0x0911(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetStateResult                      AssetStateResult;                                  // 0x0912(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_913[0xD];                                      // 0x0913(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LastComponentTransform;                            // 0x0920(0x0060)(DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        SubAssetIndex;                                     // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AssetCookCount;                                    // 0x0984(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasBeenLoaded;                                    // 0x0988(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasBeenDuplicated;                                // 0x0989(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPendingDelete;                                    // 0x098A(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRecookRequested;                                  // 0x098B(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRebuildRequested;                                 // 0x098C(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableCooking;                                    // 0x098D(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceNeedUpdate;                                  // 0x098E(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLastCookSuccess;                                  // 0x098F(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bParameterDefinitionUpdateNeeded;                  // 0x0990(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlueprintStructureModified;                       // 0x0991(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlueprintModified;                                // 0x0992(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_993[0x5];                                      // 0x0993(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniParameter*>              Parameters;                                        // 0x0998(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class UHoudiniInput*>                  Inputs;                                            // 0x09A8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class UHoudiniOutput*>                 Outputs;                                           // 0x09B8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<struct FHoudiniBakedOutput>            BakedOutputs;                                      // 0x09C8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          UntrackedOutputs;                                  // 0x09D8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UHoudiniHandleComponent*>        HandleComponents;                                  // 0x09E8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	bool                                          bHasComponentTransformChanged;                     // 0x09F8(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFullyLoaded;                                      // 0x09F9(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9FA[0x6];                                      // 0x09FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHoudiniPDGAssetLink*                   PDGAssetLink;                                      // 0x0A00(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	bool                                          bIsPDGAssetLinkInitialized;                        // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A09[0x7];                                      // 0x0A09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           RefineMeshesTimer;                                 // 0x0A10(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A18[0x18];                                     // 0x0A18(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bNoProxyMeshNextCookRequested;                     // 0x0A30(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniBakeAfterNextCook                     BakeAfterNextCook;                                 // 0x0A31(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A32[0xAE];                                     // 0x0A32(0x00AE)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCachedIsPreview;                                  // 0x0AE0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AE1[0x7];                                      // 0x0AE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastTickTime;                                      // 0x0AE8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        LastLiveSyncPingTime;                              // 0x0AF0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int8>                                  ParameterPresetBuffer;                             // 0x0AF8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B08[0x28];                                     // 0x0B08(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetComponent")
	}
	static class UHoudiniAssetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetComponent;

// Class HoudiniEngineRuntime.HoudiniAssetBlueprintComponent
// 0x0100 (0x0C30 - 0x0B30)
class UHoudiniAssetBlueprintComponent final : public UHoudiniAssetComponent
{
public:
	uint8                                         Pad_B30[0x48];                                     // 0x0B30(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          FauxBPProperty;                                    // 0x0B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHoudiniAssetChanged;                              // 0x0B79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdatedFromTemplate;                              // 0x0B7A(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInBlueprintEditor;                              // 0x0B7B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanDeleteHoudiniNodes;                            // 0x0B7C(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasRegisteredComponentTemplate;                   // 0x0B7D(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B7E[0xA];                                      // 0x0B7E(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FHoudiniOutputObjectIdentifier, struct FGuid> CachedOutputNodes;                     // 0x0B88(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, struct FGuid>              CachedInputNodes;                                  // 0x0BD8(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_C28[0x8];                                      // 0x0C28(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool HasParameter(const class FString& Name_0);
	void SetFloatParameter(const class FString& Name_0, float Value, int32 Index_0);
	void SetToggleValueAt(const class FString& Name_0, bool Value, int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetBlueprintComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetBlueprintComponent")
	}
	static class UHoudiniAssetBlueprintComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetBlueprintComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetBlueprintComponent;

// Class HoudiniEngineRuntime.HoudiniEngineCopyPropertiesInterface
// 0x0000 (0x0000 - 0x0000)
class IHoudiniEngineCopyPropertiesInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniEngineCopyPropertiesInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniEngineCopyPropertiesInterface")
	}
	static class IHoudiniEngineCopyPropertiesInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHoudiniEngineCopyPropertiesInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IHoudiniEngineCopyPropertiesInterface;

// Class HoudiniEngineRuntime.HoudiniEngineEditorSettings
// 0x0000 (0x0038 - 0x0038)
class UHoudiniEngineEditorSettings final : public UDeveloperSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniEngineEditorSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniEngineEditorSettings")
	}
	static class UHoudiniEngineEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniEngineEditorSettings>();
	}
};
DUMPER7_ASSERTS_UHoudiniEngineEditorSettings;

// Class HoudiniEngineRuntime.HoudiniHandleParameter
// 0x0010 (0x0038 - 0x0028)
class UHoudiniHandleParameter final : public UObject
{
public:
	class UHoudiniParameter*                      AssetParameter;                                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	int32                                         TupleIndex;                                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniHandleParameter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniHandleParameter")
	}
	static class UHoudiniHandleParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniHandleParameter>();
	}
};
DUMPER7_ASSERTS_UHoudiniHandleParameter;

// Class HoudiniEngineRuntime.HoudiniHandleComponent
// 0x00A0 (0x0300 - 0x0260)
class UHoudiniHandleComponent final : public USceneComponent
{
public:
	TArray<class UHoudiniHandleParameter*>        XformParms;                                        // 0x0258(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UHoudiniHandleParameter*                RSTParm;                                           // 0x0268(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UHoudiniHandleParameter*                RotOrderParm;                                      // 0x0270(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LastSentTransform;                                 // 0x0280(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E0[0x1];                                      // 0x02E0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EHoudiniHandleType                            HandleType;                                        // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 HandleName;                                        // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniHandleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniHandleComponent")
	}
	static class UHoudiniHandleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniHandleComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniHandleComponent;

// Class HoudiniEngineRuntime.HoudiniInput
// 0x01E8 (0x0210 - 0x0028)
class UHoudiniInput final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 Label;                                             // 0x0038(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniInputType                             Type;                                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniInputType                             PreviousType;                                      // 0x0049(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AssetNodeId;                                       // 0x004C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InputNodeId;                                       // 0x0050(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InputIndex;                                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ParmId;                                            // 0x0058(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsObjectPathParameter;                            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CreatedDataNodeIds;                                // 0x0060(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasChanged;                                       // 0x0070(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeedsToTriggerUpdate;                             // 0x0071(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CachedBounds;                                      // 0x0078(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FString                                 Help;                                              // 0x00B0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPackBeforeMerge;                                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDirectlyConnectHdas;                              // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportOptionsMenuExpanded;                        // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGeometryInputsMenuExpanded;                       // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLandscapeOptionsMenuExpanded;                     // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWorldInputsMenuExpanded;                          // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCurveInputsMenuExpanded;                          // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCurvePointSelectionMenuExpanded;                  // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCurvePointSelectionUseAbsLocation;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCurvePointSelectionUseAbsRotation;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCookOnCurveChanged;                               // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            GeometryInputObjects;                              // 0x00D0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	bool                                          bStaticMeshChanged;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInputAssetConnectedInHoudini;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            CurveInputObjects;                                 // 0x00E8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	float                                         DefaultCurveOffset;                                // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLandscapeHasExportTypeChanged;                    // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputObject*>            WorldInputObjects;                                 // 0x0100(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class AActor*>                         WorldInputBoundSelectorObjects;                    // 0x0110(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	bool                                          bIsWorldInputBoundSelector;                        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWorldInputBoundSelectorAutoUpdate;                // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class ULandscapeComponent*>              LandscapeSelectedComponents;                       // 0x0128(0x0050)(ExportObject, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TSet<int32>                                   InputNodesPendingDelete;                           // 0x0178(0x0050)(Transient, DuplicateTransient, NonTransactional, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniInputHoudiniSplineComponent*> LastInsertedInputs;                           // 0x01C8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<class UHoudiniInputObject*>            LastUndoDeletedInputs;                             // 0x01D8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	bool                                          bLandscapeControlVisiblity;                        // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanDeleteHoudiniNodes;                            // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeSplinesExportOptionsMenuExpanded;        // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1EB[0x1];                                      // 0x01EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHoudiniInputObjectSettings            InputSettings;                                     // 0x01EC(0x0020)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInput")
	}
	static class UHoudiniInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInput>();
	}
};
DUMPER7_ASSERTS_UHoudiniInput;

// Class HoudiniEngineRuntime.HoudiniInputObject
// 0x01F8 (0x0220 - 0x0028)
class UHoudiniInputObject : public UObject
{
public:
	TSoftObjectPtr<class UObject>                 InputObject;                                       // 0x0028(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniInputObjectType                       Type;                                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x0054(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xFC];                                      // 0x0064(0x00FC)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHasChanged;                                       // 0x0160(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeedsToTriggerUpdate;                             // 0x0161(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTransformChanged;                                 // 0x0162(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_163[0x5];                                      // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         MaterialReferences;                                // 0x0168(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FHoudiniInputObjectSettings            CachedInputSettings;                               // 0x0178(0x0020)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bCanDeleteHoudiniNodes;                            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInputNodeHandleOverridesNodeIds;                  // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x01A0(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               UserInputRotator;                                  // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         InputNodeId;                                       // 0x0218(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         InputObjectNodeId;                                 // 0x021C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputObject")
	}
	static class UHoudiniInputObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputObject>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputObject;

// Class HoudiniEngineRuntime.HoudiniInputStaticMesh
// 0x0000 (0x0220 - 0x0220)
class UHoudiniInputStaticMesh : public UHoudiniInputObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputStaticMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputStaticMesh")
	}
	static class UHoudiniInputStaticMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputStaticMesh>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputStaticMesh;

// Class HoudiniEngineRuntime.HoudiniInputSkeletalMesh
// 0x0000 (0x0220 - 0x0220)
class UHoudiniInputSkeletalMesh final : public UHoudiniInputObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputSkeletalMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputSkeletalMesh")
	}
	static class UHoudiniInputSkeletalMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputSkeletalMesh>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputSkeletalMesh;

// Class HoudiniEngineRuntime.HoudiniInputAnimation
// 0x0000 (0x0220 - 0x0220)
class UHoudiniInputAnimation final : public UHoudiniInputObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputAnimation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputAnimation")
	}
	static class UHoudiniInputAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputAnimation>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputAnimation;

// Class HoudiniEngineRuntime.HoudiniInputGeometryCollection
// 0x0000 (0x0220 - 0x0220)
class UHoudiniInputGeometryCollection final : public UHoudiniInputObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputGeometryCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputGeometryCollection")
	}
	static class UHoudiniInputGeometryCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputGeometryCollection>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputGeometryCollection;

// Class HoudiniEngineRuntime.HoudiniInputSceneComponent
// 0x0070 (0x0290 - 0x0220)
#pragma pack(push, 0x1)
class alignas(0x10) UHoudiniInputSceneComponent : public UHoudiniInputObject
{
public:
	struct FTransform                             ActorTransform;                                    // 0x0220(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHoudiniInputActor*                     ParentInputActor;                                  // 0x0280(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputSceneComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputSceneComponent")
	}
	static class UHoudiniInputSceneComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputSceneComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UHoudiniInputSceneComponent;

// Class HoudiniEngineRuntime.HoudiniInputMeshComponent
// 0x0020 (0x02B0 - 0x0290)
class UHoudiniInputMeshComponent : public UHoudiniInputSceneComponent
{
public:
	TSoftObjectPtr<class UStaticMesh>             StaticMesh;                                        // 0x0288(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputMeshComponent")
	}
	static class UHoudiniInputMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputMeshComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputMeshComponent;

// Class HoudiniEngineRuntime.HoudiniInputInstancedMeshComponent
// 0x0010 (0x02C0 - 0x02B0)
class UHoudiniInputInstancedMeshComponent final : public UHoudiniInputMeshComponent
{
public:
	TArray<struct FTransform>                     InstanceTransforms;                                // 0x02B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputInstancedMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputInstancedMeshComponent")
	}
	static class UHoudiniInputInstancedMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputInstancedMeshComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputInstancedMeshComponent;

// Class HoudiniEngineRuntime.HoudiniInputSplineComponent
// 0x0020 (0x02B0 - 0x0290)
class UHoudiniInputSplineComponent final : public UHoudiniInputSceneComponent
{
public:
	int32                                         NumberOfSplineControlPoints;                       // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplineLength;                                      // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplineResolution;                                  // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SplineClosed;                                      // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     SplineControlPoints;                               // 0x0298(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputSplineComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputSplineComponent")
	}
	static class UHoudiniInputSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputSplineComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputSplineComponent;

// Class HoudiniEngineRuntime.HoudiniInputGeometryCollectionComponent
// 0x0000 (0x0290 - 0x0290)
class UHoudiniInputGeometryCollectionComponent final : public UHoudiniInputSceneComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputGeometryCollectionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputGeometryCollectionComponent")
	}
	static class UHoudiniInputGeometryCollectionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputGeometryCollectionComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputGeometryCollectionComponent;

// Class HoudiniEngineRuntime.HoudiniInputSkeletalMeshComponent
// 0x0000 (0x0290 - 0x0290)
class UHoudiniInputSkeletalMeshComponent final : public UHoudiniInputSceneComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputSkeletalMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputSkeletalMeshComponent")
	}
	static class UHoudiniInputSkeletalMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputSkeletalMeshComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputSkeletalMeshComponent;

// Class HoudiniEngineRuntime.HoudiniInputHoudiniSplineComponent
// 0x0010 (0x0230 - 0x0220)
class UHoudiniInputHoudiniSplineComponent final : public UHoudiniInputObject
{
public:
	EHoudiniCurveType                             CurveType;                                         // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniCurveMethod                           CurveMethod;                                       // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Reversed;                                          // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_223[0x5];                                      // 0x0223(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHoudiniSplineComponent*                CachedComponent;                                   // 0x0228(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputHoudiniSplineComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputHoudiniSplineComponent")
	}
	static class UHoudiniInputHoudiniSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputHoudiniSplineComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputHoudiniSplineComponent;

// Class HoudiniEngineRuntime.HoudiniInputCameraComponent
// 0x0010 (0x02A0 - 0x0290)
class UHoudiniInputCameraComponent final : public UHoudiniInputSceneComponent
{
public:
	float                                         FOV;                                               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AspectRatio;                                       // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOrthographic;                                   // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OrthoWidth;                                        // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OrthoNearClipPlane;                                // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OrthoFarClipPlane;                                 // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputCameraComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputCameraComponent")
	}
	static class UHoudiniInputCameraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputCameraComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputCameraComponent;

// Class HoudiniEngineRuntime.HoudiniInputHoudiniAsset
// 0x0010 (0x0230 - 0x0220)
class UHoudiniInputHoudiniAsset final : public UHoudiniInputObject
{
public:
	int32                                         AssetOutputIndex;                                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetId;                                           // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputHoudiniAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputHoudiniAsset")
	}
	static class UHoudiniInputHoudiniAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputHoudiniAsset>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputHoudiniAsset;

// Class HoudiniEngineRuntime.HoudiniInputActor
// 0x0190 (0x03B0 - 0x0220)
class UHoudiniInputActor : public UHoudiniInputObject
{
public:
	int32                                         SplinesMeshObjectNodeId;                           // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SplinesMeshNodeId;                                 // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0xF8];                                     // 0x0228(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniInputSceneComponent*>    ActorComponents;                                   // 0x0320(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TSet<TSoftObjectPtr<class UObject>>           ActorSceneComponents;                              // 0x0330(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	int32                                         LastUpdateNumComponentsAdded;                      // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LastUpdateNumComponentsRemoved;                    // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumSplineMeshComponents;                           // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  GeneratedSplinesMeshPackageGuid;                   // 0x038C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            GeneratedSplinesMesh;                              // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	bool                                          bUsedMergeSplinesMeshAtLastTranslate;              // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputActor")
	}
	static class UHoudiniInputActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInputActor>();
	}
};
DUMPER7_ASSERTS_UHoudiniInputActor;

// Class HoudiniEngineRuntime.HoudiniInputLevelInstance
// 0x0060 (0x0410 - 0x03B0)
class UHoudiniInputLevelInstance final : public UHoudiniInputActor
{
public:
	TMap<TSoftObjectPtr<class AActor>, class UHoudiniInputObject*> TrackedActorObjects;              // 0x03B0(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	int32                                         NumActorsAddedLastUpdate;                          // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumActorsRemovedLastUpdate;                        // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInputLevelInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInputLevelInstance")
	}
	static class UHoudiniInputLevelInstance* GetDefaultObj()
	{
