#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoudiniEngineRuntime

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum HoudiniEngineRuntime.EHoudiniStaticMeshMethod
// NumValues: 0x0004
enum class EHoudiniStaticMeshMethod : uint8
{
	RawMesh_DELETED                          = 0,
	FMeshDescription                         = 1,
	UHoudiniStaticMesh                       = 2,
	EHoudiniStaticMeshMethod_MAX             = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniBakeAfterNextCook
// NumValues: 0x0004
enum class EHoudiniBakeAfterNextCook : uint8
{
	Disabled                                 = 0,
	Always                                   = 1,
	Once                                     = 2,
	EHoudiniBakeAfterNextCook_MAX            = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniAssetState
// NumValues: 0x0010
enum class EHoudiniAssetState : uint8
{
	NeedInstantiation                        = 0,
	NewHDA                                   = 1,
	PreInstantiation                         = 2,
	Instantiating                            = 3,
	PreCook                                  = 4,
	Cooking                                  = 5,
	PostCook                                 = 6,
	PreProcess                               = 7,
	Processing                               = 8,
	None                                     = 9,
	NeedRebuild                              = 10,
	NeedDelete                               = 11,
	Deleting                                 = 12,
	ProcessTemplate                          = 13,
	Dormant                                  = 14,
	EHoudiniAssetState_MAX                   = 15,
};

// Enum HoudiniEngineRuntime.EHoudiniAssetStateResult
// NumValues: 0x0007
enum class EHoudiniAssetStateResult : uint8
{
	None                                     = 0,
	Working                                  = 1,
	Success                                  = 2,
	FinishedWithError                        = 3,
	FinishedWithFatalError                   = 4,
	Aborted                                  = 5,
	EHoudiniAssetStateResult_MAX             = 6,
};

// Enum HoudiniEngineRuntime.EHoudiniEngineEditorSettingUseCustomLocation
// NumValues: 0x0004
enum class EHoudiniEngineEditorSettingUseCustomLocation : uint8
{
	Project                                  = 0,
	Disabled                                 = 1,
	Enabled                                  = 2,
	EHoudiniEngineEditorSettingUseCustomLocation_MAX = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniRampInterpolationType
// NumValues: 0x0009
enum class EHoudiniRampInterpolationType : uint8
{
	InValid                                  = 18446744073709551615,
	CONSTANT                                 = 0,
	LINEAR                                   = 1,
	CATMULL_ROM                              = 2,
	MONOTONE_CUBIC                           = 3,
	BEZIER                                   = 4,
	BSPLINE                                  = 5,
	HERMITE                                  = 6,
	EHoudiniRampInterpolationType_MAX        = 7,
};

// Enum HoudiniEngineRuntime.EHoudiniEngineActorBakeOption
// NumValues: 0x0003
enum class EHoudiniEngineActorBakeOption : uint8
{
	OneActorPerComponent                     = 0,
	OneActorPerHDA                           = 1,
	EHoudiniEngineActorBakeOption_MAX        = 2,
};

// Enum HoudiniEngineRuntime.EHoudiniLandscapeOutputBakeType
// NumValues: 0x0005
enum class EHoudiniLandscapeOutputBakeType : uint8
{
	Detachment                               = 0,
	BakeToImage                              = 1,
	BakeToWorld                              = 2,
	InValid                                  = 3,
	EHoudiniLandscapeOutputBakeType_MAX      = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniInputType
// NumValues: 0x0005
enum class EHoudiniInputType : uint8
{
	Invalid                                  = 0,
	Geometry                                 = 1,
	Curve                                    = 2,
	World                                    = 5,
	EHoudiniInputType_MAX                    = 6,
};

// Enum HoudiniEngineRuntime.EHoudiniOutputType
// NumValues: 0x000B
enum class EHoudiniOutputType : uint8
{
	Invalid                                  = 0,
	Mesh                                     = 1,
	Instancer                                = 2,
	Landscape                                = 3,
	Curve                                    = 4,
	Skeletal                                 = 5,
	GeometryCollection                       = 6,
	DataTable                                = 7,
	LandscapeSpline                          = 8,
	AnimSequence                             = 9,
	EHoudiniOutputType_MAX                   = 10,
};

// Enum HoudiniEngineRuntime.EHoudiniCurveType
// NumValues: 0x0006
enum class EHoudiniCurveType : uint8
{
	Invalid                                  = 18446744073709551615,
	Polygon                                  = 0,
	Nurbs                                    = 1,
	Bezier                                   = 2,
	Points                                   = 3,
	EHoudiniCurveType_MAX                    = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniCurveMethod
// NumValues: 0x0005
enum class EHoudiniCurveMethod : uint8
{
	Invalid                                  = 18446744073709551615,
	CVs                                      = 0,
	Breakpoints                              = 1,
	Freehand                                 = 2,
	EHoudiniCurveMethod_MAX                  = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniCurveBreakpointParameterization
// NumValues: 0x0005
enum class EHoudiniCurveBreakpointParameterization : uint8
{
	Invalid                                  = 18446744073709551615,
	Uniform                                  = 0,
	Chord                                    = 1,
	Centripetal                              = 2,
	EHoudiniCurveBreakpointParameterization_MAX = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniLandscapeExportType
// NumValues: 0x0004
enum class EHoudiniLandscapeExportType : uint8
{
	Heightfield                              = 0,
	Mesh                                     = 1,
	Points                                   = 2,
	EHoudiniLandscapeExportType_MAX          = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniProxyRefineResult
// NumValues: 0x0005
enum class EHoudiniProxyRefineResult : uint8
{
	Invalid                                  = 0,
	Failed                                   = 1,
	Success                                  = 2,
	Skipped                                  = 3,
	EHoudiniProxyRefineResult_MAX            = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniProxyRefineRequestResult
// NumValues: 0x0005
enum class EHoudiniProxyRefineRequestResult : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	PendingCooks                             = 2,
	Refined                                  = 3,
	EHoudiniProxyRefineRequestResult_MAX     = 4,
};

// Enum HoudiniEngineRuntime.EAttribStorageType
// NumValues: 0x0007
enum class EAttribStorageType : uint8
{
	Invalid                                  = 18446744073709551615,
	INT                                      = 0,
	INT64                                    = 1,
	FLOAT                                    = 2,
	FLOAT64                                  = 3,
	STRING                                   = 4,
	EAttribStorageType_MAX                   = 5,
};

// Enum HoudiniEngineRuntime.EAttribOwner
// NumValues: 0x0006
enum class EAttribOwner : uint8
{
	Invalid                                  = 18446744073709551615,
	Vertex                                   = 0,
	Point                                    = 1,
	Prim                                     = 2,
	Detail                                   = 3,
	EAttribOwner_MAX                         = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniGeoType
// NumValues: 0x0006
enum class EHoudiniGeoType : uint8
{
	Invalid                                  = 0,
	Default                                  = 1,
	Intermediate                             = 2,
	Input                                    = 3,
	Curve                                    = 4,
	EHoudiniGeoType_MAX                      = 5,
};

// Enum HoudiniEngineRuntime.EHoudiniPartType
// NumValues: 0x000C
enum class EHoudiniPartType : uint8
{
	Invalid                                  = 0,
	Mesh                                     = 1,
	Instancer                                = 2,
	Curve                                    = 3,
	Volume                                   = 4,
	DataTable                                = 5,
	LandscapeSpline                          = 6,
	SkeletalMeshShape                        = 7,
	SkeletalMeshPose                         = 8,
	MotionClip                               = 9,
	SkeletalMeshPhysAsset                    = 10,
	EHoudiniPartType_MAX                     = 11,
};

// Enum HoudiniEngineRuntime.EHoudiniInstancerType
// NumValues: 0x0009
enum class EHoudiniInstancerType : uint8
{
	Invalid                                  = 0,
	ObjectInstancer                          = 1,
	PackedPrimitive                          = 2,
	AttributeInstancer                       = 3,
	OldSchoolAttributeInstancer              = 4,
	GeometryCollection                       = 5,
	SkeletalMesh                             = 6,
	MotionClip                               = 7,
	EHoudiniInstancerType_MAX                = 8,
};

// Enum HoudiniEngineRuntime.EXformParameter
// NumValues: 0x000B
enum class EXformParameter : uint8
{
	TX                                       = 0,
	TY                                       = 1,
	TZ                                       = 2,
	RX                                       = 3,
	RY                                       = 4,
	RZ                                       = 5,
	SX                                       = 6,
	SY                                       = 7,
	SZ                                       = 8,
	COUNT                                    = 9,
	EXformParameter_MAX                      = 10,
};

// Enum HoudiniEngineRuntime.EHoudiniHandleType
// NumValues: 0x0004
enum class EHoudiniHandleType : uint8
{
	Xform                                    = 0,
	Bounder                                  = 1,
	Unsupported                              = 2,
	EHoudiniHandleType_MAX                   = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniInputObjectType
// NumValues: 0x001D
enum class EHoudiniInputObjectType : uint8
{
	Invalid                                  = 0,
	Object                                   = 1,
	StaticMesh                               = 2,
	SkeletalMesh                             = 3,
	SceneComponent                           = 4,
	StaticMeshComponent                      = 5,
	InstancedStaticMeshComponent             = 6,
	SplineComponent                          = 7,
	HoudiniSplineComponent                   = 8,
	HoudiniAssetComponent                    = 9,
	Actor                                    = 10,
	Landscape                                = 11,
	Brush                                    = 12,
	CameraComponent                          = 13,
	DataTable                                = 14,
	HoudiniAssetActor                        = 15,
	FoliageType_InstancedStaticMesh          = 16,
	GeometryCollection                       = 17,
	GeometryCollectionComponent              = 18,
	GeometryCollectionActor_Deprecated       = 19,
	SkeletalMeshComponent                    = 20,
	LandscapeSplineActor                     = 21,
	LandscapeSplinesComponent                = 22,
	Blueprint                                = 23,
	Animation                                = 24,
	SplineMeshComponent                      = 25,
	LevelInstance                            = 26,
	PackedLevelActor                         = 27,
	EHoudiniInputObjectType_MAX              = 28,
};

// Enum HoudiniEngineRuntime.EHoudiniXformType
// NumValues: 0x0004
enum class EHoudiniXformType : uint8
{
	None                                     = 0,
	IntoThisObject                           = 1,
	Auto                                     = 2,
	EHoudiniXformType_MAX                    = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniNodeSyncStatus
// NumValues: 0x0007
enum class EHoudiniNodeSyncStatus : uint8
{
	None                                     = 0,
	Failed                                   = 1,
	Success                                  = 2,
	SuccessWithErrors                        = 3,
	Running                                  = 4,
	Warning                                  = 5,
	EHoudiniNodeSyncStatus_MAX               = 6,
};

// Enum HoudiniEngineRuntime.EHoudiniCurveOutputType
// NumValues: 0x0003
enum class EHoudiniCurveOutputType : uint8
{
	UnrealSpline                             = 0,
	HoudiniSpline                            = 1,
	EHoudiniCurveOutputType_MAX              = 2,
};

// Enum HoudiniEngineRuntime.EHoudiniParameterType
// NumValues: 0x0018
enum class EHoudiniParameterType : uint8
{
	Invalid                                  = 0,
	Button                                   = 1,
	ButtonStrip                              = 2,
	Color                                    = 3,
	ColorRamp                                = 4,
	File                                     = 5,
	FileDir                                  = 6,
	FileGeo                                  = 7,
	FileImage                                = 8,
	Float                                    = 9,
	FloatRamp                                = 10,
	Folder                                   = 11,
	FolderList                               = 12,
	Input                                    = 13,
	Int                                      = 14,
	IntChoice                                = 15,
	Label                                    = 16,
	MultiParm                                = 17,
	Separator                                = 18,
	String                                   = 19,
	StringChoice                             = 20,
	StringAssetRef                           = 21,
	Toggle                                   = 22,
	EHoudiniParameterType_MAX                = 23,
};

// Enum HoudiniEngineRuntime.EHoudiniParameterChoiceListType
// NumValues: 0x0006
enum class EHoudiniParameterChoiceListType : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	Mini                                     = 2,
	Replace                                  = 3,
	Toggle                                   = 4,
	EHoudiniParameterChoiceListType_MAX      = 5,
};

// Enum HoudiniEngineRuntime.EHoudiniFolderParameterType
// NumValues: 0x0007
enum class EHoudiniFolderParameterType : uint8
{
	Invalid                                  = 0,
	Collapsible                              = 1,
	Simple                                   = 2,
	Tabs                                     = 3,
	Radio                                    = 4,
	Other                                    = 5,
	EHoudiniFolderParameterType_MAX          = 6,
};

// Enum HoudiniEngineRuntime.EHoudiniMultiParmModificationType
// NumValues: 0x0005
enum class EHoudiniMultiParmModificationType : uint8
{
	None                                     = 0,
	Inserted                                 = 1,
	Removed                                  = 2,
	Modified                                 = 3,
	EHoudiniMultiParmModificationType_MAX    = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniRampPointConstructStatus
// NumValues: 0x0006
enum class EHoudiniRampPointConstructStatus : uint8
{
	None                                     = 0,
	INITIALIZED                              = 1,
	POSITION_INSERTED                        = 2,
	VALUE_INSERTED                           = 3,
	INTERPTYPE_INSERTED                      = 4,
	EHoudiniRampPointConstructStatus_MAX     = 5,
};

// Enum HoudiniEngineRuntime.EPDGLinkState
// NumValues: 0x0005
enum class EPDGLinkState : uint8
{
	Inactive                                 = 0,
	Linking                                  = 1,
	Linked                                   = 2,
	Error_Not_Linked                         = 3,
	EPDGLinkState_MAX                        = 4,
};

// Enum HoudiniEngineRuntime.EPDGNodeState
// NumValues: 0x0007
enum class EPDGNodeState : uint8
{
	None                                     = 0,
	Dirtied                                  = 1,
	Dirtying                                 = 2,
	Cooking                                  = 3,
	Cook_Complete                            = 4,
	Cook_Failed                              = 5,
	EPDGNodeState_MAX                        = 6,
};

// Enum HoudiniEngineRuntime.EPDGWorkResultState
// NumValues: 0x0009
enum class EPDGWorkResultState : uint8
{
	None                                     = 0,
	ToLoad                                   = 1,
	Loading                                  = 2,
	Loaded                                   = 3,
	ToDelete                                 = 4,
	Deleting                                 = 5,
	Deleted                                  = 6,
	NotLoaded                                = 7,
	EPDGWorkResultState_MAX                  = 8,
};

// Enum HoudiniEngineRuntime.EHoudiniRuntimeSettingsSessionType
// NumValues: 0x0006
enum class EHoudiniRuntimeSettingsSessionType : uint8
{
	HRSST_InProcess                          = 0,
	HRSST_Socket                             = 1,
	HRSST_NamedPipe                          = 2,
	HRSST_None                               = 3,
	HRSST_MemoryBuffer                       = 4,
	HRSST_MAX                                = 5,
};

// Enum HoudiniEngineRuntime.EHoudiniRuntimeSettingsRecomputeFlag
// NumValues: 0x0004
enum class EHoudiniRuntimeSettingsRecomputeFlag : uint8
{
	HRSRF_Always                             = 0,
	HRSRF_OnlyIfMissing                      = 1,
	HRSRF_Never                              = 2,
	HRSRF_MAX                                = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniExecutableType
// NumValues: 0x0005
enum class EHoudiniExecutableType : uint8
{
	HRSHE_Houdini                            = 0,
	HRSHE_HoudiniFX                          = 1,
	HRSHE_HoudiniCore                        = 2,
	HRSHE_HoudiniIndie                       = 3,
	HRSHE_MAX                                = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniToolType
// NumValues: 0x0005
enum class EHoudiniToolType : uint8
{
	HTOOLTYPE_GENERATOR                      = 0,
	HTOOLTYPE_OPERATOR_SINGLE                = 1,
	HTOOLTYPE_OPERATOR_MULTI                 = 2,
	HTOOLTYPE_OPERATOR_BATCH                 = 3,
	HTOOLTYPE_MAX                            = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniToolSelectionType
// NumValues: 0x0004
enum class EHoudiniToolSelectionType : uint8
{
	HTOOL_SELECTION_ALL                      = 0,
	HTOOL_SELECTION_WORLD_ONLY               = 1,
	HTOOL_SELECTION_CB_ONLY                  = 2,
	HTOOL_SELECTION_MAX                      = 3,
};

// ScriptStruct HoudiniEngineRuntime.HoudiniCurveOutputProperties
// 0x000C (0x000C - 0x0000)
struct FHoudiniCurveOutputProperties final
{
public:
	EHoudiniCurveOutputType                       CurveOutputType;                                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumPoints;                                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClosed;                                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniCurveType                             CurveType;                                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniCurveMethod                           CurveMethod;                                       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniCurveOutputProperties;

// ScriptStruct HoudiniEngineRuntime.HoudiniDataLayer
// 0x0018 (0x0018 - 0x0000)
struct FHoudiniDataLayer final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateIfNeeded;                                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniDataLayer;

// ScriptStruct HoudiniEngineRuntime.HoudiniHLODLayer
// 0x0010 (0x0010 - 0x0000)
struct FHoudiniHLODLayer final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniHLODLayer;

// ScriptStruct HoudiniEngineRuntime.HoudiniLevelInstanceParams
// 0x0018 (0x0018 - 0x0000)
struct FHoudiniLevelInstanceParams final
{
public:
	ELevelInstanceCreationType                    Type;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutputName;                                        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniLevelInstanceParams;

// ScriptStruct HoudiniEngineRuntime.HoudiniOutputObject
// 0x0160 (0x0160 - 0x0000)
struct FHoudiniOutputObject final
{
public:
	class UObject*                                OutputObject;                                      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<class UObject*>                        OutputComponents;                                  // 0x0008(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<TSoftObjectPtr<class AActor>>          OutputActors;                                      // 0x0018(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UObject*                                ProxyObject;                                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UObject*                                ProxyComponent;                                    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	bool                                          bProxyIsCurrent;                                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsImplicit;                                       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInvisibleCollisionMesh;                         // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsGeometryCollectionPiece;                        // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GeometryCollectionPieceName;                       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BakeName;                                          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHoudiniCurveOutputProperties          CurveOutputProperty;                               // 0x0060(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            CachedAttributes;                                  // 0x0070(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            CachedTokens;                                      // 0x00C0(0x0050)(NativeAccessSpecifierPublic)
	class UObject*                                UserFoliageType;                                   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UFoliageType*                           FoliageType;                                       // 0x0118(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UWorld*                                 World;                                             // 0x0120(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<struct FHoudiniDataLayer>              DataLayers;                                        // 0x0128(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHoudiniHLODLayer>              HLODLayers;                                        // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FHoudiniLevelInstanceParams            LevelInstanceParams;                               // 0x0148(0x0018)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniOutputObject;

// ScriptStruct HoudiniEngineRuntime.HoudiniAssetBlueprintOutput
// 0x0168 (0x0168 - 0x0000)
struct FHoudiniAssetBlueprintOutput final
{
public:
	int32                                         OutputIndex;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHoudiniOutputObject                   OutputObject;                                      // 0x0008(0x0160)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniAssetBlueprintOutput;

// ScriptStruct HoudiniEngineRuntime.HoudiniOutputObjectIdentifier
// 0x0040 (0x0040 - 0x0000)
struct FHoudiniOutputObjectIdentifier final
{
public:
	int32                                         ObjectID;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GeoId;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PartId;                                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SplitIdentifier;                                   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartName;                                          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrimitiveIndex;                                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniOutputObjectIdentifier;

// ScriptStruct HoudiniEngineRuntime.HoudiniAssetBlueprintInstanceData
// 0x00B8 (0x0120 - 0x0068)
struct FHoudiniAssetBlueprintInstanceData final : public FActorComponentInstanceData
{
public:
	class UHoudiniAsset*                          HoudiniAsset;                                      // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	int32                                         AssetId;                                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniAssetState                            AssetState;                                        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SubAssetIndex;                                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        AssetCookCount;                                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasBeenLoaded;                                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasBeenDuplicated;                                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPendingDelete;                                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecookRequested;                                  // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRebuildRequested;                                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCooking;                                    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceNeedUpdate;                                  // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLastCookSuccess;                                  // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ComponentGUID;                                     // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  HapiGUID;                                          // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegisteredComponentTemplate;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SourceName;                                        // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FHoudiniOutputObjectIdentifier, struct FHoudiniAssetBlueprintOutput> Outputs;        // 0x00C0(0x0050)(NativeAccessSpecifierPublic)
	TArray<class UHoudiniInput*>                  Inputs;                                            // 0x0110(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FHoudiniAssetBlueprintInstanceData;

// ScriptStruct HoudiniEngineRuntime.UserPackageRules
// 0x0028 (0x0028 - 0x0000)
struct FUserPackageRules final
{
public:
	class UHoudiniToolsPackageAsset*              ToolsPackageAsset;                                 // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<class FString>                         Include;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Exclude;                                           // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUserPackageRules;

// ScriptStruct HoudiniEngineRuntime.UserCategoryRules
// 0x0010 (0x0010 - 0x0000)
struct FUserCategoryRules final
{
public:
	TArray<struct FUserPackageRules>              Packages;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUserCategoryRules;

// ScriptStruct HoudiniEngineRuntime.HoudiniGenericAttributeChangedProperty
// 0x0098 (0x0098 - 0x0000)
struct FHoudiniGenericAttributeChangedProperty final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_8[0x90];                                       // 0x0008(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniGenericAttributeChangedProperty;

// ScriptStruct HoudiniEngineRuntime.HoudiniGenericAttribute
// 0x0050 (0x0050 - 0x0000)
struct FHoudiniGenericAttribute final
{
public:
	class FString                                 AttributeName;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttribStorageType                            AttributeType;                                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttribOwner                                  AttributeOwner;                                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AttributeCount;                                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AttributeTupleSize;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                DoubleValues;                                      // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int64>                                 IntValues;                                         // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         StringValues;                                      // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniGenericAttribute;

// ScriptStruct HoudiniEngineRuntime.HoudiniObjectInfo
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FHoudiniObjectInfo final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniObjectInfo;

// ScriptStruct HoudiniEngineRuntime.HoudiniGeoInfo
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FHoudiniGeoInfo final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniGeoInfo;

// ScriptStruct HoudiniEngineRuntime.HoudiniPartInfo
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FHoudiniPartInfo final
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniPartInfo;

// ScriptStruct HoudiniEngineRuntime.HoudiniVolumeInfo
// 0x00B0 (0x00B0 - 0x0000)
struct alignas(0x10) FHoudiniVolumeInfo final
{
public:
	uint8                                         Pad_0[0xB0];                                       // 0x0000(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniVolumeInfo;

// ScriptStruct HoudiniEngineRuntime.HoudiniCurveInfo
// 0x001C (0x001C - 0x0000)
struct alignas(0x04) FHoudiniCurveInfo final
{
public:
	uint8                                         Pad_0[0x1C];                                       // 0x0000(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniCurveInfo;

// ScriptStruct HoudiniEngineRuntime.HoudiniMeshSocket
// 0x0090 (0x0090 - 0x0000)
struct alignas(0x10) FHoudiniMeshSocket final
{
public:
	uint8                                         Pad_0[0x90];                                       // 0x0000(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniMeshSocket;

// ScriptStruct HoudiniEngineRuntime.HoudiniGeoPartObject
// 0x02D0 (0x02D0 - 0x0000)
struct FHoudiniGeoPartObject final
{
public:
	int32                                         AssetId;                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AssetName;                                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ObjectID;                                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ObjectName;                                        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GeoId;                                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PartId;                                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartName;                                          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCustomPartName;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         SplitGroups;                                       // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTransform                             TransformMatrix;                                   // 0x0060(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NodePath;                                          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniPartType                              Type;                                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniInstancerType                         InstancerType;                                     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VolumeName;                                        // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasEditLayers;                                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VolumeLayerName;                                   // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VolumeTileIndex;                                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InstancerName;                                     // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVisible;                                        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEditable;                                       // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTemplated;                                      // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInstanced;                                      // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasGeoChanged;                                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasPartChanged;                                   // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasTransformChanged;                              // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasMaterialsChanged;                              // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_120[0x180];                                    // 0x0120(0x0180)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHoudiniMeshSocket>             AllMeshSockets;                                    // 0x02A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHoudiniGenericAttribute>       GenericPropertyAttributes;                         // 0x02B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bKeepTags;                                         // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C1[0xF];                                      // 0x02C1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniGeoPartObject;

// ScriptStruct HoudiniEngineRuntime.HoudiniBrushInfo
// 0x00B0 (0x00B0 - 0x0000)
struct FHoudiniBrushInfo final
{
public:
	TWeakObjectPtr<class ABrush>                  BrushActor;                                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CachedTransform;                                   // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CachedOrigin;                                      // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CachedExtent;                                      // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBrushType                                    CachedBrushType;                                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        CachedSurfaceHash;                                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniBrushInfo;

// ScriptStruct HoudiniEngineRuntime.HoudiniLandscapeSplineControlPointData
// 0x0038 (0x0038 - 0x0000)
struct FHoudiniLandscapeSplineControlPointData final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniLandscapeSplineControlPointData;

// ScriptStruct HoudiniEngineRuntime.HoudiniLandscapeSplineSegmentData
// 0x0001 (0x0001 - 0x0000)
struct FHoudiniLandscapeSplineSegmentData final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHoudiniLandscapeSplineSegmentData;

// ScriptStruct HoudiniEngineRuntime.HoudiniInputObjectSettings
// 0x0020 (0x0020 - 0x0000)
struct FHoudiniInputObjectSettings final
{
public:
	EHoudiniXformType                             KeepWorldTransform;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportAsReference;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportAsReferenceRotScaleEnabled;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportAsReferenceBboxEnabled;                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportAsReferenceMaterialEnabled;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportLODs;                                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportSockets;                                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreferNaniteFallbackMesh;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportColliders;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportMaterialParameters;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddRotAndScaleAttributesOnCurves;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLegacyInputCurves;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnrealSplineResolution;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniLandscapeExportType                   LandscapeExportType;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportSelectionOnly;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeAutoSelectComponent;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportMaterials;                         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportLighting;                          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportNormalizedUVs;                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeExportTileUVs;                           // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeAutoSelectSplines;                       // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeSplinesExportControlPoints;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeSplinesExportLeftRightCurves;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLandscapeSplinesExportSplineMeshComponents;       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMergeSplineMeshComponents;                        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportHeightDataPerEditLayer;                     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportPaintLayersPerEditLayer;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportMergedPaintLayers;                          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExportLevelInstanceContent;                       // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniInputObjectSettings;

// ScriptStruct HoudiniEngineRuntime.HoudiniExtents
// 0x0010 (0x0010 - 0x0000)
struct FHoudiniExtents final
{
public:
	struct FIntPoint                              min_0;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              max_0;                                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniExtents;

// ScriptStruct HoudiniEngineRuntime.HoudiniClearedTargetLayer
// 0x0050 (0x0050 - 0x0000)
struct FHoudiniClearedTargetLayer final
{
public:
	TSet<class FString>                           TargetLayers;                                      // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniClearedTargetLayer;

// ScriptStruct HoudiniEngineRuntime.HoudiniClearedEditLayers
// 0x0050 (0x0050 - 0x0000)
struct FHoudiniClearedEditLayers final
{
public:
	TMap<class FString, struct FHoudiniClearedTargetLayer> EditLayers;                               // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniClearedEditLayers;

// ScriptStruct HoudiniEngineRuntime.HoudiniMaterialIdentifier
// 0x0030 (0x0030 - 0x0000)
struct FHoudiniMaterialIdentifier final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MaterialObjectPath;                                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHoudiniMaterial;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMakeMaterialInstance;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MaterialInstanceParametersSlug;                    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniMaterialIdentifier;

// ScriptStruct HoudiniEngineRuntime.HoudiniBakedOutputObjectIdentifier
// 0x0018 (0x0018 - 0x0000)
struct FHoudiniBakedOutputObjectIdentifier final
{
public:
	int32                                         PartId;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SplitIdentifier;                                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
