#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoverDrone

#include "Basic.hpp"


namespace SDK
{

// Enum HoverDrone.EHoverDroneDebug
// NumValues: 0x0009
enum class EHoverDroneDebug : uint8
{
	Off                                      = 0,
	Position                                 = 1,
	Velocity                                 = 4,
	RotationalVelocity                       = 8,
	Altitude                                 = 16,
	ForceFacing                              = 32,
	FOV                                      = 64,
	All                                      = 125,
	EHoverDroneDebug_MAX                     = 126,
};

// ScriptStruct HoverDrone.DroneSpeedParameters
// 0x001C (0x001C - 0x0000)
struct FDroneSpeedParameters final
{
public:
	float                                         LinearAccelScale;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearDecelScale;                                  // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotAccelScale;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotDecelScale;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxLinearSpeedScale;                               // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRotSpeedScale;                                  // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HoverThrustScale;                                  // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDroneSpeedParameters;

}

