#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDNotificationEntry

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"
#include "HUDNotificationEntry_Struct_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUDNotificationEntry.HUDNotificationEntry_C
// 0x00B0 (0x0868 - 0x07B8)
class UHUDNotificationEntry_C final : public UPrimalUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x07C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x07C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x07D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonGamepad;                                     // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ButtonKeyboard;                                    // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDNotificationEntrySmall_C*           HUDNotificationEntrySmall;                         // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftBracket;                                       // 0x07F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftBracket_1;                                     // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NotifText;                                    // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextKeyboardButton;                                // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FHUDNotificationEntry_Struct           HUDNotificationEntry;                              // 0x0810(0x0050)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsDestroying;                                      // 0x0860(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstInit;                                         // 0x0861(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DestroyWidget();
	void ExecuteUbergraph_HUDNotificationEntry(int32 EntryPoint);
	struct FSlateColor GetNotifStringColor();
	void InitFadeAnim(bool PreventAnim);
	void InitWidget(const struct FHUDNotificationEntry_Struct& Entry, bool PreventAnim, TArray<struct FHUDNotificationEntry_Struct>& Entries, bool ShowButtonForInfo, class UTexture2D* ButtonTex, const class FText& KBM_ButtonName);
	void ResizeEntry();
	void SetupButtonExtendedHUD(bool show, class UTexture2D* Icon, const class FText& Keybinding);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HUDNotificationEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUDNotificationEntry_C")
	}
	static class UHUDNotificationEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDNotificationEntry_C>();
	}
};
DUMPER7_ASSERTS_UHUDNotificationEntry_C;

}

