#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Human_Male_TPV_OrientationWarping_CtrlRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass Human_Male_TPV_OrientationWarping_CtrlRig.Human_Male_TPV_OrientationWarping_CtrlRig_C
// 0x0100 (0x0BD0 - 0x0AD0)
class UHuman_Male_TPV_OrientationWarping_CtrlRig_C final : public UControlRig
{
public:
	double                                        RelativeAngle;                                     // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HipAngle;                                          // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             lfoot;                                             // 0x0AE0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             rfoot;                                             // 0x0B40(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bApplyIK;                                          // 0x0BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA1[0x7];                                      // 0x0BA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RelativeAnglePivot;                                // 0x0BA8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Crouched;                                          // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Human_Male_TPV_OrientationWarping_CtrlRig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Human_Male_TPV_OrientationWarping_CtrlRig_C")
	}
	static class UHuman_Male_TPV_OrientationWarping_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHuman_Male_TPV_OrientationWarping_CtrlRig_C>();
	}
};
DUMPER7_ASSERTS_UHuman_Male_TPV_OrientationWarping_CtrlRig_C;

}

