#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Human_Female_TPV_PPAnimBP

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Human_Female_TPV_PPAnimBP.Human_Female_TPV_PPAnimBP_C
// 0x14D0 (0x1890 - 0x03C0)
class UHuman_Female_TPV_PPAnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03C8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03D0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03D8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03F8(0x00B8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x04B0(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x0990(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0E70(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0EF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0F18(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0F40(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1028(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x10A8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x10D0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1198(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x11C0(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x16A0(0x00B8)()
	bool                                          K2Node_PropertyAccess_2;                           // 0x1758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_1;                           // 0x1759(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175A[0x6];                                     // 0x175A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_PropertyAccess;                             // 0x1760(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __CustomProperty_WearingSkin_ED5466B349DC3EBE78B0DAA43AD9A9DD; // 0x1778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_OverrideBoneMods_D0FB8FD04FA27550B0705D8845FB40A3; // 0x1779(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_177A[0x6];                                     // 0x177A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AShooterCharacter*                      __CustomProperty_PrimalChar_D0FB8FD04FA27550B0705D8845FB40A3; // 0x1780(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_BonespaceAccelMultiplier_080F52494A51F56D1E110C8AE656D692; // 0x1788(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_DampingModifier_080F52494A51F56D1E110C8AE656D692; // 0x17A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_StrengthModifier_080F52494A51F56D1E110C8AE656D692; // 0x17A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bShouldReset_4D01499246124C526CD6A880B1CF878F; // 0x17B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B1[0x7];                                     // 0x17B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_CharacterCreatorFatBelly_4D01499246124C526CD6A880B1CF878F; // 0x17B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_CharacterCreatorFatChest_4D01499246124C526CD6A880B1CF878F; // 0x17C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bFemale_4D01499246124C526CD6A880B1CF878F; // 0x17C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C9[0x7];                                     // 0x17C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_PhysicsFactor_Breast_4D01499246124C526CD6A880B1CF878F; // 0x17D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_PhysicsFactor_Belly_4D01499246124C526CD6A880B1CF878F; // 0x17D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_OverallFat_4D01499246124C526CD6A880B1CF878F; // 0x17E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Character_Creator_Overall_Fat;                     // 0x17E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17EC[0x4];                                     // 0x17EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Item_Based_Physics_Factor_Belly;                   // 0x17F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Item_Based_Physics_Factor_Breast;                  // 0x17F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Female;                                         // 0x1800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1801[0x3];                                     // 0x1801(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Character_Creator_Fat_01Chest;                     // 0x1804(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Character_Creator_Fat_01Belly;                     // 0x1808(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasFirstPerson;                                    // 0x180C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldReset;                                       // 0x180D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_180E[0x2];                                     // 0x180E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ShouldResetFor;                                    // 0x1810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IsRiding;                                          // 0x1818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x1820(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Breast_Anim_Alpha;                                 // 0x1838(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183C[0x4];                                     // 0x183C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RiderSpringModifier;                               // 0x1840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Was_Riding_Last_Frame;                             // 0x1848(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1849[0x7];                                     // 0x1849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RiderSpringDampingModifier;                        // 0x1850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Bonespace_Accel_Multiplier;                        // 0x1858(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Vehicle_PassengerWeaponEquipped;                   // 0x1870(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1871[0x7];                                     // 0x1871(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AShooterCharacter*                      Primal_Char;                                       // 0x1878(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBaseHumanAnimBP_C*                     As_Base_Human_Anim_BP;                             // 0x1880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideBoneMods;                                  // 0x1888(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Human_Female_TPV_PPAnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Human_Female_TPV_PPAnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Human_Female_TPV_PPAnimBP_C")
	}
	static class UHuman_Female_TPV_PPAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHuman_Female_TPV_PPAnimBP_C>();
	}
};
DUMPER7_ASSERTS_UHuman_Female_TPV_PPAnimBP_C;

}

