#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interface_TekSpear

#include "Basic.hpp"

#include "Struct_WeapAnimWith3P_V3_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_ProjSpear_Tek get damage multiplier for attack
// 0x0010 (0x0010 - 0x0000)
struct Interface_TekSpear_C_Interface_ProjSpear_Tek_get_damage_multiplier_for_attack final
{
public:
	uint8                                         attack_index;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        damage_multiplier;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_ProjSpear_Tek_get_damage_multiplier_for_attack;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_ProjSpear_Tek get rotation towards projectile
// 0x0018 (0x0018 - 0x0000)
struct Interface_TekSpear_C_Interface_ProjSpear_Tek_get_rotation_towards_projectile final
{
public:
	struct FRotator                               out_rotation;                                      // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_ProjSpear_Tek_get_rotation_towards_projectile;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_ProjSpear_Tek set projectile location
// 0x0020 (0x0020 - 0x0000)
struct Interface_TekSpear_C_Interface_ProjSpear_Tek_set_projectile_location final
{
public:
	struct FVector                                Last_Projectile_Location;                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_ProjSpear_Tek_set_projectile_location;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_ProjSpear_Tek set rotation towards projectile
// 0x0020 (0x0020 - 0x0000)
struct Interface_TekSpear_C_Interface_ProjSpear_Tek_set_rotation_towards_projectile final
{
public:
	struct FRotator                               in_rot;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_ProjSpear_Tek_set_rotation_towards_projectile;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_ Destroy Projectile
// 0x0001 (0x0001 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear__Destroy_Projectile final
{
public:
	bool                                          success;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear__Destroy_Projectile;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_ Get Animations
// 0x01B0 (0x01B0 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear__Get_Animations final
{
public:
	struct FStruct_WeapAnimWith3P_V3              Attack_1;                                          // 0x0000(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Attack_2;                                          // 0x0018(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Attack_3;                                          // 0x0030(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Held_Blocking_Loop;                                // 0x0048(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Block_Recoil;                                      // 0x0060(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Perfect_Block;                                     // 0x0078(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Held_Deflecting_Loop;                              // 0x0090(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Deflect_Recoil;                                    // 0x00A8(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Perfect_Deflect;                                   // 0x00C0(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Dodge;                                             // 0x00D8(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Held_Air_Stab_Charge_Loop;                         // 0x00F0(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Air_Stab_Release;                                  // 0x0108(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Ground_Slam_Falling_Loop;                          // 0x0120(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Ground_Slam_Land;                                  // 0x0138(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Held_Spear_Toss_Pullback_Loop;                     // 0x0150(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Teleport_To_Spear_Midair;                          // 0x0168(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Teleport_To_Spear_Grounded;                        // 0x0180(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	struct FStruct_WeapAnimWith3P_V3              Fallback_Standard_Stab_like_in_water;              // 0x0198(0x0018)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear__Get_Animations;

// Function Interface_TekSpear.Interface_TekSpear_C.Torp Mode
// 0x0002 (0x0002 - 0x0000)
struct Interface_TekSpear_C_Torp_Mode_0 final
{
public:
	bool                                          Is_Damage_Mode;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Tranq_Mode;                                     // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Torp_Mode_0;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_ Get Ground Slam Final Hit dmg types
// 0x0010 (0x0010 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear__Get_Ground_Slam_Final_Hit_dmg_types final
{
public:
	class UClass*                                 Regular_dmg_type;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 torpor_dmg_type;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear__Get_Ground_Slam_Final_Hit_dmg_types;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_ Get Midair Attack Air Limit Used
// 0x0001 (0x0001 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear__Get_Midair_Attack_Air_Limit_Used final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear__Get_Midair_Attack_Air_Limit_Used;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_ Is Spear Projectile Valid
// 0x0010 (0x0010 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear__Is_Spear_Projectile_Valid final
{
public:
	bool                                          Is_Valid;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AShooterProjectile*                     Projectile_Ref;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear__Is_Spear_Projectile_Valid;

// Function Interface_TekSpear.Interface_TekSpear_C.Torp Mode
// 0x0002 (0x0002 - 0x0000)
struct Interface_TekSpear_C_Torp_Mode final
{
public:
	bool                                          _torpor;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Torp_Mode;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_ Set Dynamic Material Parameters
// 0x0010 (0x0010 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear__Set_Dynamic_Material_Parameters final
{
public:
	class UMaterialInstanceDynamic*               Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear__Set_Dynamic_Material_Parameters;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_ Set Midair Attack Air Limit Used
// 0x0002 (0x0002 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear__Set_Midair_Attack_Air_Limit_Used final
{
public:
	bool                                          Value_To_Set;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear__Set_Midair_Attack_Air_Limit_Used;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_ Set Parameters On Cascade VFX particles
// 0x0010 (0x0010 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear__Set_Parameters_On_Cascade_VFX_particles final
{
public:
	class UParticleSystemComponent*               Cascade_VFX;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear__Set_Parameters_On_Cascade_VFX_particles;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_ Set Parameters On Niagara VFX particles
// 0x0010 (0x0010 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear__Set_Parameters_On_Niagara_VFX_particles final
{
public:
	class UNiagaraComponent*                      Niagara_VFX;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear__Set_Parameters_On_Niagara_VFX_particles;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_CanSetWeaponStateTo
// 0x000C (0x000C - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear_CanSetWeaponStateTo final
{
public:
	uint8                                         DesiredWeaponState;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanSet;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Fail_Reason;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear_CanSetWeaponStateTo;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_GetFakeExpandedScale
// 0x0008 (0x0008 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear_GetFakeExpandedScale final
{
public:
	double                                        FakeExpandedScale;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear_GetFakeExpandedScale;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_GetLastLocationProjectileWasAt
// 0x0018 (0x0018 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear_GetLastLocationProjectileWasAt final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear_GetLastLocationProjectileWasAt;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_GetLastSelectedTeleportSpot
// 0x0020 (0x0020 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear_GetLastSelectedTeleportSpot final
{
public:
	bool                                          IsLastTPLocationAvailable;                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastTPLocation;                                    // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear_GetLastSelectedTeleportSpot;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_GetState
// 0x0007 (0x0007 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear_GetState final
{
public:
	uint8                                         CurrentState;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          pullback;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_midair_stab_charging;                           // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_midair_stab_releasing;                          // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBlocking;                                        // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDoding;                                          // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDeflecting;                                      // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear_GetState;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_GetThrownSpearProjRef
// 0x0010 (0x0010 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear_GetThrownSpearProjRef final
{
public:
	bool                                          Fround_Valid_Proj;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AShooterProjectile*                     Spear_Ref;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear_GetThrownSpearProjRef;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_GetWantsToBlock
// 0x0001 (0x0001 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear_GetWantsToBlock final
{
public:
	bool                                          WantsToBlock;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear_GetWantsToBlock;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_SetHideWeapon
// 0x0002 (0x0002 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear_SetHideWeapon final
{
public:
	bool                                          HiddenState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          success;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear_SetHideWeapon;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_SetLastLocationProjectileWasAt
// 0x0020 (0x0020 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear_SetLastLocationProjectileWasAt final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear_SetLastLocationProjectileWasAt;

// Function Interface_TekSpear.Interface_TekSpear_C.Interface_TekSpear_SetLastSelectedTeleportSpot
// 0x0020 (0x0020 - 0x0000)
struct Interface_TekSpear_C_Interface_TekSpear_SetLastSelectedTeleportSpot final
{
public:
	struct FVector                                TeleportSpot;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_TekSpear_C_Interface_TekSpear_SetLastSelectedTeleportSpot;

}

