#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangeEngine

#include "Basic.hpp"

#include "InterchangeEngine_structs.hpp"
#include "InterchangeCore_structs.hpp"


namespace SDK::Params
{

// Function InterchangeEngine.InterchangeFilePickerBase.ScriptedFilePickerForTranslatorAssetType
// 0x0060 (0x0060 - 0x0000)
struct InterchangeFilePickerBase_ScriptedFilePickerForTranslatorAssetType final
{
public:
	EInterchangeTranslatorAssetType               TranslatorAssetType;                               // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeFilePickerParameters       Parameters;                                        // 0x0008(0x0040)(Parm, OutParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutFilenames;                                      // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeFilePickerBase_ScriptedFilePickerForTranslatorAssetType;

// Function InterchangeEngine.InterchangeFilePickerBase.ScriptedFilePickerForTranslatorType
// 0x0060 (0x0060 - 0x0000)
struct InterchangeFilePickerBase_ScriptedFilePickerForTranslatorType final
{
public:
	EInterchangeTranslatorType                    TranslatorType;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInterchangeFilePickerParameters       Parameters;                                        // 0x0008(0x0040)(Parm, OutParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutFilenames;                                      // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeFilePickerBase_ScriptedFilePickerForTranslatorType;

// Function InterchangeEngine.InterchangePipelineConfigurationBase.ScriptedShowPipelineConfigurationDialog
// 0x0040 (0x0040 - 0x0000)
struct InterchangePipelineConfigurationBase_ScriptedShowPipelineConfigurationDialog final
{
public:
	TArray<struct FInterchangeStackInfo>          PipelineStacks;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UInterchangePipelineBase*>       OutPipelines;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UInterchangeSourceData*                 SourceData;                                        // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeTranslatorBase*             Translator;                                        // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeBaseNodeContainer*          BaseNodeContainer;                                 // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangePipelineConfigurationDialogResult ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePipelineConfigurationBase_ScriptedShowPipelineConfigurationDialog;

// Function InterchangeEngine.InterchangePipelineConfigurationBase.ScriptedShowReimportPipelineConfigurationDialog
// 0x0048 (0x0048 - 0x0000)
struct InterchangePipelineConfigurationBase_ScriptedShowReimportPipelineConfigurationDialog final
{
public:
	TArray<struct FInterchangeStackInfo>          PipelineStacks;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UInterchangePipelineBase*>       OutPipelines;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UInterchangeSourceData*                 SourceData;                                        // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeTranslatorBase*             Translator;                                        // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeBaseNodeContainer*          BaseNodeContainer;                                 // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReimportAsset;                                     // 0x0038(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangePipelineConfigurationDialogResult ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePipelineConfigurationBase_ScriptedShowReimportPipelineConfigurationDialog;

// Function InterchangeEngine.InterchangePipelineConfigurationBase.ScriptedShowScenePipelineConfigurationDialog
// 0x0040 (0x0040 - 0x0000)
struct InterchangePipelineConfigurationBase_ScriptedShowScenePipelineConfigurationDialog final
{
public:
	TArray<struct FInterchangeStackInfo>          PipelineStacks;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UInterchangePipelineBase*>       OutPipelines;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UInterchangeSourceData*                 SourceData;                                        // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeTranslatorBase*             Translator;                                        // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeBaseNodeContainer*          BaseNodeContainer;                                 // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangePipelineConfigurationDialogResult ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePipelineConfigurationBase_ScriptedShowScenePipelineConfigurationDialog;

// Function InterchangeEngine.InterchangeEditorSettings.SetUsedGroupName
// 0x0008 (0x0008 - 0x0000)
struct InterchangeEditorSettings_SetUsedGroupName final
{
public:
	class FName                                   InUsedGroupName;                                   // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeEditorSettings_SetUsedGroupName;

// Function InterchangeEngine.InterchangeEditorSettings.GetSelectableItems
// 0x0010 (0x0010 - 0x0000)
struct InterchangeEditorSettings_GetSelectableItems final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeEditorSettings_GetSelectableItems;

// Function InterchangeEngine.InterchangeEditorSettings.GetUsedGroupName
// 0x0008 (0x0008 - 0x0000)
struct InterchangeEditorSettings_GetUsedGroupName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeEditorSettings_GetUsedGroupName;

// Function InterchangeEngine.InterchangeAssetImportData.GetNodeContainer
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAssetImportData_GetNodeContainer final
{
public:
	class UInterchangeBaseNodeContainer*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_GetNodeContainer;

// Function InterchangeEngine.InterchangeAssetImportData.GetNumberOfPipelines
// 0x0004 (0x0004 - 0x0000)
struct InterchangeAssetImportData_GetNumberOfPipelines final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_GetNumberOfPipelines;

// Function InterchangeEngine.InterchangeAssetImportData.GetPipelines
// 0x0010 (0x0010 - 0x0000)
struct InterchangeAssetImportData_GetPipelines final
{
public:
	TArray<class UObject*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_GetPipelines;

// Function InterchangeEngine.InterchangeAssetImportData.GetStoredFactoryNode
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAssetImportData_GetStoredFactoryNode final
{
public:
	class FString                                 InNodeUniqueId;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeFactoryBaseNode*            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_GetStoredFactoryNode;

// Function InterchangeEngine.InterchangeAssetImportData.GetStoredNode
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAssetImportData_GetStoredNode final
{
public:
	class FString                                 InNodeUniqueId;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInterchangeBaseNode*             ReturnValue;                                       // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_GetStoredNode;

// Function InterchangeEngine.InterchangeAssetImportData.GetTranslatorSettings
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAssetImportData_GetTranslatorSettings final
{
public:
	const class UInterchangeTranslatorSettings*   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_GetTranslatorSettings;

// Function InterchangeEngine.InterchangeAssetImportData.ScriptExtractDisplayLabels
// 0x0010 (0x0010 - 0x0000)
struct InterchangeAssetImportData_ScriptExtractDisplayLabels final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_ScriptExtractDisplayLabels;

// Function InterchangeEngine.InterchangeAssetImportData.ScriptExtractFilenames
// 0x0010 (0x0010 - 0x0000)
struct InterchangeAssetImportData_ScriptExtractFilenames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_ScriptExtractFilenames;

// Function InterchangeEngine.InterchangeAssetImportData.ScriptGetFirstFilename
// 0x0010 (0x0010 - 0x0000)
struct InterchangeAssetImportData_ScriptGetFirstFilename final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_ScriptGetFirstFilename;

// Function InterchangeEngine.InterchangeAssetImportData.SetNodeContainer
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAssetImportData_SetNodeContainer final
{
public:
	class UInterchangeBaseNodeContainer*          InNodeContainer;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_SetNodeContainer;

// Function InterchangeEngine.InterchangeAssetImportData.SetPipelines
// 0x0010 (0x0010 - 0x0000)
struct InterchangeAssetImportData_SetPipelines final
{
public:
	TArray<class UObject*>                        InPipelines;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_SetPipelines;

// Function InterchangeEngine.InterchangeAssetImportData.SetTranslatorSettings
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAssetImportData_SetTranslatorSettings final
{
public:
	class UInterchangeTranslatorSettings*         TranslatorSettings;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAssetImportData_SetTranslatorSettings;

// Function InterchangeEngine.InterchangePipelineStackOverride.AddBlueprintPipeline
// 0x0008 (0x0008 - 0x0000)
struct InterchangePipelineStackOverride_AddBlueprintPipeline final
{
public:
	class UInterchangeBlueprintPipelineBase*      PipelineBase;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineStackOverride_AddBlueprintPipeline;

// Function InterchangeEngine.InterchangePipelineStackOverride.AddPipeline
// 0x0008 (0x0008 - 0x0000)
struct InterchangePipelineStackOverride_AddPipeline final
{
public:
	class UInterchangePipelineBase*               PipelineBase;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineStackOverride_AddPipeline;

// Function InterchangeEngine.InterchangePipelineStackOverride.AddPythonPipeline
// 0x0008 (0x0008 - 0x0000)
struct InterchangePipelineStackOverride_AddPythonPipeline final
{
public:
	class UInterchangePythonPipelineBase*         PipelineBase;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineStackOverride_AddPythonPipeline;

// Function InterchangeEngine.InterchangeManager.CreateSourceData
// 0x0018 (0x0018 - 0x0000)
struct InterchangeManager_CreateSourceData final
{
public:
	class FString                                 InFilename;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeSourceData*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeManager_CreateSourceData;

// Function InterchangeEngine.InterchangeManager.GetInterchangeManagerScripted
// 0x0008 (0x0008 - 0x0000)
struct InterchangeManager_GetInterchangeManagerScripted final
{
public:
	class UInterchangeManager*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeManager_GetInterchangeManagerScripted;

// Function InterchangeEngine.InterchangeManager.ExportAsset
// 0x0010 (0x0010 - 0x0000)
struct InterchangeManager_ExportAsset final
{
public:
	const class UObject*                          Asset;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutomated;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeManager_ExportAsset;

// Function InterchangeEngine.InterchangeManager.ExportScene
// 0x0010 (0x0010 - 0x0000)
struct InterchangeManager_ExportScene final
{
public:
	const class UObject*                          World;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutomated;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeManager_ExportScene;

// Function InterchangeEngine.InterchangeManager.ImportAsset
// 0x00F8 (0x00F8 - 0x0000)
struct InterchangeManager_ImportAsset final
{
public:
	class FString                                 ContentPath;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInterchangeSourceData*           SourceData;                                        // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FImportAssetParameters                 ImportAssetParameters;                             // 0x0018(0x00C8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        OutImportedObjects;                                // 0x00E0(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeManager_ImportAsset;

// Function InterchangeEngine.InterchangeManager.ImportScene
// 0x00E8 (0x00E8 - 0x0000)
struct InterchangeManager_ImportScene final
{
public:
	class FString                                 ContentPath;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInterchangeSourceData*           SourceData;                                        // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FImportAssetParameters                 ImportAssetParameters;                             // 0x0018(0x00C8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeManager_ImportScene;

// Function InterchangeEngine.InterchangeManager.ScriptedImportAssetAsync
// 0x00E8 (0x00E8 - 0x0000)
struct InterchangeManager_ScriptedImportAssetAsync final
{
public:
	class FString                                 ContentPath;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInterchangeSourceData*           SourceData;                                        // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FImportAssetParameters                 ImportAssetParameters;                             // 0x0018(0x00C8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeManager_ScriptedImportAssetAsync;

// Function InterchangeEngine.InterchangeManager.ScriptedImportSceneAsync
// 0x00E8 (0x00E8 - 0x0000)
struct InterchangeManager_ScriptedImportSceneAsync final
{
public:
	class FString                                 ContentPath;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInterchangeSourceData*           SourceData;                                        // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FImportAssetParameters                 ImportAssetParameters;                             // 0x0018(0x00C8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeManager_ScriptedImportSceneAsync;

// Function InterchangeEngine.InterchangeManager.GetRegisteredFactoryClass
// 0x0010 (0x0010 - 0x0000)
struct InterchangeManager_GetRegisteredFactoryClass final
{
public:
	const class UClass*                           ClassToMake;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UClass*                           ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeManager_GetRegisteredFactoryClass;

// Function InterchangeEngine.InterchangeMeshUtilities.ScriptedImportMorphTarget
// 0x0030 (0x0030 - 0x0000)
struct InterchangeMeshUtilities_ScriptedImportMorphTarget final
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODIndex;                                          // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInterchangeSourceData*           SourceData;                                        // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MorphTargetName;                                   // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeMeshUtilities_ScriptedImportMorphTarget;

}

