#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangeCore

#include "Basic.hpp"

#include "InterchangeCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function InterchangeCore.InterchangeFactoryBase.GetFactoryClass
// 0x0008 (0x0008 - 0x0000)
struct InterchangeFactoryBase_GetFactoryClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBase_GetFactoryClass;

// Function InterchangeCore.InterchangeSourceData.SetFilename
// 0x0018 (0x0018 - 0x0000)
struct InterchangeSourceData_SetFilename final
{
public:
	class FString                                 InFilename;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSourceData_SetFilename;

// Function InterchangeCore.InterchangeSourceData.GetFilename
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSourceData_GetFilename final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeSourceData_GetFilename;

// Function InterchangeCore.InterchangePipelineBase.FindOrAddPropertyStates
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineBase_FindOrAddPropertyStates final
{
public:
	class FName                                   PropertyPath;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangePipelinePropertyStates     ReturnValue;                                       // 0x0008(0x0005)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePipelineBase_FindOrAddPropertyStates;

// Function InterchangeCore.InterchangePipelineBase.ScriptedExecuteExportPipeline
// 0x0008 (0x0008 - 0x0000)
struct InterchangePipelineBase_ScriptedExecuteExportPipeline final
{
public:
	class UInterchangeBaseNodeContainer*          BaseNodeContainer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineBase_ScriptedExecuteExportPipeline;

// Function InterchangeCore.InterchangePipelineBase.ScriptedExecutePipeline
// 0x0028 (0x0028 - 0x0000)
struct InterchangePipelineBase_ScriptedExecutePipeline final
{
public:
	class UInterchangeBaseNodeContainer*          BaseNodeContainer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInterchangeSourceData*>         SourceDatas;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ContentBasePath;                                   // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineBase_ScriptedExecutePipeline;

// Function InterchangeCore.InterchangePipelineBase.ScriptedExecutePostBroadcastPipeline
// 0x0028 (0x0028 - 0x0000)
struct InterchangePipelineBase_ScriptedExecutePostBroadcastPipeline final
{
public:
	const class UInterchangeBaseNodeContainer*    BaseNodeContainer;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FactoryNodeKey;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                CreatedAsset;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAReimport;                                      // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePipelineBase_ScriptedExecutePostBroadcastPipeline;

// Function InterchangeCore.InterchangePipelineBase.ScriptedExecutePostFactoryPipeline
// 0x0028 (0x0028 - 0x0000)
struct InterchangePipelineBase_ScriptedExecutePostFactoryPipeline final
{
public:
	const class UInterchangeBaseNodeContainer*    BaseNodeContainer;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FactoryNodeKey;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                CreatedAsset;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAReimport;                                      // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePipelineBase_ScriptedExecutePostFactoryPipeline;

// Function InterchangeCore.InterchangePipelineBase.ScriptedExecutePostImportPipeline
// 0x0028 (0x0028 - 0x0000)
struct InterchangePipelineBase_ScriptedExecutePostImportPipeline final
{
public:
	const class UInterchangeBaseNodeContainer*    BaseNodeContainer;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FactoryNodeKey;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                CreatedAsset;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAReimport;                                      // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePipelineBase_ScriptedExecutePostImportPipeline;

// Function InterchangeCore.InterchangePipelineBase.ScriptedSetReimportSourceIndex
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineBase_ScriptedSetReimportSourceIndex final
{
public:
	class UClass*                                 ReimportObjectClass;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SourceFileIndex;                                   // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePipelineBase_ScriptedSetReimportSourceIndex;

// Function InterchangeCore.InterchangePipelineBase.DoesPropertyStatesExist
// 0x000C (0x000C - 0x0000)
struct InterchangePipelineBase_DoesPropertyStatesExist final
{
public:
	class FName                                   PropertyPath;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePipelineBase_DoesPropertyStatesExist;

// Function InterchangeCore.InterchangePipelineBase.ScriptedGetPipelineDisplayName
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineBase_ScriptedGetPipelineDisplayName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineBase_ScriptedGetPipelineDisplayName;

// Function InterchangeCore.InterchangeBaseNode.AddBooleanAttribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_AddBooleanAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_AddBooleanAttribute;

// Function InterchangeCore.InterchangeBaseNode.AddDoubleAttribute
// 0x0020 (0x0020 - 0x0000)
struct InterchangeBaseNode_AddDoubleAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Value;                                             // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_AddDoubleAttribute;

// Function InterchangeCore.InterchangeBaseNode.AddFloatAttribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_AddFloatAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_AddFloatAttribute;

// Function InterchangeCore.InterchangeBaseNode.AddGuidAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_AddGuidAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Value;                                             // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_AddGuidAttribute;

// Function InterchangeCore.InterchangeBaseNode.AddInt32Attribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_AddInt32Attribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_AddInt32Attribute;

// Function InterchangeCore.InterchangeBaseNode.AddLinearColorAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_AddLinearColorAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_AddLinearColorAttribute;

// Function InterchangeCore.InterchangeBaseNode.AddStringAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_AddStringAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_AddStringAttribute;

// Function InterchangeCore.InterchangeBaseNode.AddVector2Attribute
// 0x0020 (0x0020 - 0x0000)
struct InterchangeBaseNode_AddVector2Attribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2f                              Value;                                             // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_AddVector2Attribute;

// Function InterchangeCore.InterchangeBaseNode.InitializeNode
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_InitializeNode final
{
public:
	class FString                                 UniqueID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayLabel;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeNodeContainerType                 NodeContainerType;                                 // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_InitializeNode;

// Function InterchangeCore.InterchangeBaseNode.RemoveAttribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_RemoveAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_RemoveAttribute;

// Function InterchangeCore.InterchangeBaseNode.SetAssetName
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_SetAssetName final
{
public:
	class FString                                 AssetName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_SetAssetName;

// Function InterchangeCore.InterchangeBaseNode.SetDisplayLabel
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_SetDisplayLabel final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_SetDisplayLabel;

// Function InterchangeCore.InterchangeBaseNode.SetEnabled
// 0x0002 (0x0002 - 0x0000)
struct InterchangeBaseNode_SetEnabled final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNode_SetEnabled;

// Function InterchangeCore.InterchangeBaseNode.SetParentUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_SetParentUid final
{
public:
	class FString                                 ParentUid;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_SetParentUid;

// Function InterchangeCore.InterchangeBaseNode.AddTargetNodeUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_AddTargetNodeUid final
{
public:
	class FString                                 AssetUid;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_AddTargetNodeUid;

// Function InterchangeCore.InterchangeBaseNode.GetAssetName
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNode_GetAssetName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetAssetName;

// Function InterchangeCore.InterchangeBaseNode.GetBooleanAttribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_GetBooleanAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OutValue;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetBooleanAttribute;

// Function InterchangeCore.InterchangeBaseNode.GetDisplayLabel
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNode_GetDisplayLabel final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetDisplayLabel;

// Function InterchangeCore.InterchangeBaseNode.GetDoubleAttribute
// 0x0020 (0x0020 - 0x0000)
struct InterchangeBaseNode_GetDoubleAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutValue;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetDoubleAttribute;

// Function InterchangeCore.InterchangeBaseNode.GetFloatAttribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_GetFloatAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutValue;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetFloatAttribute;

// Function InterchangeCore.InterchangeBaseNode.GetGuidAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_GetGuidAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OutValue;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetGuidAttribute;

// Function InterchangeCore.InterchangeBaseNode.GetInt32Attribute
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_GetInt32Attribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutValue;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetInt32Attribute;

// Function InterchangeCore.InterchangeBaseNode.GetLinearColorAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_GetLinearColorAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OutValue;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetLinearColorAttribute;

// Function InterchangeCore.InterchangeBaseNode.GetNodeContainerType
// 0x0001 (0x0001 - 0x0000)
struct InterchangeBaseNode_GetNodeContainerType final
{
public:
	EInterchangeNodeContainerType                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetNodeContainerType;

// Function InterchangeCore.InterchangeBaseNode.GetParentUid
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNode_GetParentUid final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetParentUid;

// Function InterchangeCore.InterchangeBaseNode.GetStringAttribute
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNode_GetStringAttribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutValue;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetStringAttribute;

// Function InterchangeCore.InterchangeBaseNode.GetTargetNodeCount
// 0x0004 (0x0004 - 0x0000)
struct InterchangeBaseNode_GetTargetNodeCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetTargetNodeCount;

// Function InterchangeCore.InterchangeBaseNode.GetTargetNodeUids
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNode_GetTargetNodeUids final
{
public:
	TArray<class FString>                         OutTargetAssets;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetTargetNodeUids;

// Function InterchangeCore.InterchangeBaseNode.GetUniqueID
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNode_GetUniqueID final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetUniqueID;

// Function InterchangeCore.InterchangeBaseNode.GetVector2Attribute
// 0x0020 (0x0020 - 0x0000)
struct InterchangeBaseNode_GetVector2Attribute final
{
public:
	class FString                                 NodeAttributeKey;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2f                              OutValue;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_GetVector2Attribute;

// Function InterchangeCore.InterchangeBaseNode.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct InterchangeBaseNode_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNode_IsEnabled;

// Function InterchangeCore.InterchangeBaseNode.RemoveTargetNodeUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNode_RemoveTargetNodeUid final
{
public:
	class FString                                 AssetUid;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNode_RemoveTargetNodeUid;

// Function InterchangeCore.InterchangeBaseNodeContainer.AddNode
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNodeContainer_AddNode final
{
public:
	class UInterchangeBaseNode*                   Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_AddNode;

// Function InterchangeCore.InterchangeBaseNodeContainer.GetNodeChildren
// 0x0020 (0x0020 - 0x0000)
struct InterchangeBaseNodeContainer_GetNodeChildren final
{
public:
	class FString                                 NodeUniqueID;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChildIndex;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInterchangeBaseNode*                   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_GetNodeChildren;

// Function InterchangeCore.InterchangeBaseNodeContainer.LoadFromFile
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNodeContainer_LoadFromFile final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_LoadFromFile;

// Function InterchangeCore.InterchangeBaseNodeContainer.ReplaceNode
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNodeContainer_ReplaceNode final
{
public:
	class FString                                 NodeUniqueID;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeFactoryBaseNode*            NewNode;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_ReplaceNode;

// Function InterchangeCore.InterchangeBaseNodeContainer.SaveToFile
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNodeContainer_SaveToFile final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_SaveToFile;

// Function InterchangeCore.InterchangeBaseNodeContainer.SetNodeParentUid
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNodeContainer_SetNodeParentUid final
{
public:
	class FString                                 NodeUniqueID;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewParentNodeUid;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_SetNodeParentUid;

// Function InterchangeCore.InterchangeBaseNodeContainer.GetFactoryNode
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNodeContainer_GetFactoryNode final
{
public:
	class FString                                 NodeUniqueID;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangeFactoryBaseNode*            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_GetFactoryNode;

// Function InterchangeCore.InterchangeBaseNodeContainer.GetIsAncestor
// 0x0028 (0x0028 - 0x0000)
struct InterchangeBaseNodeContainer_GetIsAncestor final
{
public:
	class FString                                 NodeUniqueID;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AncestorUID;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_GetIsAncestor;

// Function InterchangeCore.InterchangeBaseNodeContainer.GetNode
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNodeContainer_GetNode final
{
public:
	class FString                                 NodeUniqueID;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInterchangeBaseNode*             ReturnValue;                                       // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_GetNode;

// Function InterchangeCore.InterchangeBaseNodeContainer.GetNodeChildrenCount
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNodeContainer_GetNodeChildrenCount final
{
public:
	class FString                                 NodeUniqueID;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_GetNodeChildrenCount;

// Function InterchangeCore.InterchangeBaseNodeContainer.GetNodeChildrenUids
// 0x0020 (0x0020 - 0x0000)
struct InterchangeBaseNodeContainer_GetNodeChildrenUids final
{
public:
	class FString                                 NodeUniqueID;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_GetNodeChildrenUids;

// Function InterchangeCore.InterchangeBaseNodeContainer.GetNodes
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNodeContainer_GetNodes final
{
public:
	const class UClass*                           ClassNode;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutNodes;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_GetNodes;

// Function InterchangeCore.InterchangeBaseNodeContainer.GetRoots
// 0x0010 (0x0010 - 0x0000)
struct InterchangeBaseNodeContainer_GetRoots final
{
public:
	TArray<class FString>                         RootNodes;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_GetRoots;

// Function InterchangeCore.InterchangeBaseNodeContainer.IsNodeUidValid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeBaseNodeContainer_IsNodeUidValid final
{
public:
	class FString                                 NodeUniqueID;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeBaseNodeContainer_IsNodeUidValid;

// Function InterchangeCore.InterchangeFactoryBaseNode.AddFactoryDependencyUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeFactoryBaseNode_AddFactoryDependencyUid final
{
public:
	class FString                                 DependencyUid;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_AddFactoryDependencyUid;

// Function InterchangeCore.InterchangeFactoryBaseNode.RemoveFactoryDependencyUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeFactoryBaseNode_RemoveFactoryDependencyUid final
{
public:
	class FString                                 DependencyUid;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_RemoveFactoryDependencyUid;

// Function InterchangeCore.InterchangeFactoryBaseNode.SetCustomLevelUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeFactoryBaseNode_SetCustomLevelUid final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_SetCustomLevelUid;

// Function InterchangeCore.InterchangeFactoryBaseNode.SetCustomReferenceObject
// 0x0028 (0x0028 - 0x0000)
struct InterchangeFactoryBaseNode_SetCustomReferenceObject final
{
public:
	struct FSoftObjectPath                        AttributeValue;                                    // 0x0000(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_SetCustomReferenceObject;

// Function InterchangeCore.InterchangeFactoryBaseNode.SetCustomSubPath
// 0x0018 (0x0018 - 0x0000)
struct InterchangeFactoryBaseNode_SetCustomSubPath final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_SetCustomSubPath;

// Function InterchangeCore.InterchangeFactoryBaseNode.SetForceNodeReimport
// 0x0001 (0x0001 - 0x0000)
struct InterchangeFactoryBaseNode_SetForceNodeReimport final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_SetForceNodeReimport;

// Function InterchangeCore.InterchangeFactoryBaseNode.SetReimportStrategyFlags
// 0x0002 (0x0002 - 0x0000)
struct InterchangeFactoryBaseNode_SetReimportStrategyFlags final
{
public:
	EReimportStrategyFlags                        ReimportStrategyFlags;                             // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_SetReimportStrategyFlags;

// Function InterchangeCore.InterchangeFactoryBaseNode.SetSkipNodeImport
// 0x0001 (0x0001 - 0x0000)
struct InterchangeFactoryBaseNode_SetSkipNodeImport final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_SetSkipNodeImport;

// Function InterchangeCore.InterchangeFactoryBaseNode.UnsetForceNodeReimport
// 0x0001 (0x0001 - 0x0000)
struct InterchangeFactoryBaseNode_UnsetForceNodeReimport final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_UnsetForceNodeReimport;

// Function InterchangeCore.InterchangeFactoryBaseNode.UnsetSkipNodeImport
// 0x0001 (0x0001 - 0x0000)
struct InterchangeFactoryBaseNode_UnsetSkipNodeImport final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_UnsetSkipNodeImport;

// Function InterchangeCore.InterchangeFactoryBaseNode.GetCustomLevelUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeFactoryBaseNode_GetCustomLevelUid final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_GetCustomLevelUid;

// Function InterchangeCore.InterchangeFactoryBaseNode.GetCustomReferenceObject
// 0x0028 (0x0028 - 0x0000)
struct InterchangeFactoryBaseNode_GetCustomReferenceObject final
{
public:
	struct FSoftObjectPath                        AttributeValue;                                    // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_GetCustomReferenceObject;

// Function InterchangeCore.InterchangeFactoryBaseNode.GetCustomSubPath
// 0x0018 (0x0018 - 0x0000)
struct InterchangeFactoryBaseNode_GetCustomSubPath final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_GetCustomSubPath;

// Function InterchangeCore.InterchangeFactoryBaseNode.GetFactoryDependencies
// 0x0010 (0x0010 - 0x0000)
struct InterchangeFactoryBaseNode_GetFactoryDependencies final
{
public:
	TArray<class FString>                         OutDependencies;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_GetFactoryDependencies;

// Function InterchangeCore.InterchangeFactoryBaseNode.GetFactoryDependenciesCount
// 0x0004 (0x0004 - 0x0000)
struct InterchangeFactoryBaseNode_GetFactoryDependenciesCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_GetFactoryDependenciesCount;

// Function InterchangeCore.InterchangeFactoryBaseNode.GetFactoryDependency
// 0x0018 (0x0018 - 0x0000)
struct InterchangeFactoryBaseNode_GetFactoryDependency final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutDependency;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_GetFactoryDependency;

// Function InterchangeCore.InterchangeFactoryBaseNode.GetReimportStrategyFlags
// 0x0001 (0x0001 - 0x0000)
struct InterchangeFactoryBaseNode_GetReimportStrategyFlags final
{
public:
	EReimportStrategyFlags                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_GetReimportStrategyFlags;

// Function InterchangeCore.InterchangeFactoryBaseNode.IsRuntimeImportAllowed
// 0x0001 (0x0001 - 0x0000)
struct InterchangeFactoryBaseNode_IsRuntimeImportAllowed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_IsRuntimeImportAllowed;

// Function InterchangeCore.InterchangeFactoryBaseNode.ShouldForceNodeReimport
// 0x0001 (0x0001 - 0x0000)
struct InterchangeFactoryBaseNode_ShouldForceNodeReimport final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_ShouldForceNodeReimport;

// Function InterchangeCore.InterchangeFactoryBaseNode.ShouldSkipNodeImport
// 0x0001 (0x0001 - 0x0000)
struct InterchangeFactoryBaseNode_ShouldSkipNodeImport final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeFactoryBaseNode_ShouldSkipNodeImport;

// Function InterchangeCore.InterchangeSourceNode.InitializeSourceNode
// 0x0020 (0x0020 - 0x0000)
struct InterchangeSourceNode_InitializeSourceNode final
{
public:
