#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangeImport

#include "Basic.hpp"

#include "InterchangeImport_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "InterchangeCore_classes.hpp"
#include "UnrealUSDWrapper_structs.hpp"
#include "USDClasses_structs.hpp"


namespace SDK
{

// Class InterchangeImport.InterchangeAnimationPayloadInterface
// 0x0000 (0x0000 - 0x0000)
class IInterchangeAnimationPayloadInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeAnimationPayloadInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeAnimationPayloadInterface")
	}
	static class IInterchangeAnimationPayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeAnimationPayloadInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IInterchangeAnimationPayloadInterface;

// Class InterchangeImport.InterchangeAssetUserData
// 0x0050 (0x0078 - 0x0028)
class UInterchangeAssetUserData final : public UAssetUserData
{
public:
	TMap<class FString, class FString>            MetaData;                                          // 0x0028(0x0050)(Edit, BlueprintVisible, EditConst, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeAssetUserData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeAssetUserData")
	}
	static class UInterchangeAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeAssetUserData>();
	}
};
DUMPER7_ASSERTS_UInterchangeAssetUserData;

// Class InterchangeImport.InterchangeBlockedTexturePayloadInterface
// 0x0000 (0x0000 - 0x0000)
class IInterchangeBlockedTexturePayloadInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeBlockedTexturePayloadInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeBlockedTexturePayloadInterface")
	}
	static class IInterchangeBlockedTexturePayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeBlockedTexturePayloadInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IInterchangeBlockedTexturePayloadInterface;

// Class InterchangeImport.InterchangeActorFactory
// 0x0000 (0x0030 - 0x0030)
class UInterchangeActorFactory : public UInterchangeFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeActorFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeActorFactory")
	}
	static class UInterchangeActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeActorFactory>();
	}
};
DUMPER7_ASSERTS_UInterchangeActorFactory;

// Class InterchangeImport.InterchangeDecalActorFactory
// 0x0000 (0x0030 - 0x0030)
class UInterchangeDecalActorFactory final : public UInterchangeActorFactory
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeDecalActorFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeDecalActorFactory")
	}
	static class UInterchangeDecalActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeDecalActorFactory>();
	}
};
DUMPER7_ASSERTS_UInterchangeDecalActorFactory;

// Class InterchangeImport.InterchangeLevelFactory
// 0x0000 (0x0030 - 0x0030)
class UInterchangeLevelFactory final : public UInterchangeFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeLevelFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeLevelFactory")
	}
	static class UInterchangeLevelFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeLevelFactory>();
	}
};
DUMPER7_ASSERTS_UInterchangeLevelFactory;

// Class InterchangeImport.InterchangeLevelSequenceFactory
// 0x0008 (0x0038 - 0x0030)
class UInterchangeLevelSequenceFactory final : public UInterchangeFactoryBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeLevelSequenceFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeLevelSequenceFactory")
	}
	static class UInterchangeLevelSequenceFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeLevelSequenceFactory>();
	}
};
DUMPER7_ASSERTS_UInterchangeLevelSequenceFactory;

// Class InterchangeImport.InterchangeLightActorFactory
// 0x0000 (0x0030 - 0x0030)
class UInterchangeLightActorFactory final : public UInterchangeActorFactory
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeLightActorFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeLightActorFactory")
	}
	static class UInterchangeLightActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeLightActorFactory>();
	}
};
DUMPER7_ASSERTS_UInterchangeLightActorFactory;

// Class InterchangeImport.InterchangeMeshPayloadInterface
// 0x0000 (0x0000 - 0x0000)
class IInterchangeMeshPayloadInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeMeshPayloadInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeMeshPayloadInterface")
	}
	static class IInterchangeMeshPayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeMeshPayloadInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IInterchangeMeshPayloadInterface;

// Class InterchangeImport.InterchangeSceneImportAssetFactory
// 0x0000 (0x0030 - 0x0030)
class UInterchangeSceneImportAssetFactory final : public UInterchangeFactoryBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeSceneImportAssetFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeSceneImportAssetFactory")
	}
	static class UInterchangeSceneImportAssetFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeSceneImportAssetFactory>();
	}
};
DUMPER7_ASSERTS_UInterchangeSceneImportAssetFactory;

// Class InterchangeImport.InterchangeSceneVariantSetsFactory
// 0x0008 (0x0038 - 0x0030)
class UInterchangeSceneVariantSetsFactory final : public UInterchangeFactoryBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeSceneVariantSetsFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeSceneVariantSetsFactory")
	}
	static class UInterchangeSceneVariantSetsFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeSceneVariantSetsFactory>();
	}
};
DUMPER7_ASSERTS_UInterchangeSceneVariantSetsFactory;

// Class InterchangeImport.InterchangeSlicedTexturePayloadInterface
// 0x0000 (0x0000 - 0x0000)
class IInterchangeSlicedTexturePayloadInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeSlicedTexturePayloadInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeSlicedTexturePayloadInterface")
	}
	static class IInterchangeSlicedTexturePayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeSlicedTexturePayloadInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IInterchangeSlicedTexturePayloadInterface;

// Class InterchangeImport.InterchangeTextureLightProfilePayloadInterface
// 0x0000 (0x0000 - 0x0000)
class IInterchangeTextureLightProfilePayloadInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeTextureLightProfilePayloadInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeTextureLightProfilePayloadInterface")
	}
	static class IInterchangeTextureLightProfilePayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeTextureLightProfilePayloadInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IInterchangeTextureLightProfilePayloadInterface;

// Class InterchangeImport.InterchangeTexturePayloadInterface
// 0x0000 (0x0000 - 0x0000)
class IInterchangeTexturePayloadInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeTexturePayloadInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeTexturePayloadInterface")
	}
	static class IInterchangeTexturePayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeTexturePayloadInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IInterchangeTexturePayloadInterface;

// Class InterchangeImport.InterchangeVariantSetPayloadInterface
// 0x0000 (0x0000 - 0x0000)
class IInterchangeVariantSetPayloadInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeVariantSetPayloadInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeVariantSetPayloadInterface")
	}
	static class IInterchangeVariantSetPayloadInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInterchangeVariantSetPayloadInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IInterchangeVariantSetPayloadInterface;

// Class InterchangeImport.MaterialExpressionMaterialXRamp4
// 0x00D0 (0x0180 - 0x00B0)
class UMaterialExpressionMaterialXRamp4 final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       A;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       C;                                                 // 0x0128(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       D;                                                 // 0x0150(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x0178(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXRamp4")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXRamp4")
	}
	static class UMaterialExpressionMaterialXRamp4* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXRamp4>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXRamp4;

// Class InterchangeImport.InterchangeAnimSequenceFactory
// 0x01A8 (0x01D8 - 0x0030)
class UInterchangeAnimSequenceFactory final : public UInterchangeFactoryBase
{
public:
	uint8                                         Pad_30[0x1A8];                                     // 0x0030(0x01A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeAnimSequenceFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeAnimSequenceFactory")
	}
	static class UInterchangeAnimSequenceFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeAnimSequenceFactory>();
	}
};
DUMPER7_ASSERTS_UInterchangeAnimSequenceFactory;

// Class InterchangeImport.InterchangeFbxTranslatorSettings
// 0x0008 (0x0030 - 0x0028)
class UInterchangeFbxTranslatorSettings final : public UInterchangeTranslatorSettings
{
public:
	bool                                          bConvertScene;                                     // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceFrontXAxis;                                  // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConvertSceneUnit;                                 // 0x002A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepFbxNamespace;                                 // 0x002B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeFbxTranslatorSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeFbxTranslatorSettings")
	}
	static class UInterchangeFbxTranslatorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeFbxTranslatorSettings>();
	}
};
DUMPER7_ASSERTS_UInterchangeFbxTranslatorSettings;

// Class InterchangeImport.InterchangeFbxTranslator
// 0x0040 (0x0078 - 0x0038)
class UInterchangeFbxTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UInterchangeFbxTranslatorSettings*      CacheFbxTranslatorSettings;                        // 0x0058(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeFbxTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeFbxTranslator")
	}
	static class UInterchangeFbxTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeFbxTranslator>();
	}
};
DUMPER7_ASSERTS_UInterchangeFbxTranslator;

// Class InterchangeImport.InterchangeGLTFTranslator
// 0x0258 (0x0290 - 0x0038)
class UInterchangeGLTFTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_38[0x258];                                     // 0x0038(0x0258)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeGLTFTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeGLTFTranslator")
	}
	static class UInterchangeGLTFTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeGLTFTranslator>();
	}
};
DUMPER7_ASSERTS_UInterchangeGLTFTranslator;

// Class InterchangeImport.InterchangeMaterialXTranslator
// 0x0008 (0x0040 - 0x0038)
class UInterchangeMaterialXTranslator final : public UInterchangeTranslatorBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeMaterialXTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeMaterialXTranslator")
	}
	static class UInterchangeMaterialXTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeMaterialXTranslator>();
	}
};
DUMPER7_ASSERTS_UInterchangeMaterialXTranslator;

// Class InterchangeImport.MaterialExpressionMaterialXAppend3Vector
// 0x0078 (0x0128 - 0x00B0)
class UMaterialExpressionMaterialXAppend3Vector final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       C;                                                 // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXAppend3Vector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXAppend3Vector")
	}
	static class UMaterialExpressionMaterialXAppend3Vector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXAppend3Vector>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXAppend3Vector;

// Class InterchangeImport.MaterialExpressionMaterialXAppend4Vector
// 0x00A0 (0x0150 - 0x00B0)
class UMaterialExpressionMaterialXAppend4Vector final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       C;                                                 // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       D;                                                 // 0x0128(0x0028)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXAppend4Vector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXAppend4Vector")
	}
	static class UMaterialExpressionMaterialXAppend4Vector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXAppend4Vector>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXAppend4Vector;

// Class InterchangeImport.MaterialExpressionMaterialXBurn
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXBurn final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXBurn")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXBurn")
	}
	static class UMaterialExpressionMaterialXBurn* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXBurn>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXBurn;

// Class InterchangeImport.MaterialExpressionMaterialXDifference
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXDifference final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXDifference")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXDifference")
	}
	static class UMaterialExpressionMaterialXDifference* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXDifference>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXDifference;

// Class InterchangeImport.MaterialExpressionMaterialXDisjointOver
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXDisjointOver final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXDisjointOver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXDisjointOver")
	}
	static class UMaterialExpressionMaterialXDisjointOver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXDisjointOver>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXDisjointOver;

// Class InterchangeImport.MaterialExpressionMaterialXDodge
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXDodge final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXDodge")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXDodge")
	}
	static class UMaterialExpressionMaterialXDodge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXDodge>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXDodge;

// Class InterchangeImport.MaterialExpressionMaterialXFractal3D
// 0x00F8 (0x01A8 - 0x00B0)
class UMaterialExpressionMaterialXFractal3D final : public UMaterialExpression
{
public:
	struct FExpressionInput                       position;                                          // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Amplitude;                                         // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAmplitude;                                    // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExpressionInput                       Octaves;                                           // 0x0108(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ConstOctaves;                                      // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExpressionInput                       Lacunarity;                                        // 0x0138(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstLacunarity;                                   // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExpressionInput                       Diminish;                                          // 0x0168(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstDiminish;                                     // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTurbulence;                                       // 0x0198(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Levels;                                            // 0x019C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutputMin;                                         // 0x01A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutputMax;                                         // 0x01A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXFractal3D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXFractal3D")
	}
	static class UMaterialExpressionMaterialXFractal3D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXFractal3D>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXFractal3D;

// Class InterchangeImport.MaterialExpressionMaterialXIn
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXIn final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXIn")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXIn")
	}
	static class UMaterialExpressionMaterialXIn* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXIn>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXIn;

// Class InterchangeImport.MaterialExpressionMaterialXLuminance
// 0x0040 (0x00F0 - 0x00B0)
class UMaterialExpressionMaterialXLuminance final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           LuminanceFactors;                                  // 0x00D8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMaterialXLuminanceMode                       LuminanceMode;                                     // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXLuminance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXLuminance")
	}
	static class UMaterialExpressionMaterialXLuminance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXLuminance>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXLuminance;

// Class InterchangeImport.MaterialExpressionMaterialXMask
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXMask final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXMask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXMask")
	}
	static class UMaterialExpressionMaterialXMask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXMask>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXMask;

// Class InterchangeImport.MaterialExpressionMaterialXMatte
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXMatte final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXMatte")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXMatte")
	}
	static class UMaterialExpressionMaterialXMatte* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXMatte>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXMatte;

// Class InterchangeImport.MaterialExpressionMaterialXMinus
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXMinus final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXMinus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXMinus")
	}
	static class UMaterialExpressionMaterialXMinus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXMinus>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXMinus;

// Class InterchangeImport.MaterialExpressionMaterialXOut
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXOut final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXOut")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXOut")
	}
	static class UMaterialExpressionMaterialXOut* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXOut>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXOut;

// Class InterchangeImport.MaterialExpressionMaterialXOver
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXOver final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXOver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXOver")
	}
	static class UMaterialExpressionMaterialXOver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXOver>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXOver;

// Class InterchangeImport.MaterialExpressionMaterialXOverlay
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXOverlay final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXOverlay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXOverlay")
	}
	static class UMaterialExpressionMaterialXOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXOverlay>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXOverlay;

// Class InterchangeImport.MaterialExpressionMaterialXPlace2D
// 0x00D0 (0x0180 - 0x00B0)
class UMaterialExpressionMaterialXPlace2D final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Pivot;                                             // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Scale;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Offset;                                            // 0x0128(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       RotationAngle;                                     // 0x0150(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstRotationAngle;                                // 0x0178(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x017C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXPlace2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXPlace2D")
	}
	static class UMaterialExpressionMaterialXPlace2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXPlace2D>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXPlace2D;

// Class InterchangeImport.MaterialExpressionMaterialXPlus
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXPlus final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXPlus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXPlus")
	}
	static class UMaterialExpressionMaterialXPlus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXPlus>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXPlus;

// Class InterchangeImport.MaterialExpressionMaterialXPremult
// 0x0028 (0x00D8 - 0x00B0)
class UMaterialExpressionMaterialXPremult final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXPremult")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXPremult")
	}
	static class UMaterialExpressionMaterialXPremult* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXPremult>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXPremult;

// Class InterchangeImport.MaterialExpressionMaterialXRampLeftRight
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXRampLeftRight final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       A;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXRampLeftRight")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXRampLeftRight")
	}
	static class UMaterialExpressionMaterialXRampLeftRight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXRampLeftRight>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXRampLeftRight;

// Class InterchangeImport.MaterialExpressionMaterialXRampTopBottom
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXRampTopBottom final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       A;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXRampTopBottom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXRampTopBottom")
	}
	static class UMaterialExpressionMaterialXRampTopBottom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXRampTopBottom>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXRampTopBottom;

// Class InterchangeImport.MaterialExpressionMaterialXRemap
// 0x00D8 (0x0188 - 0x00B0)
class UMaterialExpressionMaterialXRemap final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       InputLow;                                          // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       InputHigh;                                         // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       TargetLow;                                         // 0x0128(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       TargetHigh;                                        // 0x0150(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         InputLowDefault;                                   // 0x0178(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputHighDefault;                                  // 0x017C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetLowDefault;                                  // 0x0180(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetHighDefault;                                 // 0x0184(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXRemap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXRemap")
	}
	static class UMaterialExpressionMaterialXRemap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXRemap>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXRemap;

// Class InterchangeImport.MaterialExpressionMaterialXRotate2D
// 0x0058 (0x0108 - 0x00B0)
class UMaterialExpressionMaterialXRotate2D final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       RotationAngle;                                     // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstRotationAngle;                                // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXRotate2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXRotate2D")
	}
	static class UMaterialExpressionMaterialXRotate2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXRotate2D>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXRotate2D;

// Class InterchangeImport.MaterialExpressionMaterialXScreen
// 0x0080 (0x0130 - 0x00B0)
class UMaterialExpressionMaterialXScreen final : public UMaterialExpression
{
public:
	struct FExpressionInput                       A;                                                 // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Alpha;                                             // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstAlpha;                                        // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXScreen")
	}
	static class UMaterialExpressionMaterialXScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXScreen>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXScreen;

// Class InterchangeImport.MaterialExpressionMaterialXSplitLeftRight
// 0x00A8 (0x0158 - 0x00B0)
class UMaterialExpressionMaterialXSplitLeftRight final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       A;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Center;                                            // 0x0128(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstCenter;                                       // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x0154(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXSplitLeftRight")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXSplitLeftRight")
	}
	static class UMaterialExpressionMaterialXSplitLeftRight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXSplitLeftRight>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXSplitLeftRight;

// Class InterchangeImport.MaterialExpressionMaterialXSplitTopBottom
// 0x00A8 (0x0158 - 0x00B0)
class UMaterialExpressionMaterialXSplitTopBottom final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Coordinates;                                       // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       A;                                                 // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       B;                                                 // 0x0100(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	struct FExpressionInput                       Center;                                            // 0x0128(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConstCenter;                                       // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ConstCoordinate;                                   // 0x0154(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXSplitTopBottom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXSplitTopBottom")
	}
	static class UMaterialExpressionMaterialXSplitTopBottom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXSplitTopBottom>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXSplitTopBottom;

// Class InterchangeImport.MaterialExpressionMaterialXSwizzle
// 0x0038 (0x00E8 - 0x00B0)
class UMaterialExpressionMaterialXSwizzle final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Channels;                                          // 0x00D8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXSwizzle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXSwizzle")
	}
	static class UMaterialExpressionMaterialXSwizzle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXSwizzle>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXSwizzle;

// Class InterchangeImport.MaterialExpressionMaterialXTextureSampleParameterBlur
// 0x0010 (0x0230 - 0x0220)
class UMaterialExpressionMaterialXTextureSampleParameterBlur final : public UMaterialExpressionTextureSampleParameter2D
{
public:
	EMAterialXTextureSampleBlurKernel             KernelSize;                                        // 0x0220(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FilterSize;                                        // 0x0224(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FilterOffset;                                      // 0x0228(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMaterialXTextureSampleBlurFilter             Filter;                                            // 0x022C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXTextureSampleParameterBlur")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionMaterialXTextureSampleParameterBlur")
	}
	static class UMaterialExpressionMaterialXTextureSampleParameterBlur* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionMaterialXTextureSampleParameterBlur>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionMaterialXTextureSampleParameterBlur;

// Class InterchangeImport.MaterialExpressionMaterialXUnpremult
// 0x0028 (0x00D8 - 0x00B0)
class UMaterialExpressionMaterialXUnpremult final : public UMaterialExpression
{
public:
	struct FExpressionInput                       Input;                                             // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionMaterialXUnpremult")
	}
	static const class FName& StaticName()
	{
