#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interface_Train

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Interface_Train.Interface_Train_C.AttachCart
// 0x0010 (0x0010 - 0x0000)
struct Interface_Train_C_AttachCart final
{
public:
	class AStructure_TrainCart_Base_C*            CartToAttach;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Train_C_AttachCart;

// Function Interface_Train.Interface_Train_C.DetachCart
// 0x0008 (0x0008 - 0x0000)
struct Interface_Train_C_DetachCart final
{
public:
	class AStructure_TrainCart_Base_C*            CartToDetach;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Train_C_DetachCart;

// Function Interface_Train.Interface_Train_C.GetAttachedCarts
// 0x0010 (0x0010 - 0x0000)
struct Interface_Train_C_GetAttachedCarts final
{
public:
	TArray<class AActor*>                         AttachedCarts;                                     // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_Interface_Train_C_GetAttachedCarts;

// Function Interface_Train.Interface_Train_C.GetLocationAndRotationAtOffset
// 0x0070 (0x0070 - 0x0000)
struct Interface_Train_C_GetLocationAndRotationAtOffset final
{
public:
	double                                        Offset;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedTrackIdx;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentTrackIdx;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 StartTrack;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        StartDistance;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSelectedTrackIdx;                              // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutLocation;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OutRotatation;                                     // 0x0040(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                OutDirection;                                      // 0x0058(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Train_C_GetLocationAndRotationAtOffset;

// Function Interface_Train.Interface_Train_C.GetTrainPlacementTraceExtent
// 0x0030 (0x0030 - 0x0000)
struct Interface_Train_C_GetTrainPlacementTraceExtent final
{
public:
	struct FVector                                Extent;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Train_C_GetTrainPlacementTraceExtent;

// Function Interface_Train.Interface_Train_C.GoToCart
// 0x0010 (0x0010 - 0x0000)
struct Interface_Train_C_GoToCart final
{
public:
	int32                                         CartIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      ForPC;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Train_C_GoToCart;

// Function Interface_Train.Interface_Train_C.GoToEngine
// 0x0008 (0x0008 - 0x0000)
struct Interface_Train_C_GoToEngine final
{
public:
	class APlayerController*                      ForPC;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Train_C_GoToEngine;

// Function Interface_Train.Interface_Train_C.InitializeTrain
// 0x0008 (0x0008 - 0x0000)
struct Interface_Train_C_InitializeTrain final
{
public:
	class AActor*                                 Track;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Train_C_InitializeTrain;

}

