#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangeNodes

#include "Basic.hpp"

#include "InterchangeNodes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.AddCustomAnimationTrackUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetNode_AddCustomAnimationTrackUid final
{
public:
	class FString                                 AnimationTrackUid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetNode_AddCustomAnimationTrackUid;

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.RemoveCustomAnimationTrackUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetNode_RemoveCustomAnimationTrackUid final
{
public:
	class FString                                 AnimationTrackUid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetNode_RemoveCustomAnimationTrackUid;

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.SetCustomFrameRate
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetNode_SetCustomFrameRate final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetNode_SetCustomFrameRate;

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.GetCustomAnimationTrackUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUid final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutAnimationTrackUid;                              // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUid;

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.GetCustomAnimationTrackUidCount
// 0x0004 (0x0004 - 0x0000)
struct InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUidCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUidCount;

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.GetCustomAnimationTrackUids
// 0x0010 (0x0010 - 0x0000)
struct InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUids final
{
public:
	TArray<class FString>                         OutAnimationTrackUids;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetNode_GetCustomAnimationTrackUids;

// Function InterchangeNodes.InterchangeAnimationTrackSetNode.GetCustomFrameRate
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetNode_GetCustomFrameRate final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetNode_GetCustomFrameRate;

// Function InterchangeNodes.InterchangeAnimationTrackBaseNode.SetCustomCompletionMode
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackBaseNode_SetCustomCompletionMode final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackBaseNode_SetCustomCompletionMode;

// Function InterchangeNodes.InterchangeAnimationTrackBaseNode.GetCustomCompletionMode
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackBaseNode_GetCustomCompletionMode final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackBaseNode_GetCustomCompletionMode;

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.SetCustomDuration
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_SetCustomDuration final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetInstanceNode_SetCustomDuration;

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.SetCustomStartFrame
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_SetCustomStartFrame final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetInstanceNode_SetCustomStartFrame;

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.SetCustomTimeScale
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_SetCustomTimeScale final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetInstanceNode_SetCustomTimeScale;

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.SetCustomTrackSetDependencyUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_SetCustomTrackSetDependencyUid final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetInstanceNode_SetCustomTrackSetDependencyUid;

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.GetCustomDuration
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_GetCustomDuration final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetInstanceNode_GetCustomDuration;

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.GetCustomStartFrame
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_GetCustomStartFrame final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetInstanceNode_GetCustomStartFrame;

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.GetCustomTimeScale
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_GetCustomTimeScale final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetInstanceNode_GetCustomTimeScale;

// Function InterchangeNodes.InterchangeAnimationTrackSetInstanceNode.GetCustomTrackSetDependencyUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackSetInstanceNode_GetCustomTrackSetDependencyUid final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackSetInstanceNode_GetCustomTrackSetDependencyUid;

// Function InterchangeNodes.InterchangeAnimationTrackNode.SetCustomActorDependencyUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackNode_SetCustomActorDependencyUid final
{
public:
	class FString                                 DependencyUid;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackNode_SetCustomActorDependencyUid;

// Function InterchangeNodes.InterchangeAnimationTrackNode.SetCustomAnimationPayloadKey
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey final
{
public:
	class FString                                 InUniqueID;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeAnimationPayLoadType              InType;                                            // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackNode_SetCustomAnimationPayloadKey;

// Function InterchangeNodes.InterchangeAnimationTrackNode.SetCustomFrameCount
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackNode_SetCustomFrameCount final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackNode_SetCustomFrameCount;

// Function InterchangeNodes.InterchangeAnimationTrackNode.SetCustomPropertyTrack
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackNode_SetCustomPropertyTrack final
{
public:
	EInterchangePropertyTracks                    PropertyTrack;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackNode_SetCustomPropertyTrack;

// Function InterchangeNodes.InterchangeAnimationTrackNode.GetCustomActorDependencyUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeAnimationTrackNode_GetCustomActorDependencyUid final
{
public:
	class FString                                 DependencyUid;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackNode_GetCustomActorDependencyUid;

// Function InterchangeNodes.InterchangeAnimationTrackNode.GetCustomAnimationPayloadKey
// 0x0020 (0x0020 - 0x0000)
struct InterchangeAnimationTrackNode_GetCustomAnimationPayloadKey final
{
public:
	struct FInterchangeAnimationPayLoadKey        AnimationPayLoadKey;                               // 0x0000(0x0018)(Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackNode_GetCustomAnimationPayloadKey;

// Function InterchangeNodes.InterchangeAnimationTrackNode.GetCustomFrameCount
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackNode_GetCustomFrameCount final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackNode_GetCustomFrameCount;

// Function InterchangeNodes.InterchangeAnimationTrackNode.GetCustomPropertyTrack
// 0x0008 (0x0008 - 0x0000)
struct InterchangeAnimationTrackNode_GetCustomPropertyTrack final
{
public:
	EInterchangePropertyTracks                    PropertyTrack;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeAnimationTrackNode_GetCustomPropertyTrack;

// Function InterchangeNodes.InterchangeTransformAnimationTrackNode.SetCustomUsedChannels
// 0x0008 (0x0008 - 0x0000)
struct InterchangeTransformAnimationTrackNode_SetCustomUsedChannels final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeTransformAnimationTrackNode_SetCustomUsedChannels;

// Function InterchangeNodes.InterchangeTransformAnimationTrackNode.GetCustomUsedChannels
// 0x0008 (0x0008 - 0x0000)
struct InterchangeTransformAnimationTrackNode_GetCustomUsedChannels final
{
public:
	int32                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeTransformAnimationTrackNode_GetCustomUsedChannels;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetAnimationPayloadKeyForMorphTargetNodeUid
// 0x0028 (0x0028 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid final
{
public:
	class FString                                 MorphTargetNodeUid;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InUniqueID;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeAnimationPayLoadType              InType;                                            // 0x0020(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForMorphTargetNodeUid;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetAnimationPayloadKeyForSceneNodeUid
// 0x0028 (0x0028 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid final
{
public:
	class FString                                 SceneNodeUid;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InUniqueID;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInterchangeAnimationPayLoadType              InType;                                            // 0x0020(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_SetAnimationPayloadKeyForSceneNodeUid;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetCustomAnimationSampleRate
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetCustomAnimationSampleRate final
{
public:
	double                                        SampleRate;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_SetCustomAnimationSampleRate;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetCustomAnimationStartTime
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStartTime final
{
public:
	double                                        StartTime;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStartTime;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetCustomAnimationStopTime
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStopTime final
{
public:
	double                                        StopTime;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_SetCustomAnimationStopTime;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.SetCustomSkeletonNodeUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_SetCustomSkeletonNodeUid final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_SetCustomSkeletonNodeUid;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.GetCustomAnimationSampleRate
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_GetCustomAnimationSampleRate final
{
public:
	double                                        SampleRate;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_GetCustomAnimationSampleRate;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.GetCustomAnimationStartTime
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStartTime final
{
public:
	double                                        StartTime;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStartTime;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.GetCustomAnimationStopTime
// 0x0010 (0x0010 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStopTime final
{
public:
	double                                        StopTime;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_GetCustomAnimationStopTime;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.GetCustomSkeletonNodeUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_GetCustomSkeletonNodeUid final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_GetCustomSkeletonNodeUid;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.GetMorphTargetNodeAnimationPayloadKeys
// 0x00A0 (0x00A0 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_GetMorphTargetNodeAnimationPayloadKeys final
{
public:
	TMap<class FString, class FString>            OutMorphTargetNodeAnimationPayloadKeyUids;         // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class FString, uint8>                    OutMorphTargetNodeAnimationPayloadKeyTypes;        // 0x0050(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_GetMorphTargetNodeAnimationPayloadKeys;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.GetSceneNodeAnimationPayloadKeys
// 0x00A0 (0x00A0 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_GetSceneNodeAnimationPayloadKeys final
{
public:
	TMap<class FString, class FString>            OutSceneNodeAnimationPayloadKeyUids;               // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class FString, uint8>                    OutSceneNodeAnimationPayloadKeyTypes;              // 0x0050(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_GetSceneNodeAnimationPayloadKeys;

// Function InterchangeNodes.InterchangeSkeletalAnimationTrackNode.IsNodeAnimatedWithBakedCurve
// 0x0018 (0x0018 - 0x0000)
struct InterchangeSkeletalAnimationTrackNode_IsNodeAnimatedWithBakedCurve final
{
public:
	class FString                                 SceneNodeUid;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeSkeletalAnimationTrackNode_IsNodeAnimatedWithBakedCurve;

// Function InterchangeNodes.InterchangePhysicalCameraNode.SetCustomEnableDepthOfField
// 0x0002 (0x0002 - 0x0000)
struct InterchangePhysicalCameraNode_SetCustomEnableDepthOfField final
{
public:
	bool                                          AttributeValue;                                    // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePhysicalCameraNode_SetCustomEnableDepthOfField;

// Function InterchangeNodes.InterchangePhysicalCameraNode.SetCustomFocalLength
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraNode_SetCustomFocalLength final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePhysicalCameraNode_SetCustomFocalLength;

// Function InterchangeNodes.InterchangePhysicalCameraNode.SetCustomSensorHeight
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraNode_SetCustomSensorHeight final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePhysicalCameraNode_SetCustomSensorHeight;

// Function InterchangeNodes.InterchangePhysicalCameraNode.SetCustomSensorWidth
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraNode_SetCustomSensorWidth final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePhysicalCameraNode_SetCustomSensorWidth;

// Function InterchangeNodes.InterchangePhysicalCameraNode.GetCustomEnableDepthOfField
// 0x0002 (0x0002 - 0x0000)
struct InterchangePhysicalCameraNode_GetCustomEnableDepthOfField final
{
public:
	bool                                          AttributeValue;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePhysicalCameraNode_GetCustomEnableDepthOfField;

// Function InterchangeNodes.InterchangePhysicalCameraNode.GetCustomFocalLength
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraNode_GetCustomFocalLength final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePhysicalCameraNode_GetCustomFocalLength;

// Function InterchangeNodes.InterchangePhysicalCameraNode.GetCustomSensorHeight
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraNode_GetCustomSensorHeight final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePhysicalCameraNode_GetCustomSensorHeight;

// Function InterchangeNodes.InterchangePhysicalCameraNode.GetCustomSensorWidth
// 0x0008 (0x0008 - 0x0000)
struct InterchangePhysicalCameraNode_GetCustomSensorWidth final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePhysicalCameraNode_GetCustomSensorWidth;

// Function InterchangeNodes.InterchangeStandardCameraNode.SetCustomAspectRatio
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraNode_SetCustomAspectRatio final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_SetCustomAspectRatio;

// Function InterchangeNodes.InterchangeStandardCameraNode.SetCustomFarClipPlane
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraNode_SetCustomFarClipPlane final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_SetCustomFarClipPlane;

// Function InterchangeNodes.InterchangeStandardCameraNode.SetCustomFieldOfView
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraNode_SetCustomFieldOfView final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_SetCustomFieldOfView;

// Function InterchangeNodes.InterchangeStandardCameraNode.SetCustomNearClipPlane
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraNode_SetCustomNearClipPlane final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_SetCustomNearClipPlane;

// Function InterchangeNodes.InterchangeStandardCameraNode.SetCustomProjectionMode
// 0x0002 (0x0002 - 0x0000)
struct InterchangeStandardCameraNode_SetCustomProjectionMode final
{
public:
	EInterchangeCameraProjectionType              AttributeValue;                                    // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_SetCustomProjectionMode;

// Function InterchangeNodes.InterchangeStandardCameraNode.SetCustomWidth
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraNode_SetCustomWidth final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_SetCustomWidth;

// Function InterchangeNodes.InterchangeStandardCameraNode.GetCustomAspectRatio
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraNode_GetCustomAspectRatio final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_GetCustomAspectRatio;

// Function InterchangeNodes.InterchangeStandardCameraNode.GetCustomFarClipPlane
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraNode_GetCustomFarClipPlane final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_GetCustomFarClipPlane;

// Function InterchangeNodes.InterchangeStandardCameraNode.GetCustomFieldOfView
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraNode_GetCustomFieldOfView final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_GetCustomFieldOfView;

// Function InterchangeNodes.InterchangeStandardCameraNode.GetCustomNearClipPlane
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraNode_GetCustomNearClipPlane final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_GetCustomNearClipPlane;

// Function InterchangeNodes.InterchangeStandardCameraNode.GetCustomProjectionMode
// 0x0002 (0x0002 - 0x0000)
struct InterchangeStandardCameraNode_GetCustomProjectionMode final
{
public:
	EInterchangeCameraProjectionType              AttributeValue;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_GetCustomProjectionMode;

// Function InterchangeNodes.InterchangeStandardCameraNode.GetCustomWidth
// 0x0008 (0x0008 - 0x0000)
struct InterchangeStandardCameraNode_GetCustomWidth final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeStandardCameraNode_GetCustomWidth;

// Function InterchangeNodes.InterchangeShaderNode.AddFloatInput
// 0x0018 (0x0018 - 0x0000)
struct InterchangeShaderNode_AddFloatInput final
{
public:
	class FString                                 InputName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttributeValue;                                    // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAParameter;                                     // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeShaderNode_AddFloatInput;

// Function InterchangeNodes.InterchangeShaderNode.AddLinearColorInput
// 0x0028 (0x0028 - 0x0000)
struct InterchangeShaderNode_AddLinearColorInput final
{
public:
	class FString                                 InputName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AttributeValue;                                    // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAParameter;                                     // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeShaderNode_AddLinearColorInput;

// Function InterchangeNodes.InterchangeShaderNode.AddStringInput
// 0x0028 (0x0028 - 0x0000)
struct InterchangeShaderNode_AddStringInput final
{
public:
	class FString                                 InputName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AttributeValue;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAParameter;                                     // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeShaderNode_AddStringInput;

// Function InterchangeNodes.InterchangeShaderNode.SetCustomShaderType
// 0x0018 (0x0018 - 0x0000)
struct InterchangeShaderNode_SetCustomShaderType final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeShaderNode_SetCustomShaderType;

// Function InterchangeNodes.InterchangeShaderNode.GetCustomShaderType
// 0x0018 (0x0018 - 0x0000)
struct InterchangeShaderNode_GetCustomShaderType final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangeShaderNode_GetCustomShaderType;

// Function InterchangeNodes.InterchangeDecalNode.SetCustomDecalMaterialPathName
// 0x0018 (0x0018 - 0x0000)
struct InterchangeDecalNode_SetCustomDecalMaterialPathName final
{
public:
	class FString                                 AttributeValue;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
