#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangePipelines

#include "Basic.hpp"

#include "InterchangePipelines_structs.hpp"


namespace SDK::Params
{

// Function InterchangePipelines.InterchangeGenericMeshPipeline.SetCombineSkeletalMeshes
// 0x0001 (0x0001 - 0x0000)
struct InterchangeGenericMeshPipeline_SetCombineSkeletalMeshes final
{
public:
	bool                                          InbCombineSkeletalMeshes;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeGenericMeshPipeline_SetCombineSkeletalMeshes;

// Function InterchangePipelines.InterchangeGenericMeshPipeline.GetCombineSkeletalMeshes
// 0x0001 (0x0001 - 0x0000)
struct InterchangeGenericMeshPipeline_GetCombineSkeletalMeshes final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangeGenericMeshPipeline_GetCombineSkeletalMeshes;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.CreateInterchangePipelineMeshesUtilities
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineMeshesUtilities_CreateInterchangePipelineMeshesUtilities final
{
public:
	class UInterchangeBaseNodeContainer*          BaseNodeContainer;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInterchangePipelineMeshesUtilities*    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_CreateInterchangePipelineMeshesUtilities;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetAllMeshGeometry
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetAllMeshGeometry final
{
public:
	TArray<class FString>                         MeshGeometryUids;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetAllMeshGeometry;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetAllMeshGeometryNotInstanced
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetAllMeshGeometryNotInstanced final
{
public:
	TArray<class FString>                         MeshGeometryUids;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetAllMeshGeometryNotInstanced;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetAllMeshInstanceUids
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetAllMeshInstanceUids final
{
public:
	TArray<class FString>                         MeshInstanceUids;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetAllMeshInstanceUids;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetAllMeshInstanceUidsUsingMeshGeometryUid
// 0x0020 (0x0020 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetAllMeshInstanceUidsUsingMeshGeometryUid final
{
public:
	class FString                                 MeshGeometryUid;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         MeshInstanceUids;                                  // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetAllMeshInstanceUidsUsingMeshGeometryUid;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetAllSkinnedMeshGeometry
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetAllSkinnedMeshGeometry final
{
public:
	TArray<class FString>                         MeshGeometryUids;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetAllSkinnedMeshGeometry;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetAllSkinnedMeshInstance
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetAllSkinnedMeshInstance final
{
public:
	TArray<class FString>                         MeshInstanceUids;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetAllSkinnedMeshInstance;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetAllStaticMeshGeometry
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetAllStaticMeshGeometry final
{
public:
	TArray<class FString>                         MeshGeometryUids;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetAllStaticMeshGeometry;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetAllStaticMeshInstance
// 0x0010 (0x0010 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetAllStaticMeshInstance final
{
public:
	TArray<class FString>                         MeshInstanceUids;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetAllStaticMeshInstance;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetMeshGeometryByUid
// 0x0048 (0x0048 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetMeshGeometryByUid final
{
public:
	class FString                                 MeshGeometryUid;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeMeshGeometry               ReturnValue;                                       // 0x0010(0x0038)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetMeshGeometryByUid;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetMeshGeometrySkeletonRootUid
// 0x0020 (0x0020 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetMeshGeometrySkeletonRootUid final
{
public:
	class FString                                 MeshGeometryUid;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetMeshGeometrySkeletonRootUid;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetMeshInstanceByUid
// 0x0090 (0x0090 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetMeshInstanceByUid final
{
public:
	class FString                                 MeshInstanceUid;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterchangeMeshInstance               ReturnValue;                                       // 0x0010(0x0080)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetMeshInstanceByUid;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.GetMeshInstanceSkeletonRootUid
// 0x0020 (0x0020 - 0x0000)
struct InterchangePipelineMeshesUtilities_GetMeshInstanceSkeletonRootUid final
{
public:
	class FString                                 MeshInstanceUid;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_GetMeshInstanceSkeletonRootUid;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.IsValidMeshGeometryUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangePipelineMeshesUtilities_IsValidMeshGeometryUid final
{
public:
	class FString                                 MeshGeometryUid;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_IsValidMeshGeometryUid;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.IsValidMeshInstanceUid
// 0x0018 (0x0018 - 0x0000)
struct InterchangePipelineMeshesUtilities_IsValidMeshInstanceUid final
{
public:
	class FString                                 MeshInstanceUid;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_IsValidMeshInstanceUid;

// Function InterchangePipelines.InterchangePipelineMeshesUtilities.SetContext
// 0x0006 (0x0006 - 0x0000)
struct InterchangePipelineMeshesUtilities_SetContext final
{
public:
	struct FInterchangePipelineMeshesUtilitiesContext Context;                                       // 0x0000(0x0006)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InterchangePipelineMeshesUtilities_SetContext;

}

