#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterchangeMessages

#include "Basic.hpp"

#include "InterchangeCore_classes.hpp"


namespace SDK
{

// Class InterchangeMessages.InterchangeResultMeshWarning
// 0x0010 (0x0080 - 0x0070)
class UInterchangeResultMeshWarning : public UInterchangeResultWarning
{
public:
	class FString                                 MeshName;                                          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeResultMeshWarning")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeResultMeshWarning")
	}
	static class UInterchangeResultMeshWarning* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeResultMeshWarning>();
	}
};
DUMPER7_ASSERTS_UInterchangeResultMeshWarning;

// Class InterchangeMessages.InterchangeResultTextureDisplay
// 0x0010 (0x0090 - 0x0080)
class UInterchangeResultTextureDisplay : public UInterchangeResultDisplay_Generic
{
public:
	class FString                                 TextureName;                                       // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeResultTextureDisplay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeResultTextureDisplay")
	}
	static class UInterchangeResultTextureDisplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeResultTextureDisplay>();
	}
};
DUMPER7_ASSERTS_UInterchangeResultTextureDisplay;

// Class InterchangeMessages.InterchangeResultTextureWarning
// 0x0010 (0x0080 - 0x0070)
class UInterchangeResultTextureWarning final : public UInterchangeResultWarning
{
public:
	class FString                                 TextureName;                                       // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeResultTextureWarning")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeResultTextureWarning")
	}
	static class UInterchangeResultTextureWarning* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeResultTextureWarning>();
	}
};
DUMPER7_ASSERTS_UInterchangeResultTextureWarning;

// Class InterchangeMessages.InterchangeResultMeshError
// 0x0010 (0x0080 - 0x0070)
class UInterchangeResultMeshError : public UInterchangeResultError
{
public:
	class FString                                 MeshName;                                          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeResultMeshError")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeResultMeshError")
	}
	static class UInterchangeResultMeshError* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeResultMeshError>();
	}
};
DUMPER7_ASSERTS_UInterchangeResultMeshError;

// Class InterchangeMessages.InterchangeResultMeshWarning_Generic
// 0x0010 (0x0090 - 0x0080)
class UInterchangeResultMeshWarning_Generic final : public UInterchangeResultMeshWarning
{
public:
	class FText                                   Text;                                              // 0x0080(0x0010)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeResultMeshWarning_Generic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeResultMeshWarning_Generic")
	}
	static class UInterchangeResultMeshWarning_Generic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeResultMeshWarning_Generic>();
	}
};
DUMPER7_ASSERTS_UInterchangeResultMeshWarning_Generic;

// Class InterchangeMessages.InterchangeResultMeshError_Generic
// 0x0010 (0x0090 - 0x0080)
class UInterchangeResultMeshError_Generic final : public UInterchangeResultMeshError
{
public:
	class FText                                   Text;                                              // 0x0080(0x0010)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeResultMeshError_Generic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeResultMeshError_Generic")
	}
	static class UInterchangeResultMeshError_Generic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeResultMeshError_Generic>();
	}
};
DUMPER7_ASSERTS_UInterchangeResultMeshError_Generic;

// Class InterchangeMessages.InterchangeResultMeshWarning_TooManyUVs
// 0x0008 (0x0088 - 0x0080)
class UInterchangeResultMeshWarning_TooManyUVs final : public UInterchangeResultMeshWarning
{
public:
	int32                                         ExcessUVs;                                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeResultMeshWarning_TooManyUVs")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeResultMeshWarning_TooManyUVs")
	}
	static class UInterchangeResultMeshWarning_TooManyUVs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeResultMeshWarning_TooManyUVs>();
	}
};
DUMPER7_ASSERTS_UInterchangeResultMeshWarning_TooManyUVs;

// Class InterchangeMessages.InterchangeResultTextureDisplay_TextureFileDoNotExist
// 0x0010 (0x00A0 - 0x0090)
class UInterchangeResultTextureDisplay_TextureFileDoNotExist final : public UInterchangeResultTextureDisplay
{
public:
	class FString                                 MaterialName;                                      // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InterchangeResultTextureDisplay_TextureFileDoNotExist")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InterchangeResultTextureDisplay_TextureFileDoNotExist")
	}
	static class UInterchangeResultTextureDisplay_TextureFileDoNotExist* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterchangeResultTextureDisplay_TextureFileDoNotExist>();
	}
};
DUMPER7_ASSERTS_UInterchangeResultTextureDisplay_TextureFileDoNotExist;

}

