#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interface_Thrall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ShooterGame_structs.hpp"


namespace SDK::Params
{

// Function Interface_Thrall.Interface_Thrall_C.I_ExecuteTeleportToTarget
// 0x0030 (0x0030 - 0x0000)
struct Interface_Thrall_C_I_ExecuteTeleportToTarget final
{
public:
	struct FVector                                DestLocation;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DestRotation;                                      // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_ExecuteTeleportToTarget;

// Function Interface_Thrall.Interface_Thrall_C.I_FindIdealTeleportToTargetLocation
// 0x0038 (0x0038 - 0x0000)
struct Interface_Thrall_C_I_FindIdealTeleportToTargetLocation final
{
public:
	bool                                          Found;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DesiredLoc;                                        // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DesiredRot;                                        // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_FindIdealTeleportToTargetLocation;

// Function Interface_Thrall.Interface_Thrall_C.I_GetArmorRating
// 0x0008 (0x0008 - 0x0000)
struct Interface_Thrall_C_I_GetArmorRating final
{
public:
	double                                        Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_GetArmorRating;

// Function Interface_Thrall.Interface_Thrall_C.I_GetChanceToSpawnRidingDino
// 0x0008 (0x0008 - 0x0000)
struct Interface_Thrall_C_I_GetChanceToSpawnRidingDino final
{
public:
	double                                        Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_GetChanceToSpawnRidingDino;

// Function Interface_Thrall.Interface_Thrall_C.I_GetClosestThreateningPlayer
// 0x0008 (0x0008 - 0x0000)
struct Interface_Thrall_C_I_GetClosestThreateningPlayer final
{
public:
	class APrimalCharacter*                       Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_GetClosestThreateningPlayer;

// Function Interface_Thrall.Interface_Thrall_C.I_GetOverrideMoveToAttackRangeAcceptanceRadius
// 0x0010 (0x0010 - 0x0000)
struct Interface_Thrall_C_I_GetOverrideMoveToAttackRangeAcceptanceRadius final
{
public:
	bool                                          bDidOverride;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Value;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_GetOverrideMoveToAttackRangeAcceptanceRadius;

// Function Interface_Thrall.Interface_Thrall_C.I_GetPlayerShieldData
// 0x0010 (0x0010 - 0x0000)
struct Interface_Thrall_C_I_GetPlayerShieldData final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        durability;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_GetPlayerShieldData;

// Function Interface_Thrall.Interface_Thrall_C.I_GetPossessedExtraItem
// 0x0028 (0x0028 - 0x0000)
struct Interface_Thrall_C_I_GetPossessedExtraItem final
{
public:
	TSoftClassPtr<class UClass>                   Return;                                            // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_GetPossessedExtraItem;

// Function Interface_Thrall.Interface_Thrall_C.I_GetPossessedGloveFPVMeshes
// 0x00A0 (0x00A0 - 0x0000)
struct Interface_Thrall_C_I_GetPossessedGloveFPVMeshes final
{
public:
	TSoftObjectPtr<class USkeletalMesh>           MaleMesh;                                          // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           FemaleMesh;                                        // 0x0028(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              MaleMask;                                          // 0x0050(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              FemaleMask;                                        // 0x0078(0x0028)(Parm, OutParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_GetPossessedGloveFPVMeshes;

// Function Interface_Thrall.Interface_Thrall_C.I_GetResourceSearchRadius
// 0x0008 (0x0008 - 0x0000)
struct Interface_Thrall_C_I_GetResourceSearchRadius final
{
public:
	double                                        Return;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_GetResourceSearchRadius;

// Function Interface_Thrall.Interface_Thrall_C.I_GetSurroundingResources
// 0x0010 (0x0010 - 0x0000)
struct Interface_Thrall_C_I_GetSurroundingResources final
{
public:
	TArray<struct FOverlappedFoliageElement>      Return;                                            // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_GetSurroundingResources;

// Function Interface_Thrall.Interface_Thrall_C.I_GetUnboardLocation
// 0x0020 (0x0020 - 0x0000)
struct Interface_Thrall_C_I_GetUnboardLocation final
{
public:
	class APrimalDinoCharacter*                   FromDino;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Return;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_GetUnboardLocation;

// Function Interface_Thrall.Interface_Thrall_C.I_PlayVoiceLine
// 0x000C (0x000C - 0x0000)
struct Interface_Thrall_C_I_PlayVoiceLine final
{
public:
	class FName                                   VoicelineTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForce;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_PlayVoiceLine;

// Function Interface_Thrall.Interface_Thrall_C.I_SetAllowDeployRidingDinoOnMission
// 0x0001 (0x0001 - 0x0000)
struct Interface_Thrall_C_I_SetAllowDeployRidingDinoOnMission final
{
public:
	bool                                          bNewAllowDeploy;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_SetAllowDeployRidingDinoOnMission;

// Function Interface_Thrall.Interface_Thrall_C.I_SetChanceToSpawnRidingDino
// 0x0008 (0x0008 - 0x0000)
struct Interface_Thrall_C_I_SetChanceToSpawnRidingDino final
{
public:
	double                                        Chance;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_SetChanceToSpawnRidingDino;

// Function Interface_Thrall.Interface_Thrall_C.I_SetClosestThreateningPlayer
// 0x0008 (0x0008 - 0x0000)
struct Interface_Thrall_C_I_SetClosestThreateningPlayer final
{
public:
	class APrimalCharacter*                       NewThreateningPlayer;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_SetClosestThreateningPlayer;

// Function Interface_Thrall.Interface_Thrall_C.I_SetPreventTeleportAbility
// 0x0001 (0x0001 - 0x0000)
struct Interface_Thrall_C_I_SetPreventTeleportAbility final
{
public:
	bool                                          prevent;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_SetPreventTeleportAbility;

// Function Interface_Thrall.Interface_Thrall_C.I_SetSurroundingResources
// 0x0010 (0x0010 - 0x0000)
struct Interface_Thrall_C_I_SetSurroundingResources final
{
public:
	TArray<struct FOverlappedFoliageElement>      Elements;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_SetSurroundingResources;

// Function Interface_Thrall.Interface_Thrall_C.I_ShouldTeleportToTarget
// 0x0001 (0x0001 - 0x0000)
struct Interface_Thrall_C_I_ShouldTeleportToTarget final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_ShouldTeleportToTarget;

// Function Interface_Thrall.Interface_Thrall_C.I_SpawnDinoToRide
// 0x0008 (0x0008 - 0x0000)
struct Interface_Thrall_C_I_SpawnDinoToRide final
{
public:
	class APrimalDinoCharacter*                   SpawnedDino;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Interface_Thrall_C_I_SpawnDinoToRide;

}

