#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemFilterWIdgetPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function ItemFilterWIdgetPanel.ItemFilterWIdgetPanel_C.ExecuteUbergraph_ItemFilterWIdgetPanel
// 0x000C (0x000C - 0x0000)
struct ItemFilterWIdgetPanel_C_ExecuteUbergraph_ItemFilterWIdgetPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemFilterWIdgetPanel_C_ExecuteUbergraph_ItemFilterWIdgetPanel;

// Function ItemFilterWIdgetPanel.ItemFilterWIdgetPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ItemFilterWIdgetPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemFilterWIdgetPanel_C_PreConstruct;

}

