#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ListArkCharacterData

#include "Basic.hpp"

#include "ShooterGame_structs.hpp"


namespace SDK::Params
{

// Function ListArkCharacterData.ListArkCharacterData_C.ExecuteUbergraph_ListArkCharacterData
// 0x0018 (0x0018 - 0x0000)
struct ListArkCharacterData_C_ExecuteUbergraph_ListArkCharacterData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Success;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FArkTributePlayerDataListing>   K2Node_Event_CharactersListings;                   // 0x0008(0x0010)(ConstParm, ReferenceParm)
};
DUMPER7_ASSERTS_ListArkCharacterData_C_ExecuteUbergraph_ListArkCharacterData;

// Function ListArkCharacterData.ListArkCharacterData_C.OnUploadedCharactersListingsLoaded
// 0x0018 (0x0018 - 0x0000)
struct ListArkCharacterData_C_OnUploadedCharactersListingsLoaded final
{
public:
	bool                                          success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FArkTributePlayerDataListing>   CharactersListings;                                // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_ListArkCharacterData_C_OnUploadedCharactersListingsLoaded;

}

