#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Male_Hair_Mohawk_Mid_CtrlRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// RigVMMemoryStorageGeneratorClass Male_Hair_Mohawk_Mid_CtrlRig.RigVMMemory_Work
// 0x1DC8 (0x1DF0 - 0x0028)
class Male_Hair_Mohawk_Mid_CtrlRig::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_Items__IO;          // 0x0028(0x0010)(Edit, EditConst, NonTransactional)
	TArray<float>                                 RigVMModel___BoneArraySpringSolver_3_SpringStrength; // 0x0038(0x0010)(Edit, EditConst, NonTransactional)
	TArray<float>                                 RigVMModel___BoneArraySpringSolver_3_SpringDamping; // 0x0048(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_Transform; // 0x0060(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x00C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_CachedIndex; // 0x00D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                LocalVariable__BoneArraySpringSolver_BonePosition; // 0x00E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_3___BoneArraySpringSolver_IsNearlyZero_Result; // 0x00F8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_Element; // 0x0100(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0118(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_To_World_1_World; // 0x0120(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x0138(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x013C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_To_World_2_World; // 0x0140(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x0158(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Strength; // 0x0170(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Damping; // 0x0178(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Out; // 0x0180(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolver_0_Velocity; // 0x0198(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_7_Element; // 0x01B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Entry_Maximum_Length; // 0x01C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolver_0___SpringSolver_Return_Velocity;     // 0x01D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Entry_VelocityIn;    // 0x01E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_MathVectorClampLength_Result; // 0x0200(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_1_2_Result; // 0x0218(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_9_1_Result;      // 0x0230(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Scale_3_Result;      // 0x0248(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_1_Result; // 0x0260(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_Result;  // 0x0278(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Scale_Result;        // 0x0290(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_Result;     // 0x02A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Multiply_7_Result;   // 0x02C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Scale_Factor;        // 0x02C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Multiply_6_Result;   // 0x02D0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_GetDeltaTime_3_Result; // 0x02D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Multiply_6_A;        // 0x02E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Power_1_Result;      // 0x02E8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_Result;      // 0x02F0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Divide_2_Result;     // 0x02F8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Divide_2_A;          // 0x0300(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Scale_3_Factor;      // 0x0308(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_1_Result;   // 0x0310(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Divide_Result;       // 0x0328(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_RigVMFunction_GetDeltaTime_Result; // 0x032C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_3___BoneArraySpringSolver_IsNearlyZero_1_Result; // 0x0330(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_1_Element; // 0x0338(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_ToBoneSpace_RootSpaceResult; // 0x0350(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x0368(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ToBoneSpace___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x0370(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ToBoneSpace___ToBoneSpace_Inverse_Result;          // 0x0390(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace___ToBoneSpace_GetTransform_Transform;  // 0x03F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ToBoneSpace___ToBoneSpace_GetTransform_CachedIndex; // 0x0450(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_4_Element; // 0x0460(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_Strength; // 0x0478(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_Damping; // 0x0480(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_Out; // 0x0488(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_1_1_Result; // 0x04A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_ToBoneSpace_2_1_RootSpaceResult; // 0x04B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_1_Result; // 0x04D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_From_World_Global; // 0x04E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_Element; // 0x0500(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_5_Element; // 0x0518(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x0530(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ToBoneSpace_2_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x0538(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace_2_1___ToBoneSpace_Inverse_Result;      // 0x0550(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace_2_1___ToBoneSpace_GetTransform_Transform; // 0x05B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ToBoneSpace_2_1___ToBoneSpace_GetTransform_CachedIndex; // 0x0610(0x0010)(Edit, EditConst, NonTransactional)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_Result; // 0x0620(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_Divide_1_Result; // 0x0624(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_GetDeltaTime_1_Result; // 0x0628(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_8_Element; // 0x0630(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_SpringSolverGlobal_0_VelocityGlobal; // 0x0648(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Entry_Maximum_Length; // 0x0660(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664[0x4];                                      // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Entry_VelocityIn; // 0x0668(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Return_VelocityGlobal; // 0x0680(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_Result; // 0x0698(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_2_Result; // 0x06B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_9_1_Result; // 0x06C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Result; // 0x06E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_1_Result; // 0x06F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_Result; // 0x0710(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Multiply_Result; // 0x0728(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Scale_Result; // 0x0740(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_Result; // 0x0758(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_Result; // 0x0770(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Scale_Factor; // 0x0778(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_Result; // 0x0780(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_Result; // 0x0788(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78C[0x4];                                      // 0x078C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_A; // 0x0790(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Power_1_Result; // 0x0798(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_Result; // 0x07A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_Result; // 0x07A8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_A; // 0x07B0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Factor; // 0x07B8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_Result; // 0x07C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Divide_Result; // 0x07D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_RigVMFunction_GetDeltaTime_Result; // 0x07DC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_Transform; // 0x07E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_Parent; // 0x0840(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84C[0x4];                                      // 0x084C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_CachedChild; // 0x0850(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_CachedParent; // 0x0860(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_CachedIndex; // 0x0870(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_Result; // 0x0880(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_FromBoneSpace_1_BoneSpacePosition; // 0x0898(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FromBoneSpace_1___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x08B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B1[0x7];                                      // 0x08B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FromBoneSpace_1___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x08B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             FromBoneSpace_1___FromBoneSpace_GetTransform_Transform; // 0x08D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FromBoneSpace_1___FromBoneSpace_GetTransform_CachedIndex; // 0x0930(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_B; // 0x0940(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_Result; // 0x0958(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_ToBoneSpace_1_RootSpaceResult; // 0x0970(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_Add_Result; // 0x0988(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_Result; // 0x09A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_Unit_Result; // 0x09B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_2_Result; // 0x09D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_Clamp_Result; // 0x09D4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_Divide_Result; // 0x09D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_MathVectorLength_1_Result; // 0x09DC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_MathVectorLength_Result; // 0x09E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E4[0x4];                                      // 0x09E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_2_Result; // 0x09E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_1_Transform; // 0x0A00(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_1_CachedIndex; // 0x0A60(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_2_A; // 0x0A70(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A88[0x8];                                      // 0x0A88(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_Transform; // 0x0A90(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_1_Parent; // 0x0AF0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AFC[0x4];                                      // 0x0AFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_1_CachedChild; // 0x0B00(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_3___BoneArraySpringSolver_HierarchyGetParent_1_CachedParent; // 0x0B10(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_3___BoneArraySpringSolver_GetTransform_2_1_CachedIndex; // 0x0B20(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_2_B; // 0x0B30(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_Clamp_Minimum; // 0x0B48(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_Clamp_Maximum; // 0x0B4C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToBoneSpace_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x0B50(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B51[0x7];                                      // 0x0B51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ToBoneSpace_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x0B58(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace_1___ToBoneSpace_Inverse_Result;        // 0x0B70(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace_1___ToBoneSpace_GetTransform_Transform; // 0x0BD0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ToBoneSpace_1___ToBoneSpace_GetTransform_CachedIndex; // 0x0C30(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_From_World_2_2_Global; // 0x0C40(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_1_Element; // 0x0C58(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_1_Result; // 0x0C70(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_1_Result; // 0x0C90(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_1_Result; // 0x0CB0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  BoneArraySpringSolver_3___BoneArraySpringSolver_QuatBetweenDirections_0_Quat; // 0x0CD0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_Subtract_3_Result; // 0x0CF0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D08[0x8];                                      // 0x0D08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Result; // 0x0D10(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                QuatBetweenDirections_0___QuatBetweenDirections_Unit_2_Result; // 0x0D30(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                QuatBetweenDirections_0___QuatBetweenDirections_MathVectorCross_Result; // 0x0D48(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                QuatBetweenDirections_0___QuatBetweenDirections_Unit_1_Result; // 0x0D60(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                QuatBetweenDirections_0___QuatBetweenDirections_Unit_Result; // 0x0D78(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        QuatBetweenDirections_0___QuatBetweenDirections_Acos_Result; // 0x0D90(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         QuatBetweenDirections_0___QuatBetweenDirections_Dot___Result; // 0x0D98(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9C[0x4];                                      // 0x0D9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        QuatBetweenDirections_0___QuatBetweenDirections_Acos_Value; // 0x0DA0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         QuatBetweenDirections_0___QuatBetweenDirections_MathQuaternionFromAxisAndAngle_Angle; // 0x0DA8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_Scale_1_Factor; // 0x0DAC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  BoneArraySpringSolver_3___BoneArraySpringSolver_Multiply_1_B; // 0x0DB0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_3___BoneArraySpringSolver_FromBoneSpace_BoneSpacePosition; // 0x0DD0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FromBoneSpace___FromBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x0DE8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE9[0x7];                                      // 0x0DE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FromBoneSpace___FromBoneSpace_RigVMFunction_MathTransformTransformVector_Result; // 0x0DF0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E08[0x8];                                      // 0x0E08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             FromBoneSpace___FromBoneSpace_GetTransform_Transform; // 0x0E10(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FromBoneSpace___FromBoneSpace_GetTransform_CachedIndex; // 0x0E70(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_Value__IO; // 0x0E80(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_10_Element; // 0x0EE0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_Weight; // 0x0EE8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EEC[0x4];                                      // 0x0EEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_3___BoneArraySpringSolver_Set_Transform_1_CachedIndex; // 0x0EF0(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x0F00(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneArraySpringSolver_3___BoneArraySpringSolver_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0F08(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x0F10(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x0F14(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneArraySpringSolver_3___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x0F18(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_Transform; // 0x0F20(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x0F80(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F8C[0x4];                                      // 0x0F8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_CachedIndex; // 0x0F90(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                LocalVariable__BoneArraySpringSolver_BonePosition_0; // 0x0FA0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2___BoneArraySpringSolver_IsNearlyZero_Result; // 0x0FB8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB9[0x7];                                      // 0x0FB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_Element; // 0x0FC0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0FD8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FDC[0x4];                                      // 0x0FDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_To_World_1_World; // 0x0FE0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x0FF8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x0FFC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_To_World_2_World; // 0x1000(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x1018(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Strength; // 0x1030(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Damping; // 0x1038(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Out; // 0x1040(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolver_0_Velocity; // 0x1058(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_7_Element; // 0x1070(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Entry_Maximum_Length_0; // 0x1088(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108C[0x4];                                     // 0x108C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolver_0___SpringSolver_Return_Velocity_0;   // 0x1090(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Entry_VelocityIn_0;  // 0x10A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_MathVectorClampLength_Result_0; // 0x10C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_1_2_Result_0; // 0x10D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_9_1_Result_0;    // 0x10F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Scale_3_Result_0;    // 0x1108(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_1_Result_0; // 0x1120(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_Result_0; // 0x1138(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Scale_Result_0;      // 0x1150(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_Result_0;   // 0x1168(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Multiply_7_Result_0; // 0x1180(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Scale_Factor_0;      // 0x1188(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_118C[0x4];                                     // 0x118C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Multiply_6_Result_0; // 0x1190(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_GetDeltaTime_3_Result_0; // 0x1198(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119C[0x4];                                     // 0x119C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Multiply_6_A_0;      // 0x11A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Power_1_Result_0;    // 0x11A8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_Result_0;    // 0x11B0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Divide_2_Result_0;   // 0x11B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Divide_2_A_0;        // 0x11C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Scale_3_Factor_0;    // 0x11C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11CC[0x4];                                     // 0x11CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_1_Result_0; // 0x11D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Divide_Result_0;     // 0x11E8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_RigVMFunction_GetDeltaTime_Result_0; // 0x11EC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2___BoneArraySpringSolver_IsNearlyZero_1_Result; // 0x11F0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F1[0x7];                                     // 0x11F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_1_Element; // 0x11F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_ToBoneSpace_RootSpaceResult; // 0x1210(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToBoneSpace___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result_0; // 0x1228(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1229[0x7];                                     // 0x1229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ToBoneSpace___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result_0; // 0x1230(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1248[0x8];                                     // 0x1248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ToBoneSpace___ToBoneSpace_Inverse_Result_0;        // 0x1250(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace___ToBoneSpace_GetTransform_Transform_0; // 0x12B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ToBoneSpace___ToBoneSpace_GetTransform_CachedIndex_0; // 0x1310(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_4_Element; // 0x1320(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Strength; // 0x1338(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Damping; // 0x1340(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_Out; // 0x1348(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Scale_1_1_Result; // 0x1360(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_ToBoneSpace_2_1_RootSpaceResult; // 0x1378(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_Subtract_1_Result; // 0x1390(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_From_World_Global; // 0x13A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_Element; // 0x13C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_5_Element; // 0x13D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToBoneSpace_2_1___ToBoneSpace_DISPATCH_RigVMDispatch_CoreEquals_Result_0; // 0x13F0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13F1[0x7];                                     // 0x13F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ToBoneSpace_2_1___ToBoneSpace_RigVMFunction_MathTransformTransformVector_Result_0; // 0x13F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace_2_1___ToBoneSpace_Inverse_Result_0;    // 0x1410(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace_2_1___ToBoneSpace_GetTransform_Transform_0; // 0x1470(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ToBoneSpace_2_1___ToBoneSpace_GetTransform_CachedIndex_0; // 0x14D0(0x0010)(Edit, EditConst, NonTransactional)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_Result; // 0x14E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
