#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassLOD

#include "Basic.hpp"

#include "MassEntity_classes.hpp"
#include "MassLOD_structs.hpp"
#include "Engine_structs.hpp"
#include "MassSpawner_classes.hpp"


namespace SDK
{

// Class MassLOD.MassLODCollectorProcessor
// 0x0CA0 (0x0D50 - 0x00B0)
class UMassLODCollectorProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0xCA0];                                     // 0x00B0(0x0CA0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassLODCollectorProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassLODCollectorProcessor")
	}
	static class UMassLODCollectorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLODCollectorProcessor>();
	}
};
DUMPER7_ASSERTS_UMassLODCollectorProcessor;

// Class MassLOD.MassLODDistanceCollectorProcessor
// 0x0CA0 (0x0D50 - 0x00B0)
class UMassLODDistanceCollectorProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0xCA0];                                     // 0x00B0(0x0CA0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassLODDistanceCollectorProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassLODDistanceCollectorProcessor")
	}
	static class UMassLODDistanceCollectorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLODDistanceCollectorProcessor>();
	}
};
DUMPER7_ASSERTS_UMassLODDistanceCollectorProcessor;

// Class MassLOD.MassLODSubsystem
// 0x00C8 (0x0100 - 0x0038)
class UMassLODSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         bGatherPlayerControllers : 1;                      // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bGatherStreamingSources : 1;                       // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAllowNonPlayerViwerActors : 1;                    // 0x0038(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bUsePlayerPawnLocationInsteadOfCamera : 1;         // 0x0038(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FViewerInfo>                    Viewers;                                           // 0x0040(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<uint32, struct FMassViewerHandle>        ViewerMap;                                         // 0x0050(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         RegisteredActorViewers;                            // 0x00A0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_B0[0x50];                                      // 0x00B0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerControllerEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassLODSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassLODSubsystem")
	}
	static class UMassLODSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLODSubsystem>();
	}
};
DUMPER7_ASSERTS_UMassLODSubsystem;

// Class MassLOD.MassLODCollectorTrait
// 0x0000 (0x0028 - 0x0028)
class UMassLODCollectorTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassLODCollectorTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassLODCollectorTrait")
	}
	static class UMassLODCollectorTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLODCollectorTrait>();
	}
};
DUMPER7_ASSERTS_UMassLODCollectorTrait;

// Class MassLOD.MassDistanceLODCollectorTrait
// 0x0000 (0x0028 - 0x0028)
class UMassDistanceLODCollectorTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassDistanceLODCollectorTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassDistanceLODCollectorTrait")
	}
	static class UMassDistanceLODCollectorTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassDistanceLODCollectorTrait>();
	}
};
DUMPER7_ASSERTS_UMassDistanceLODCollectorTrait;

// Class MassLOD.MassSimulationLODTrait
// 0x0040 (0x0068 - 0x0028)
class UMassSimulationLODTrait final : public UMassEntityTraitBase
{
public:
	struct FMassSimulationLODParameters           Params_0;                                          // 0x0028(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bEnableVariableTicking;                            // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassSimulationVariableTickParameters  VariableTickParams;                                // 0x0054(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSimulationLODTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSimulationLODTrait")
	}
	static class UMassSimulationLODTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationLODTrait>();
	}
};
DUMPER7_ASSERTS_UMassSimulationLODTrait;

// Class MassLOD.MassSimulationLODProcessor
// 0x0FB0 (0x1060 - 0x00B0)
class UMassSimulationLODProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0xFA0];                                     // 0x00B0(0x0FA0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDoAdjustmentFromCount;                            // 0x1050(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1051[0xF];                                     // 0x1051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSimulationLODProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSimulationLODProcessor")
	}
	static class UMassSimulationLODProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationLODProcessor>();
	}
};
DUMPER7_ASSERTS_UMassSimulationLODProcessor;

}

