#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassRepresentation

#include "Basic.hpp"

#include "MassRepresentation_structs.hpp"
#include "MassEntity_classes.hpp"
#include "Engine_classes.hpp"
#include "MassSpawner_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MassRepresentation.MassDistanceLODProcessor
// 0x0970 (0x0A20 - 0x00B0)
class alignas(0x10) UMassDistanceLODProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0x968];                                     // 0x00B0(0x0968)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          FilterTag;                                         // 0x0A18(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassDistanceLODProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassDistanceLODProcessor")
	}
	static class UMassDistanceLODProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassDistanceLODProcessor>();
	}
};
DUMPER7_ASSERTS_UMassDistanceLODProcessor;

// Class MassRepresentation.MassDistanceVisualizationTrait
// 0x00F8 (0x0120 - 0x0028)
class UMassDistanceVisualizationTrait : public UMassEntityTraitBase
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStaticMeshInstanceVisualizationDesc   StaticMeshInstanceDesc;                            // 0x0030(0x0080)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     HighResTemplateActor;                              // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     LowResTemplateActor;                               // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMassRepresentationSubsystem> RepresentationSubsystemClass;                    // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassRepresentationParameters          Params_0;                                          // 0x00C8(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassDistanceLODParameters             LODParams;                                         // 0x00F0(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bAllowServerSideVisualization;                     // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0xF];                                      // 0x0111(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassDistanceVisualizationTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassDistanceVisualizationTrait")
	}
	static class UMassDistanceVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassDistanceVisualizationTrait>();
	}
};
DUMPER7_ASSERTS_UMassDistanceVisualizationTrait;

// Class MassRepresentation.MassVisualizationTrait
// 0x0118 (0x0140 - 0x0028)
class UMassVisualizationTrait : public UMassEntityTraitBase
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStaticMeshInstanceVisualizationDesc   StaticMeshInstanceDesc;                            // 0x0030(0x0080)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     HighResTemplateActor;                              // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     LowResTemplateActor;                               // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMassRepresentationSubsystem> RepresentationSubsystemClass;                    // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassRepresentationParameters          Params_0;                                          // 0x00C8(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassVisualizationLODParameters        LODParams;                                         // 0x00F0(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bAllowServerSideVisualization;                     // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassVisualizationTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassVisualizationTrait")
	}
	static class UMassVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassVisualizationTrait>();
	}
};
DUMPER7_ASSERTS_UMassVisualizationTrait;

// Class MassRepresentation.MassMovableVisualizationTrait
// 0x0000 (0x0140 - 0x0140)
class UMassMovableVisualizationTrait final : public UMassVisualizationTrait
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassMovableVisualizationTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassMovableVisualizationTrait")
	}
	static class UMassMovableVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassMovableVisualizationTrait>();
	}
};
DUMPER7_ASSERTS_UMassMovableVisualizationTrait;

// Class MassRepresentation.MassRepresentationActorManagement
// 0x0000 (0x0028 - 0x0028)
class UMassRepresentationActorManagement final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassRepresentationActorManagement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassRepresentationActorManagement")
	}
	static class UMassRepresentationActorManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassRepresentationActorManagement>();
	}
};
DUMPER7_ASSERTS_UMassRepresentationActorManagement;

// Class MassRepresentation.MassRepresentationProcessor
// 0x0330 (0x03E0 - 0x00B0)
class UMassRepresentationProcessor : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0x320];                                     // 0x00B0(0x0320)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassRepresentationUpdateParams        UpdateParams;                                      // 0x03D0(0x0001)(Edit, Config, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D1[0xF];                                      // 0x03D1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassRepresentationProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassRepresentationProcessor")
	}
	static class UMassRepresentationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassRepresentationProcessor>();
	}
};
DUMPER7_ASSERTS_UMassRepresentationProcessor;

// Class MassRepresentation.MassVisualizationProcessor
// 0x0000 (0x03E0 - 0x03E0)
class UMassVisualizationProcessor final : public UMassRepresentationProcessor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassVisualizationProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassVisualizationProcessor")
	}
	static class UMassVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassVisualizationProcessor>();
	}
};
DUMPER7_ASSERTS_UMassVisualizationProcessor;

// Class MassRepresentation.MassRepresentationFragmentDestructor
// 0x0328 (0x03F0 - 0x00C8)
class UMassRepresentationFragmentDestructor final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_C8[0x328];                                     // 0x00C8(0x0328)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassRepresentationFragmentDestructor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassRepresentationFragmentDestructor")
	}
	static class UMassRepresentationFragmentDestructor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassRepresentationFragmentDestructor>();
	}
};
DUMPER7_ASSERTS_UMassRepresentationFragmentDestructor;

// Class MassRepresentation.MassRepresentationSubsystem
// 0x00C0 (0x00F8 - 0x0038)
class UMassRepresentationSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0x38];                                      // 0x0038(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassVisualizationComponent*            VisualizationComponent;                            // 0x0070(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class AMassVisualizer*                        Visualizer;                                        // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UMassActorSpawnerSubsystem*             ActorSpawnerSubsystem;                             // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorldPartitionSubsystem*               WorldPartitionSubsystem;                           // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_A0[0x58];                                      // 0x00A0(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassRepresentationSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassRepresentationSubsystem")
	}
	static class UMassRepresentationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassRepresentationSubsystem>();
	}
};
DUMPER7_ASSERTS_UMassRepresentationSubsystem;

// Class MassRepresentation.MassStationaryDistanceVisualizationTrait
// 0x0000 (0x0120 - 0x0120)
class UMassStationaryDistanceVisualizationTrait final : public UMassDistanceVisualizationTrait
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassStationaryDistanceVisualizationTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassStationaryDistanceVisualizationTrait")
	}
	static class UMassStationaryDistanceVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStationaryDistanceVisualizationTrait>();
	}
};
DUMPER7_ASSERTS_UMassStationaryDistanceVisualizationTrait;

// Class MassRepresentation.MassStationaryISMRepresentationFragmentDestructor
// 0x0328 (0x03F0 - 0x00C8)
class UMassStationaryISMRepresentationFragmentDestructor final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_C8[0x328];                                     // 0x00C8(0x0328)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassStationaryISMRepresentationFragmentDestructor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassStationaryISMRepresentationFragmentDestructor")
	}
	static class UMassStationaryISMRepresentationFragmentDestructor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStationaryISMRepresentationFragmentDestructor>();
	}
};
DUMPER7_ASSERTS_UMassStationaryISMRepresentationFragmentDestructor;

// Class MassRepresentation.MassStationaryISMSwitcherProcessor
// 0x0320 (0x03D0 - 0x00B0)
class UMassStationaryISMSwitcherProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0x320];                                     // 0x00B0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassStationaryISMSwitcherProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassStationaryISMSwitcherProcessor")
	}
	static class UMassStationaryISMSwitcherProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStationaryISMSwitcherProcessor>();
	}
};
DUMPER7_ASSERTS_UMassStationaryISMSwitcherProcessor;

// Class MassRepresentation.MassStationaryVisualizationTrait
// 0x0000 (0x0140 - 0x0140)
class UMassStationaryVisualizationTrait final : public UMassVisualizationTrait
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassStationaryVisualizationTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassStationaryVisualizationTrait")
	}
	static class UMassStationaryVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStationaryVisualizationTrait>();
	}
};
DUMPER7_ASSERTS_UMassStationaryVisualizationTrait;

// Class MassRepresentation.MassUpdateISMProcessor
// 0x0320 (0x03D0 - 0x00B0)
class UMassUpdateISMProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0x320];                                     // 0x00B0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassUpdateISMProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassUpdateISMProcessor")
	}
	static class UMassUpdateISMProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassUpdateISMProcessor>();
	}
};
DUMPER7_ASSERTS_UMassUpdateISMProcessor;

// Class MassRepresentation.MassVisualizationComponent
// 0x0160 (0x0218 - 0x00B8)
class UMassVisualizationComponent final : public UActorComponent
{
public:
	TArray<struct FMassInstancedStaticMeshInfo>   InstancedStaticMeshInfos;                          // 0x00B8(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x150];                                     // 0x00C8(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassVisualizationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassVisualizationComponent")
	}
	static class UMassVisualizationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassVisualizationComponent>();
	}
};
DUMPER7_ASSERTS_UMassVisualizationComponent;

// Class MassRepresentation.MassVisualizationLODProcessor
// 0x0CA0 (0x0D50 - 0x00B0)
class alignas(0x10) UMassVisualizationLODProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0xC88];                                     // 0x00B0(0x0C88)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          FilterTag;                                         // 0x0D38(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	bool                                          bDoAdjustmentFromCount;                            // 0x0D40(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D41[0xF];                                      // 0x0D41(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassVisualizationLODProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassVisualizationLODProcessor")
	}
	static class UMassVisualizationLODProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassVisualizationLODProcessor>();
	}
};
DUMPER7_ASSERTS_UMassVisualizationLODProcessor;

// Class MassRepresentation.MassVisualizer
// 0x0008 (0x0488 - 0x0480)
class AMassVisualizer final : public AActor
{
public:
	class UMassVisualizationComponent*            VisComponent;                                      // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassVisualizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassVisualizer")
	}
	static class AMassVisualizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassVisualizer>();
	}
};
DUMPER7_ASSERTS_AMassVisualizer;

}

