#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassGameplayDebug

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MassEntity_structs.hpp"


namespace SDK
{

// Enum MassGameplayDebug.EMassEntityDebugShape
// NumValues: 0x0005
enum class EMassEntityDebugShape : uint8
{
	Box                                      = 0,
	Cone                                     = 1,
	Cylinder                                 = 2,
	Capsule                                  = 3,
	MAX                                      = 4,
};

// ScriptStruct MassGameplayDebug.SimDebugDataRow
// 0x0018 (0x0020 - 0x0008)
struct FSimDebugDataRow final : public FTableRowBase
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UMaterialInterface*                     MaterialOverride;                                  // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	float                                         Scale;                                             // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSimDebugDataRow;

// ScriptStruct MassGameplayDebug.SimDebugVisFragment
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FSimDebugVisFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSimDebugVisFragment;

// ScriptStruct MassGameplayDebug.DataFragment_DebugVis
// 0x0001 (0x0001 - 0x0000)
struct FDataFragment_DebugVis final : public FMassFragment
{
public:
	EMassEntityDebugShape                         Shape;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataFragment_DebugVis;

// ScriptStruct MassGameplayDebug.MassDebuggableTag
// 0x0000 (0x0001 - 0x0001)
struct FMassDebuggableTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassDebuggableTag;

// ScriptStruct MassGameplayDebug.AgentDebugVisualization
// 0x0020 (0x0028 - 0x0008)
struct FAgentDebugVisualization final : public FTableRowBase
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UMaterialInterface*                     MaterialOverride;                                  // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint32                                        VisualNearCullDistance;                            // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        VisualFarCullDistance;                             // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassEntityDebugShape                         WireShape;                                         // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAgentDebugVisualization;

}

