#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassReplication

#include "Basic.hpp"

#include "MassCommon_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "NetCore_structs.hpp"
#include "MassEntity_structs.hpp"
#include "MassSpawner_structs.hpp"


namespace SDK
{

// ScriptStruct MassReplication.MassReplicatedAgentHandle
// 0x0000 (0x0004 - 0x0004)
struct FMassReplicatedAgentHandle final : public FCompactIndexedHandleBase
{
};
DUMPER7_ASSERTS_FMassReplicatedAgentHandle;

// ScriptStruct MassReplication.MassFastArrayItemBase
// 0x0004 (0x0010 - 0x000C)
struct FMassFastArrayItemBase final : public FFastArraySerializerItem
{
public:
	struct FMassReplicatedAgentHandle             Handle;                                            // 0x000C(0x0004)(RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FMassFastArrayItemBase;

// ScriptStruct MassReplication.MassClientBubbleSerializerBase
// 0x0030 (0x0138 - 0x0108)
struct FMassClientBubbleSerializerBase final : public FFastArraySerializer
{
public:
	class UWorld*                                 World;                                             // 0x0108(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class UMassSpawnerSubsystem*                  SpawnerSubsystem;                                  // 0x0110(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassReplicationSubsystem*              ReplicationSubsystem;                              // 0x0128(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassClientBubbleSerializerBase;

// ScriptStruct MassReplication.MassNetworkIDFragment
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FMassNetworkIDFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassNetworkIDFragment;

// ScriptStruct MassReplication.MassReplicatedAgentFragment
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FMassReplicatedAgentFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassReplicatedAgentFragment;

// ScriptStruct MassReplication.MassReplicationViewerInfoFragment
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FMassReplicationViewerInfoFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassReplicationViewerInfoFragment;

// ScriptStruct MassReplication.MassReplicationLODFragment
// 0x0002 (0x0002 - 0x0000)
struct FMassReplicationLODFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x2];                                        // 0x0000(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassReplicationLODFragment;

// ScriptStruct MassReplication.MassReplicationParameters
// 0x0058 (0x0058 - 0x0000)
struct FMassReplicationParameters final : public FMassConstSharedFragment
{
public:
	float                                         LODDistance[0x4];                                  // 0x0000(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BufferHysteresisOnDistancePercentage;              // 0x0010(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODMaxCount[0x4];                                  // 0x0014(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODMaxCountPerViewer[0x4];                         // 0x0024(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpdateInterval[0x4];                               // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AMassClientBubbleInfoBase>  BubbleInfoClass;                                   // 0x0048(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMassReplicatorBase>        ReplicatorClass;                                   // 0x0050(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassReplicationParameters;

// ScriptStruct MassReplication.MassReplicationSharedFragment
// 0x23A0 (0x23A0 - 0x0000)
struct alignas(0x10) FMassReplicationSharedFragment final : public FMassSharedFragment
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AMassClientBubbleInfoBase*>      BubbleInfos;                                       // 0x0020(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_30[0x2360];                                    // 0x0030(0x2360)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassReplicatorBase*                    CachedReplicator;                                  // 0x2390(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_2398[0x8];                                     // 0x2398(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassReplicationSharedFragment;

// ScriptStruct MassReplication.MassReplicationGridCellLocationFragment
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FMassReplicationGridCellLocationFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassReplicationGridCellLocationFragment;

// ScriptStruct MassReplication.MassInReplicationGridTag
// 0x0000 (0x0001 - 0x0001)
struct FMassInReplicationGridTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassInReplicationGridTag;

// ScriptStruct MassReplication.MassClientBubbleInfoData
// 0x0018 (0x0018 - 0x0000)
struct FMassClientBubbleInfoData final
{
public:
	TArray<class AMassClientBubbleInfoBase*>      Bubbles;                                           // 0x0000(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TSubclassOf<class AMassClientBubbleInfoBase>  BubbleClass;                                       // 0x0010(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassClientBubbleInfoData;

// ScriptStruct MassReplication.ReplicatedAgentPositionYawData
// 0x0020 (0x0020 - 0x0000)
struct FReplicatedAgentPositionYawData final
{
public:
	struct FVector                                position;                                          // 0x0000(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Yaw;                                               // 0x0018(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FReplicatedAgentPositionYawData;

// ScriptStruct MassReplication.MassClientHandle
// 0x0000 (0x0008 - 0x0008)
struct FMassClientHandle final : public FIndexedHandleBase
{
};
DUMPER7_ASSERTS_FMassClientHandle;

// ScriptStruct MassReplication.MassBubbleInfoClassHandle
// 0x0000 (0x0004 - 0x0004)
struct FMassBubbleInfoClassHandle final : public FSimpleIndexedHandleBase
{
};
DUMPER7_ASSERTS_FMassBubbleInfoClassHandle;

// ScriptStruct MassReplication.ReplicatedAgentBase
// 0x0028 (0x0028 - 0x0000)
struct FReplicatedAgentBase final
{
public:
	struct FMassNetworkID                         NetID;                                             // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEntityTemplateID                  TemplateID;                                        // 0x0008(0x0020)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FReplicatedAgentBase;

}

