#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassReplication

#include "Basic.hpp"

#include "MassSpawner_classes.hpp"
#include "MassReplication_structs.hpp"
#include "Engine_classes.hpp"
#include "MassEntity_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MassReplication.MassClientBubbleInfoBase
// 0x0018 (0x0498 - 0x0480)
class AMassClientBubbleInfoBase final : public AInfo
{
public:
	uint8                                         Pad_480[0x18];                                     // 0x0480(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassClientBubbleInfoBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassClientBubbleInfoBase")
	}
	static class AMassClientBubbleInfoBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassClientBubbleInfoBase>();
	}
};
DUMPER7_ASSERTS_AMassClientBubbleInfoBase;

// Class MassReplication.MassNetworkIDFragmentInitializer
// 0x0328 (0x03F0 - 0x00C8)
class UMassNetworkIDFragmentInitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_C8[0x328];                                     // 0x00C8(0x0328)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassNetworkIDFragmentInitializer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassNetworkIDFragmentInitializer")
	}
	static class UMassNetworkIDFragmentInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassNetworkIDFragmentInitializer>();
	}
};
DUMPER7_ASSERTS_UMassNetworkIDFragmentInitializer;

// Class MassReplication.MassReplicationGridProcessor
// 0x0960 (0x0A10 - 0x00B0)
class UMassReplicationGridProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0x960];                                     // 0x00B0(0x0960)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassReplicationGridProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassReplicationGridProcessor")
	}
	static class UMassReplicationGridProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationGridProcessor>();
	}
};
DUMPER7_ASSERTS_UMassReplicationGridProcessor;

// Class MassReplication.MassReplicationGridRemoverProcessor
// 0x0328 (0x03F0 - 0x00C8)
class UMassReplicationGridRemoverProcessor final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_C8[0x328];                                     // 0x00C8(0x0328)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassReplicationGridRemoverProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassReplicationGridRemoverProcessor")
	}
	static class UMassReplicationGridRemoverProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationGridRemoverProcessor>();
	}
};
DUMPER7_ASSERTS_UMassReplicationGridRemoverProcessor;

// Class MassReplication.MassReplicationProcessor
// 0x0FB0 (0x1060 - 0x00B0)
class alignas(0x10) UMassReplicationProcessor final : public UMassProcessor
{
public:
	class UMassReplicationSubsystem*              ReplicationSubsystem;                              // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_B8[0xFA8];                                     // 0x00B8(0x0FA8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassReplicationProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassReplicationProcessor")
	}
	static class UMassReplicationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationProcessor>();
	}
};
DUMPER7_ASSERTS_UMassReplicationProcessor;

// Class MassReplication.MassReplicatorBase
// 0x0000 (0x0028 - 0x0028)
class UMassReplicatorBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassReplicatorBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassReplicatorBase")
	}
	static class UMassReplicatorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicatorBase>();
	}
};
DUMPER7_ASSERTS_UMassReplicatorBase;

// Class MassReplication.MassReplicationSettings
// 0x0008 (0x0030 - 0x0028)
class UMassReplicationSettings final : public UMassModuleSettings
{
public:
	float                                         ReplicationGridCellSize;                           // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassReplicationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassReplicationSettings")
	}
	static class UMassReplicationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationSettings>();
	}
};
DUMPER7_ASSERTS_UMassReplicationSettings;

// Class MassReplication.MassReplicationSubsystem
// 0x01B0 (0x01E8 - 0x0038)
class UMassReplicationSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassClientBubbleInfoData>      BubbleInfoArray;                                   // 0x0068(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x30];                                      // 0x0078(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 World;                                             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UMassLODSubsystem*                      MassLODSubsystem;                                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_B8[0x130];                                     // 0x00B8(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassReplicationSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassReplicationSubsystem")
	}
	static class UMassReplicationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationSubsystem>();
	}
};
DUMPER7_ASSERTS_UMassReplicationSubsystem;

// Class MassReplication.MassReplicationTrait
// 0x0058 (0x0080 - 0x0028)
class UMassReplicationTrait final : public UMassEntityTraitBase
{
public:
	struct FMassReplicationParameters             Params_0;                                          // 0x0028(0x0058)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassReplicationTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassReplicationTrait")
	}
	static class UMassReplicationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationTrait>();
	}
};
DUMPER7_ASSERTS_UMassReplicationTrait;

}

