#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassActors

#include "Basic.hpp"

#include "MassCommon_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MassEntity_classes.hpp"
#include "MassSpawner_structs.hpp"
#include "MassSpawner_classes.hpp"
#include "Engine_classes.hpp"
#include "MassActors_structs.hpp"


namespace SDK
{

// Class MassActors.MassAgentSyncTrait
// 0x0008 (0x0030 - 0x0028)
class UMassAgentSyncTrait : public UMassEntityTraitBase
{
public:
	EMassTranslationDirection                     SyncDirection;                                     // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassAgentSyncTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassAgentSyncTrait")
	}
	static class UMassAgentSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentSyncTrait>();
	}
};
DUMPER7_ASSERTS_UMassAgentSyncTrait;

// Class MassActors.MassAgentMovementSyncTrait
// 0x0000 (0x0030 - 0x0030)
class UMassAgentMovementSyncTrait final : public UMassAgentSyncTrait
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassAgentMovementSyncTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassAgentMovementSyncTrait")
	}
	static class UMassAgentMovementSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentMovementSyncTrait>();
	}
};
DUMPER7_ASSERTS_UMassAgentMovementSyncTrait;

// Class MassActors.MassActorPoolableInterface
// 0x0000 (0x0000 - 0x0000)
class IMassActorPoolableInterface final
{
public:
	bool CanBePooled();
	void PrepareForGame();
	void PrepareForPooling();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassActorPoolableInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassActorPoolableInterface")
	}
	static class IMassActorPoolableInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMassActorPoolableInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMassActorPoolableInterface;

// Class MassActors.MassAgentCapsuleCollisionSyncTrait
// 0x0008 (0x0038 - 0x0030)
class UMassAgentCapsuleCollisionSyncTrait final : public UMassAgentSyncTrait
{
public:
	bool                                          bSyncTransform;                                    // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassAgentCapsuleCollisionSyncTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassAgentCapsuleCollisionSyncTrait")
	}
	static class UMassAgentCapsuleCollisionSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentCapsuleCollisionSyncTrait>();
	}
};
DUMPER7_ASSERTS_UMassAgentCapsuleCollisionSyncTrait;

// Class MassActors.MassActorSpawnerSubsystem
// 0x00B8 (0x00F0 - 0x0038)
class UMassActorSpawnerSubsystem final : public UMassSubsystemBase
{
public:
	TArray<struct FInstancedStruct>               SpawnRequests;                                     // 0x0038(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         ActorsToDestroy;                                   // 0x0048(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class AActor*>                         DeactivatedActorsToDestroy;                        // 0x0058(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_68[0x88];                                      // 0x0068(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassActorSpawnerSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassActorSpawnerSubsystem")
	}
	static class UMassActorSpawnerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActorSpawnerSubsystem>();
	}
};
DUMPER7_ASSERTS_UMassActorSpawnerSubsystem;

// Class MassActors.MassActorSubsystem
// 0x0010 (0x0048 - 0x0038)
class UMassActorSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassActorSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassActorSubsystem")
	}
	static class UMassActorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActorSubsystem>();
	}
};
DUMPER7_ASSERTS_UMassActorSubsystem;

// Class MassActors.MassAgentComponent
// 0x0100 (0x01B8 - 0x00B8)
class UMassAgentComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0xA0];                                      // 0x00B8(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEntityConfig                      EntityConfig;                                      // 0x0158(0x0030)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_188[0x2C];                                     // 0x0188(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassNetworkID                         NetID;                                             // 0x01B4(0x0004)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Disable();
	void Enable();
	void KillEntity(const bool bDestroyActor);
	void OnRep_NetID();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassAgentComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassAgentComponent")
	}
	static class UMassAgentComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentComponent>();
	}
};
DUMPER7_ASSERTS_UMassAgentComponent;

// Class MassActors.MassAgentSubsystem
// 0x0148 (0x0180 - 0x0038)
class UMassAgentSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassSpawnerSubsystem*                  SpawnerSystem;                                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UMassSimulationSubsystem*               SimulationSystem;                                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TMap<struct FMassEntityTemplateID, struct FMassAgentInitializationQueue> PendingAgentEntities;   // 0x0058(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<struct FMassEntityTemplateID, struct FMassAgentInitializationQueue> PendingPuppets;         // 0x00A8(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UMassReplicationSubsystem*              ReplicationSubsystem;                              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TMap<struct FMassNetworkID, class UMassAgentComponent*> ReplicatedAgentComponents;               // 0x0100(0x0050)(ExportObject, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_150[0x30];                                     // 0x0150(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassAgentSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassAgentSubsystem")
	}
	static class UMassAgentSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentSubsystem>();
	}
};
DUMPER7_ASSERTS_UMassAgentSubsystem;

// Class MassActors.MassAgentOrientationSyncTrait
// 0x0000 (0x0030 - 0x0030)
class UMassAgentOrientationSyncTrait final : public UMassAgentSyncTrait
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassAgentOrientationSyncTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassAgentOrientationSyncTrait")
	}
	static class UMassAgentOrientationSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentOrientationSyncTrait>();
	}
};
DUMPER7_ASSERTS_UMassAgentOrientationSyncTrait;

// Class MassActors.MassAgentFeetLocationSyncTrait
// 0x0000 (0x0030 - 0x0030)
class UMassAgentFeetLocationSyncTrait final : public UMassAgentSyncTrait
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassAgentFeetLocationSyncTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassAgentFeetLocationSyncTrait")
	}
	static class UMassAgentFeetLocationSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentFeetLocationSyncTrait>();
	}
};
DUMPER7_ASSERTS_UMassAgentFeetLocationSyncTrait;

// Class MassActors.MassCapsuleTransformToMassTranslator
// 0x0320 (0x03F0 - 0x00D0)
class UMassCapsuleTransformToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassCapsuleTransformToMassTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassCapsuleTransformToMassTranslator")
	}
	static class UMassCapsuleTransformToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCapsuleTransformToMassTranslator>();
	}
};
DUMPER7_ASSERTS_UMassCapsuleTransformToMassTranslator;

// Class MassActors.MassTransformToActorCapsuleTranslator
// 0x0320 (0x03F0 - 0x00D0)
class UMassTransformToActorCapsuleTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassTransformToActorCapsuleTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassTransformToActorCapsuleTranslator")
	}
	static class UMassTransformToActorCapsuleTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTransformToActorCapsuleTranslator>();
	}
};
DUMPER7_ASSERTS_UMassTransformToActorCapsuleTranslator;

// Class MassActors.MassCharacterMovementToMassTranslator
// 0x0320 (0x03F0 - 0x00D0)
class UMassCharacterMovementToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassCharacterMovementToMassTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassCharacterMovementToMassTranslator")
	}
	static class UMassCharacterMovementToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterMovementToMassTranslator>();
	}
};
DUMPER7_ASSERTS_UMassCharacterMovementToMassTranslator;

// Class MassActors.MassCharacterMovementToActorTranslator
// 0x0320 (0x03F0 - 0x00D0)
class UMassCharacterMovementToActorTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassCharacterMovementToActorTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassCharacterMovementToActorTranslator")
	}
	static class UMassCharacterMovementToActorTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterMovementToActorTranslator>();
	}
};
DUMPER7_ASSERTS_UMassCharacterMovementToActorTranslator;

// Class MassActors.MassCharacterOrientationToMassTranslator
// 0x0320 (0x03F0 - 0x00D0)
class UMassCharacterOrientationToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassCharacterOrientationToMassTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassCharacterOrientationToMassTranslator")
	}
	static class UMassCharacterOrientationToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterOrientationToMassTranslator>();
	}
};
DUMPER7_ASSERTS_UMassCharacterOrientationToMassTranslator;

// Class MassActors.MassCharacterOrientationToActorTranslator
// 0x0320 (0x03F0 - 0x00D0)
class UMassCharacterOrientationToActorTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassCharacterOrientationToActorTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassCharacterOrientationToActorTranslator")
	}
	static class UMassCharacterOrientationToActorTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterOrientationToActorTranslator>();
	}
};
DUMPER7_ASSERTS_UMassCharacterOrientationToActorTranslator;

// Class MassActors.MassSceneComponentLocationToMassTranslator
// 0x0320 (0x03F0 - 0x00D0)
class UMassSceneComponentLocationToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSceneComponentLocationToMassTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSceneComponentLocationToMassTranslator")
	}
	static class UMassSceneComponentLocationToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSceneComponentLocationToMassTranslator>();
	}
};
DUMPER7_ASSERTS_UMassSceneComponentLocationToMassTranslator;

// Class MassActors.MassSceneComponentLocationToActorTranslator
// 0x0320 (0x03F0 - 0x00D0)
class UMassSceneComponentLocationToActorTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSceneComponentLocationToActorTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSceneComponentLocationToActorTranslator")
	}
	static class UMassSceneComponentLocationToActorTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSceneComponentLocationToActorTranslator>();
	}
};
DUMPER7_ASSERTS_UMassSceneComponentLocationToActorTranslator;

// Class MassActors.MassTranslator_BehaviorTree
// 0x0320 (0x03F0 - 0x00D0)
class UMassTranslator_BehaviorTree final : public UMassTranslator
{
public:
	uint8                                         Pad_D0[0x320];                                     // 0x00D0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassTranslator_BehaviorTree")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassTranslator_BehaviorTree")
	}
	static class UMassTranslator_BehaviorTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTranslator_BehaviorTree>();
	}
};
DUMPER7_ASSERTS_UMassTranslator_BehaviorTree;

}

