#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassMovement

#include "Basic.hpp"

#include "MassEntity_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct MassMovement.MassVelocityFragment
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FMassVelocityFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassVelocityFragment;

// ScriptStruct MassMovement.MassForceFragment
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FMassForceFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassForceFragment;

// ScriptStruct MassMovement.MassMovementStyleRef
// 0x0018 (0x0018 - 0x0000)
struct FMassMovementStyleRef final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0008(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassMovementStyleRef;

// ScriptStruct MassMovement.MassMovementStyleSpeedParameters
// 0x0010 (0x0010 - 0x0000)
struct FMassMovementStyleSpeedParameters final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Variance;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Probability;                                       // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassMovementStyleSpeedParameters;

// ScriptStruct MassMovement.MassMovementStyleParameters
// 0x0028 (0x0028 - 0x0000)
struct FMassMovementStyleParameters final
{
public:
	struct FMassMovementStyleRef                  Style;                                             // 0x0000(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FMassMovementStyleSpeedParameters> DesiredSpeeds;                                  // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassMovementStyleParameters;

// ScriptStruct MassMovement.MassMovementParameters
// 0x0028 (0x0028 - 0x0000)
struct FMassMovementParameters final : public FMassConstSharedFragment
{
public:
	float                                         MaxSpeed;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAcceleration;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultDesiredSpeed;                               // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultDesiredSpeedVariance;                       // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightSmoothingTime;                               // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassMovementStyleParameters>   MovementStyles;                                    // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassMovementParameters;

// ScriptStruct MassMovement.MassMovementStyle
// 0x0018 (0x0018 - 0x0000)
struct FMassMovementStyle final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0008(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassMovementStyle;

// ScriptStruct MassMovement.MassSimpleMovementTag
// 0x0000 (0x0001 - 0x0001)
struct FMassSimpleMovementTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassSimpleMovementTag;

}

