#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassCommon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MassEntity_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// ScriptStruct MassCommon.TransformFragment
// 0x0060 (0x0060 - 0x0000)
struct FTransformFragment final : public FMassFragment
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FTransformFragment;

// ScriptStruct MassCommon.AgentRadiusFragment
// 0x0004 (0x0004 - 0x0000)
struct FAgentRadiusFragment final : public FMassFragment
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAgentRadiusFragment;

// ScriptStruct MassCommon.ObjectWrapperFragment
// 0x0001 (0x0001 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FObjectWrapperFragment : public FMassFragment
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
#pragma pack(pop)
DUMPER7_ASSERTS_FObjectWrapperFragment;

// ScriptStruct MassCommon.MassNetworkID
// 0x0000 (0x0004 - 0x0004)
struct FMassNetworkID final : public FSequentialIDBase
{
};
DUMPER7_ASSERTS_FMassNetworkID;

// ScriptStruct MassCommon.MassInt16Real
// 0x0002 (0x0002 - 0x0000)
struct FMassInt16Real final
{
public:
	int16                                         Value;                                             // 0x0000(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FMassInt16Real;

// ScriptStruct MassCommon.MassInt16Real10
// 0x0002 (0x0002 - 0x0000)
struct FMassInt16Real10 final
{
public:
	int16                                         Value;                                             // 0x0000(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FMassInt16Real10;

// ScriptStruct MassCommon.MassSnorm8Vector
// 0x0003 (0x0003 - 0x0000)
struct FMassSnorm8Vector final
{
public:
	int8                                          X;                                                 // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int8                                          Y;                                                 // 0x0001(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int8                                          Z;                                                 // 0x0002(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FMassSnorm8Vector;

// ScriptStruct MassCommon.MassSnorm8Vector2D
// 0x0002 (0x0002 - 0x0000)
struct FMassSnorm8Vector2D final
{
public:
	int8                                          X;                                                 // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int8                                          Y;                                                 // 0x0001(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FMassSnorm8Vector2D;

// ScriptStruct MassCommon.MassUnorm8Real
// 0x0001 (0x0001 - 0x0000)
struct FMassUnorm8Real final
{
public:
	uint8                                         Value;                                             // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FMassUnorm8Real;

// ScriptStruct MassCommon.MassInt16Vector
// 0x0006 (0x0006 - 0x0000)
struct FMassInt16Vector final
{
public:
	int16                                         X;                                                 // 0x0000(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int16                                         Y;                                                 // 0x0002(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int16                                         Z;                                                 // 0x0004(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FMassInt16Vector;

// ScriptStruct MassCommon.MassInt16Vector2D
// 0x0004 (0x0004 - 0x0000)
struct FMassInt16Vector2D final
{
public:
	int16                                         X;                                                 // 0x0000(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int16                                         Y;                                                 // 0x0002(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FMassInt16Vector2D;

}

