#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassSmartObjects

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "MassEntity_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ZoneGraph_structs.hpp"


namespace SDK
{

// Enum MassSmartObjects.EMassSmartObjectInteractionStatus
// NumValues: 0x0006
enum class EMassSmartObjectInteractionStatus : uint8
{
	Unset                                    = 0,
	InProgress                               = 1,
	BehaviorCompleted                        = 2,
	TaskCompleted                            = 3,
	Aborted                                  = 4,
	EMassSmartObjectInteractionStatus_MAX    = 5,
};

// ScriptStruct MassSmartObjects.MassSmartObjectUserFragment
// 0x0050 (0x0050 - 0x0000)
struct FMassSmartObjectUserFragment final : public FMassFragment
{
public:
	struct FGameplayTagContainer                  UserTags;                                          // 0x0000(0x0020)(Transient, NativeAccessSpecifierPublic)
	struct FSmartObjectClaimHandle                InteractionHandle;                                 // 0x0020(0x0020)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	EMassSmartObjectInteractionStatus             InteractionStatus;                                 // 0x0040(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InteractionCooldownEndTime;                        // 0x0048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassSmartObjectUserFragment;

// ScriptStruct MassSmartObjects.MassSmartObjectTimedBehaviorFragment
// 0x0004 (0x0004 - 0x0000)
struct FMassSmartObjectTimedBehaviorFragment final : public FMassFragment
{
public:
	float                                         UseTime;                                           // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassSmartObjectTimedBehaviorFragment;

// ScriptStruct MassSmartObjects.MassInActiveSmartObjectsRangeTag
// 0x0000 (0x0001 - 0x0001)
struct FMassInActiveSmartObjectsRangeTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassInActiveSmartObjectsRangeTag;

// ScriptStruct MassSmartObjects.SmartObjectRegistrationFragment
// 0x0010 (0x0010 - 0x0000)
struct FSmartObjectRegistrationFragment final : public FMassFragment
{
public:
	TWeakObjectPtr<class USmartObjectDefinition>  Asset;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectHandle                     Handle;                                            // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectRegistrationFragment;

// ScriptStruct MassSmartObjects.SmartObjectCandidateSlot
// 0x0020 (0x0020 - 0x0000)
struct FSmartObjectCandidateSlot final
{
public:
	struct FSmartObjectRequestResult              Result;                                            // 0x0000(0x0018)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Cost;                                              // 0x0018(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectCandidateSlot;

// ScriptStruct MassSmartObjects.MassSmartObjectRequestID
// 0x0008 (0x0008 - 0x0000)
struct FMassSmartObjectRequestID final
{
public:
	struct FMassEntityHandle                      Entity;                                            // 0x0000(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMassSmartObjectRequestID;

// ScriptStruct MassSmartObjects.MassSmartObjectCandidateSlots
// 0x0088 (0x0088 - 0x0000)
struct alignas(0x08) FMassSmartObjectCandidateSlots final
{
public:
	uint8                                         Pad_0[0x80];                                       // 0x0000(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         NumSlots;                                          // 0x0080(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassSmartObjectCandidateSlots;

// ScriptStruct MassSmartObjects.MassSmartObjectRequestResultFragment
// 0x0090 (0x0090 - 0x0000)
struct FMassSmartObjectRequestResultFragment final : public FMassFragment
{
public:
	struct FMassSmartObjectCandidateSlots         Candidates;                                        // 0x0000(0x0088)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bProcessed;                                        // 0x0088(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassSmartObjectRequestResultFragment;

// ScriptStruct MassSmartObjects.MassSmartObjectWorldLocationRequestFragment
// 0x0088 (0x0088 - 0x0000)
struct FMassSmartObjectWorldLocationRequestFragment final : public FMassFragment
{
public:
	struct FVector                                SearchOrigin;                                      // 0x0000(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassEntityHandle                      RequestingEntity;                                  // 0x0018(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  UserTags;                                          // 0x0020(0x0020)(Transient, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      ActivityRequirements;                              // 0x0040(0x0048)(Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassSmartObjectWorldLocationRequestFragment;

// ScriptStruct MassSmartObjects.MassSmartObjectLaneLocationRequestFragment
// 0x0080 (0x0080 - 0x0000)
struct FMassSmartObjectLaneLocationRequestFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEntityHandle                      RequestingEntity;                                  // 0x0010(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  UserTags;                                          // 0x0018(0x0020)(Transient, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      ActivityRequirements;                              // 0x0038(0x0048)(Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassSmartObjectLaneLocationRequestFragment;

// ScriptStruct MassSmartObjects.MassSmartObjectCompletedRequestTag
// 0x0000 (0x0001 - 0x0001)
struct FMassSmartObjectCompletedRequestTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassSmartObjectCompletedRequestTag;

// ScriptStruct MassSmartObjects.SmartObjectMassEntityUserData
// 0x0008 (0x0008 - 0x0000)
struct FSmartObjectMassEntityUserData final
{
public:
	struct FMassEntityHandle                      UserEntity;                                        // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectMassEntityUserData;

// ScriptStruct MassSmartObjects.SmartObjectLaneLocation
// 0x0010 (0x0010 - 0x0000)
struct FSmartObjectLaneLocation final
{
public:
	struct FSmartObjectHandle                     ObjectHandle;                                      // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LaneIndex;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceAlongLane;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectLaneLocation;

// ScriptStruct MassSmartObjects.SmartObjectLaneLocationIndices
// 0x0010 (0x0010 - 0x0000)
struct FSmartObjectLaneLocationIndices final
{
public:
	TArray<int32>                                 SmartObjectLaneLocationIndices;                    // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectLaneLocationIndices;

// ScriptStruct MassSmartObjects.SmartObjectAnnotationData
// 0x00D0 (0x00D0 - 0x0000)
struct FSmartObjectAnnotationData final
{
public:
	struct FZoneGraphDataHandle                   DataHandle;                                        // 0x0000(0x0004)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AffectedLanes;                                     // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FSmartObjectLaneLocation>       SmartObjectLaneLocations;                          // 0x0018(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<struct FSmartObjectHandle, int32>        SmartObjectToLaneLocationIndexLookup;              // 0x0028(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<int32, struct FSmartObjectLaneLocationIndices> LaneToLaneLocationIndicesLookup;             // 0x0078(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectAnnotationData;

}

