#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassLOD

#include "Basic.hpp"

#include "MassEntity_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// Enum MassLOD.EMassLOD
// NumValues: 0x0005
enum class EMassLOD : uint8
{
	High                                     = 0,
	Medium                                   = 1,
	Low                                      = 2,
	Off                                      = 3,
	Max                                      = 4,
};

// Enum MassLOD.EMassVisibility
// NumValues: 0x0004
enum class EMassVisibility : uint8
{
	CanBeSeen                                = 0,
	CulledByFrustum                          = 1,
	CulledByDistance                         = 2,
	Max                                      = 3,
};

// ScriptStruct MassLOD.MassHighLODTag
// 0x0000 (0x0001 - 0x0001)
struct FMassHighLODTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassHighLODTag;

// ScriptStruct MassLOD.MassMediumLODTag
// 0x0000 (0x0001 - 0x0001)
struct FMassMediumLODTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassMediumLODTag;

// ScriptStruct MassLOD.MassLowLODTag
// 0x0000 (0x0001 - 0x0001)
struct FMassLowLODTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassLowLODTag;

// ScriptStruct MassLOD.MassOffLODTag
// 0x0000 (0x0001 - 0x0001)
struct FMassOffLODTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassOffLODTag;

// ScriptStruct MassLOD.MassViewerInfoFragment
// 0x0008 (0x0008 - 0x0000)
struct FMassViewerInfoFragment final : public FMassFragment
{
public:
	float                                         ClosestViewerDistanceSq;                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClosestDistanceToFrustum;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassViewerInfoFragment;

// ScriptStruct MassLOD.MassVariableTickChunkFragment
// 0x000C (0x000C - 0x0000)
struct FMassVariableTickChunkFragment : public FMassChunkFragment
{
public:
	bool                                          bShouldTickThisFrame;                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMassLOD                                      LOD;                                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeUntilNextTick;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         LastChunkSerialModificationNumber;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMassVariableTickChunkFragment;

// ScriptStruct MassLOD.MassCollectLODViewerInfoTag
// 0x0000 (0x0001 - 0x0001)
struct FMassCollectLODViewerInfoTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassCollectLODViewerInfoTag;

// ScriptStruct MassLOD.MassCollectDistanceLODViewerInfoTag
// 0x0000 (0x0001 - 0x0001)
struct FMassCollectDistanceLODViewerInfoTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassCollectDistanceLODViewerInfoTag;

// ScriptStruct MassLOD.MassVisibilityCanBeSeenTag
// 0x0000 (0x0001 - 0x0001)
struct FMassVisibilityCanBeSeenTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassVisibilityCanBeSeenTag;

// ScriptStruct MassLOD.MassVisibilityCulledByFrustumTag
// 0x0000 (0x0001 - 0x0001)
struct FMassVisibilityCulledByFrustumTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassVisibilityCulledByFrustumTag;

// ScriptStruct MassLOD.MassVisibilityCulledByDistanceTag
// 0x0000 (0x0001 - 0x0001)
struct FMassVisibilityCulledByDistanceTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMassVisibilityCulledByDistanceTag;

// ScriptStruct MassLOD.MassVisualizationChunkFragment
// 0x0008 (0x0008 - 0x0000)
struct FMassVisualizationChunkFragment final : public FMassChunkFragment
{
public:
	EMassVisibility                               Visibility;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bContainsNewlyVisibleEntity;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaTime;                                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FMassVisualizationChunkFragment;

// ScriptStruct MassLOD.MassViewerHandle
// 0x0000 (0x0008 - 0x0008)
struct FMassViewerHandle final : public FIndexedHandleBase
{
};
DUMPER7_ASSERTS_FMassViewerHandle;

// ScriptStruct MassLOD.ViewerInfo
// 0x0068 (0x0068 - 0x0000)
struct FViewerInfo final
{
public:
	class AActor*                                 ActorViewer;                                       // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_8[0x60];                                       // 0x0008(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FViewerInfo;

// ScriptStruct MassLOD.MassSimulationLODFragment
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FMassSimulationLODFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassSimulationLODFragment;

// ScriptStruct MassLOD.MassSimulationVariableTickFragment
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FMassSimulationVariableTickFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassSimulationVariableTickFragment;

// ScriptStruct MassLOD.MassSimulationVariableTickChunkFragment
// 0x0000 (0x000C - 0x000C)
struct FMassSimulationVariableTickChunkFragment final : public FMassVariableTickChunkFragment
{
};
DUMPER7_ASSERTS_FMassSimulationVariableTickChunkFragment;

// ScriptStruct MassLOD.MassSimulationLODParameters
// 0x0028 (0x0028 - 0x0000)
struct FMassSimulationLODParameters final : public FMassConstSharedFragment
{
public:
	float                                         LODDistance[0x4];                                  // 0x0000(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BufferHysteresisOnDistancePercentage;              // 0x0010(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODMaxCount[0x4];                                  // 0x0014(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetLODTags;                                       // 0x0024(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassSimulationLODParameters;

// ScriptStruct MassLOD.MassSimulationVariableTickParameters
// 0x0014 (0x0014 - 0x0000)
struct FMassSimulationVariableTickParameters final : public FMassConstSharedFragment
{
public:
	float                                         TickRates[0x4];                                    // 0x0000(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpreadFirstSimulationUpdate;                      // 0x0010(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassSimulationVariableTickParameters;

// ScriptStruct MassLOD.MassSimulationLODSharedFragment
// 0x2020 (0x2020 - 0x0000)
struct alignas(0x08) FMassSimulationLODSharedFragment final : public FMassSharedFragment
{
public:
	uint8                                         Pad_0[0x2020];                                     // 0x0000(0x2020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassSimulationLODSharedFragment;

// ScriptStruct MassLOD.MassSimulationVariableTickSharedFragment
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FMassSimulationVariableTickSharedFragment final : public FMassSharedFragment
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassSimulationVariableTickSharedFragment;

}

