#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassSpawner

#include "Basic.hpp"

#include "ZoneGraph_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MassSpawner_structs.hpp"
#include "Engine_classes.hpp"
#include "MassEntity_classes.hpp"


namespace SDK
{

// Class MassSpawner.MassEntityTraitBase
// 0x0000 (0x0028 - 0x0028)
class UMassEntityTraitBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEntityTraitBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEntityTraitBase")
	}
	static class UMassEntityTraitBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEntityTraitBase>();
	}
};
DUMPER7_ASSERTS_UMassEntityTraitBase;

// Class MassSpawner.MassAssortedFragmentsTrait
// 0x0020 (0x0048 - 0x0028)
class UMassAssortedFragmentsTrait final : public UMassEntityTraitBase
{
public:
	TArray<struct FInstancedStruct>               Fragments;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FInstancedStruct>               Tags;                                              // 0x0038(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassAssortedFragmentsTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassAssortedFragmentsTrait")
	}
	static class UMassAssortedFragmentsTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAssortedFragmentsTrait>();
	}
};
DUMPER7_ASSERTS_UMassAssortedFragmentsTrait;

// Class MassSpawner.MassEntityConfigAsset
// 0x0030 (0x0060 - 0x0030)
class UMassEntityConfigAsset final : public UDataAsset
{
public:
	struct FMassEntityConfig                      Config;                                            // 0x0030(0x0030)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEntityConfigAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEntityConfigAsset")
	}
	static class UMassEntityConfigAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEntityConfigAsset>();
	}
};
DUMPER7_ASSERTS_UMassEntityConfigAsset;

// Class MassSpawner.MassEntitySpawnDataGeneratorBase
// 0x0008 (0x0030 - 0x0028)
class UMassEntitySpawnDataGeneratorBase : public UObject
{
public:
	int32                                         RandomSelectionSeed;                               // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUseCustomSeed : 1;                                // 0x002C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEntitySpawnDataGeneratorBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEntitySpawnDataGeneratorBase")
	}
	static class UMassEntitySpawnDataGeneratorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEntitySpawnDataGeneratorBase>();
	}
};
DUMPER7_ASSERTS_UMassEntitySpawnDataGeneratorBase;

// Class MassSpawner.MassEntityEQSSpawnPointsGenerator
// 0x0048 (0x0078 - 0x0030)
class UMassEntityEQSSpawnPointsGenerator final : public UMassEntitySpawnDataGeneratorBase
{
public:
	struct FEQSParametrizedQueryExecutionRequest  EQSRequest;                                        // 0x0030(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEntityEQSSpawnPointsGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEntityEQSSpawnPointsGenerator")
	}
	static class UMassEntityEQSSpawnPointsGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEntityEQSSpawnPointsGenerator>();
	}
};
DUMPER7_ASSERTS_UMassEntityEQSSpawnPointsGenerator;

// Class MassSpawner.MassEntityZoneGraphSpawnPointsGenerator
// 0x0018 (0x0048 - 0x0030)
class UMassEntityZoneGraphSpawnPointsGenerator final : public UMassEntitySpawnDataGeneratorBase
{
public:
	struct FZoneGraphTagFilter                    TagFilter;                                         // 0x0030(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         MinGap;                                            // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxGap;                                            // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEntityZoneGraphSpawnPointsGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEntityZoneGraphSpawnPointsGenerator")
	}
	static class UMassEntityZoneGraphSpawnPointsGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEntityZoneGraphSpawnPointsGenerator>();
	}
};
DUMPER7_ASSERTS_UMassEntityZoneGraphSpawnPointsGenerator;

// Class MassSpawner.MassSpawner
// 0x00A8 (0x0528 - 0x0480)
class AMassSpawner final : public AActor
{
public:
	TMulticastInlineDelegate<void()>              OnSpawningFinishedEvent;                           // 0x0480(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnDespawningFinishedEvent;                         // 0x0490(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x04A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassSpawnedEntityType>         EntityTypes;                                       // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMassSpawnDataGenerator>        SpawnDataGenerators;                               // 0x04B8(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         bAutoSpawnOnBeginPlay : 1;                         // 0x04C8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideSchematics : 1;                           // 0x04C8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMassProcessor*>                 PostSpawnProcessors;                               // 0x04D0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	float                                         SpawningCountScale;                                // 0x04E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4E4[0x44];                                     // 0x04E4(0x0044)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearTemplates();
	void DoDespawning();
	void DoSpawning();
	void ScaleSpawningCount(float Scale);
	void UnloadConfig();

	int32 GetCount() const;
	float GetSpawningCountScale() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSpawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSpawner")
	}
	static class AMassSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassSpawner>();
	}
};
DUMPER7_ASSERTS_AMassSpawner;

// Class MassSpawner.MassSpawnerSubsystem
// 0x0088 (0x00C0 - 0x0038)
class UMassSpawnerSubsystem final : public UMassSubsystemBase
{
public:
	TArray<class UMassProcessor*>                 SpawnDataInitializers;                             // 0x0038(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_48[0x78];                                      // 0x0048(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSpawnerSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSpawnerSubsystem")
	}
	static class UMassSpawnerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSpawnerSubsystem>();
	}
};
DUMPER7_ASSERTS_UMassSpawnerSubsystem;

// Class MassSpawner.MassSpawnLocationProcessor
// 0x0330 (0x03E0 - 0x00B0)
class UMassSpawnLocationProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0x330];                                     // 0x00B0(0x0330)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSpawnLocationProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSpawnLocationProcessor")
	}
	static class UMassSpawnLocationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSpawnLocationProcessor>();
	}
};
DUMPER7_ASSERTS_UMassSpawnLocationProcessor;

// Class MassSpawner.MassTranslator
// 0x0020 (0x00D0 - 0x00B0)
class UMassTranslator : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0x20];                                      // 0x00B0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassTranslator")
	}
	static class UMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTranslator>();
	}
};
DUMPER7_ASSERTS_UMassTranslator;

}

