#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassGameplayDebug

#include "Basic.hpp"

#include "MassEntity_classes.hpp"
#include "MassSpawner_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MassGameplayDebug.AssignDebugVisProcessor
// 0x0328 (0x03F0 - 0x00C8)
class UAssignDebugVisProcessor final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_C8[0x328];                                     // 0x00C8(0x0328)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssignDebugVisProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssignDebugVisProcessor")
	}
	static class UAssignDebugVisProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssignDebugVisProcessor>();
	}
};
DUMPER7_ASSERTS_UAssignDebugVisProcessor;

// Class MassGameplayDebug.DebugVisLocationProcessor
// 0x0320 (0x03D0 - 0x00B0)
class UDebugVisLocationProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0x320];                                     // 0x00B0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DebugVisLocationProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DebugVisLocationProcessor")
	}
	static class UDebugVisLocationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugVisLocationProcessor>();
	}
};
DUMPER7_ASSERTS_UDebugVisLocationProcessor;

// Class MassGameplayDebug.MassProcessor_UpdateDebugVis
// 0x0320 (0x03D0 - 0x00B0)
class UMassProcessor_UpdateDebugVis final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0x320];                                     // 0x00B0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassProcessor_UpdateDebugVis")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassProcessor_UpdateDebugVis")
	}
	static class UMassProcessor_UpdateDebugVis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassProcessor_UpdateDebugVis>();
	}
};
DUMPER7_ASSERTS_UMassProcessor_UpdateDebugVis;

// Class MassGameplayDebug.MassDebuggerSubsystem
// 0x0098 (0x00D0 - 0x0038)
class UMassDebuggerSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0x80];                                      // 0x0038(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassDebugVisualizationComponent*       VisualizationComponent;                            // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class AMassDebugVisualizer*                   DebugVisualizer;                                   // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassDebuggerSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassDebuggerSubsystem")
	}
	static class UMassDebuggerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassDebuggerSubsystem>();
	}
};
DUMPER7_ASSERTS_UMassDebuggerSubsystem;

// Class MassGameplayDebug.MassDebugVisualizationComponent
// 0x0000 (0x00B8 - 0x00B8)
class UMassDebugVisualizationComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassDebugVisualizationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassDebugVisualizationComponent")
	}
	static class UMassDebugVisualizationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassDebugVisualizationComponent>();
	}
};
DUMPER7_ASSERTS_UMassDebugVisualizationComponent;

// Class MassGameplayDebug.MassDebugVisualizationTrait
// 0x0000 (0x0028 - 0x0028)
class UMassDebugVisualizationTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassDebugVisualizationTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassDebugVisualizationTrait")
	}
	static class UMassDebugVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassDebugVisualizationTrait>();
	}
};
DUMPER7_ASSERTS_UMassDebugVisualizationTrait;

// Class MassGameplayDebug.MassDebugVisualizer
// 0x0000 (0x0480 - 0x0480)
class AMassDebugVisualizer final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassDebugVisualizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassDebugVisualizer")
	}
	static class AMassDebugVisualizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassDebugVisualizer>();
	}
};
DUMPER7_ASSERTS_AMassDebugVisualizer;

}

