#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassSmartObjects

#include "Basic.hpp"

#include "SmartObjectsModule_classes.hpp"
#include "MassEntity_classes.hpp"
#include "MassSignals_classes.hpp"
#include "ZoneGraph_structs.hpp"
#include "MassSpawner_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "ZoneGraphAnnotations_classes.hpp"
#include "MassSmartObjects_structs.hpp"


namespace SDK
{

// Class MassSmartObjects.SmartObjectMassBehaviorDefinition
// 0x0008 (0x0030 - 0x0028)
class USmartObjectMassBehaviorDefinition final : public USmartObjectBehaviorDefinition
{
public:
	float                                         UseTime;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SmartObjectMassBehaviorDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SmartObjectMassBehaviorDefinition")
	}
	static class USmartObjectMassBehaviorDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectMassBehaviorDefinition>();
	}
};
DUMPER7_ASSERTS_USmartObjectMassBehaviorDefinition;

// Class MassSmartObjects.MassSmartObjectCandidatesFinderProcessor
// 0x0650 (0x0700 - 0x00B0)
class UMassSmartObjectCandidatesFinderProcessor final : public UMassProcessor
{
public:
	float                                         SearchExtents;                                     // 0x00B0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x64C];                                     // 0x00B4(0x064C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectCandidatesFinderProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectCandidatesFinderProcessor")
	}
	static class UMassSmartObjectCandidatesFinderProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectCandidatesFinderProcessor>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectCandidatesFinderProcessor;

// Class MassSmartObjects.MassSmartObjectTimedBehaviorProcessor
// 0x0320 (0x03D0 - 0x00B0)
class UMassSmartObjectTimedBehaviorProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_B0[0x320];                                     // 0x00B0(0x0320)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectTimedBehaviorProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectTimedBehaviorProcessor")
	}
	static class UMassSmartObjectTimedBehaviorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectTimedBehaviorProcessor>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectTimedBehaviorProcessor;

// Class MassSmartObjects.MassSmartObjectUserFragmentDeinitializer
// 0x0328 (0x03F0 - 0x00C8)
class UMassSmartObjectUserFragmentDeinitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_C8[0x328];                                     // 0x00C8(0x0328)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectUserFragmentDeinitializer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectUserFragmentDeinitializer")
	}
	static class UMassSmartObjectUserFragmentDeinitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectUserFragmentDeinitializer>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectUserFragmentDeinitializer;

// Class MassSmartObjects.MassSmartObjectInitializerBase
// 0x0338 (0x0400 - 0x00C8)
class UMassSmartObjectInitializerBase : public UMassObserverProcessor
{
public:
	uint8                                         Pad_C8[0x338];                                     // 0x00C8(0x0338)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectInitializerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectInitializerBase")
	}
	static class UMassSmartObjectInitializerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectInitializerBase>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectInitializerBase;

// Class MassSmartObjects.MassSmartObjectDeinitializerBase
// 0x0338 (0x0400 - 0x00C8)
class UMassSmartObjectDeinitializerBase : public UMassObserverProcessor
{
public:
	uint8                                         Pad_C8[0x338];                                     // 0x00C8(0x0338)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectDeinitializerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectDeinitializerBase")
	}
	static class UMassSmartObjectDeinitializerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectDeinitializerBase>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectDeinitializerBase;

// Class MassSmartObjects.MassActiveSmartObjectInitializer
// 0x0000 (0x0400 - 0x0400)
class UMassActiveSmartObjectInitializer final : public UMassSmartObjectInitializerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassActiveSmartObjectInitializer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassActiveSmartObjectInitializer")
	}
	static class UMassActiveSmartObjectInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActiveSmartObjectInitializer>();
	}
};
DUMPER7_ASSERTS_UMassActiveSmartObjectInitializer;

// Class MassSmartObjects.MassActiveSmartObjectDeinitializer
// 0x0000 (0x0400 - 0x0400)
class UMassActiveSmartObjectDeinitializer final : public UMassSmartObjectDeinitializerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassActiveSmartObjectDeinitializer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassActiveSmartObjectDeinitializer")
	}
	static class UMassActiveSmartObjectDeinitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActiveSmartObjectDeinitializer>();
	}
};
DUMPER7_ASSERTS_UMassActiveSmartObjectDeinitializer;

// Class MassSmartObjects.MassActorInstanceHandleInitializer
// 0x0000 (0x0400 - 0x0400)
class UMassActorInstanceHandleInitializer final : public UMassSmartObjectInitializerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassActorInstanceHandleInitializer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassActorInstanceHandleInitializer")
	}
	static class UMassActorInstanceHandleInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActorInstanceHandleInitializer>();
	}
};
DUMPER7_ASSERTS_UMassActorInstanceHandleInitializer;

// Class MassSmartObjects.MassActorInstanceHandleDeinitializer
// 0x0000 (0x0400 - 0x0400)
class UMassActorInstanceHandleDeinitializer final : public UMassSmartObjectDeinitializerBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassActorInstanceHandleDeinitializer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassActorInstanceHandleDeinitializer")
	}
	static class UMassActorInstanceHandleDeinitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActorInstanceHandleDeinitializer>();
	}
};
DUMPER7_ASSERTS_UMassActorInstanceHandleDeinitializer;

// Class MassSmartObjects.MassActiveSmartObjectSignalProcessor
// 0x0640 (0x0AD0 - 0x0490)
class UMassActiveSmartObjectSignalProcessor final : public UMassSignalProcessorBase
{
public:
	uint8                                         Pad_490[0x640];                                    // 0x0490(0x0640)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassActiveSmartObjectSignalProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassActiveSmartObjectSignalProcessor")
	}
	static class UMassActiveSmartObjectSignalProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActiveSmartObjectSignalProcessor>();
	}
};
DUMPER7_ASSERTS_UMassActiveSmartObjectSignalProcessor;

// Class MassSmartObjects.MassSmartObjectSettings
// 0x0008 (0x0030 - 0x0028)
class UMassSmartObjectSettings final : public UMassModuleSettings
{
public:
	struct FZoneGraphTag                          SmartObjectTag;                                    // 0x0028(0x0001)(Edit, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SearchExtents;                                     // 0x002C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectSettings")
	}
	static class UMassSmartObjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectSettings>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectSettings;

// Class MassSmartObjects.MassSmartObjectUserTrait
// 0x0020 (0x0048 - 0x0028)
class UMassSmartObjectUserTrait final : public UMassEntityTraitBase
{
public:
	struct FGameplayTagContainer                  UserTags;                                          // 0x0028(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassSmartObjectUserTrait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassSmartObjectUserTrait")
	}
	static class UMassSmartObjectUserTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectUserTrait>();
	}
};
DUMPER7_ASSERTS_UMassSmartObjectUserTrait;

// Class MassSmartObjects.SmartObjectZoneAnnotations
// 0x0030 (0x06A0 - 0x0670)
class USmartObjectZoneAnnotations final : public UZoneGraphAnnotationComponent
{
public:
	struct FZoneGraphTagFilter                    AffectedLaneTags;                                  // 0x0668(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSmartObjectAnnotationData>     SmartObjectAnnotationDataArray;                    // 0x0678(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphTag                          BehaviorTag;                                       // 0x0688(0x0001)(Edit, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectSubsystem*                  SmartObjectSubsystem;                              // 0x0690(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SmartObjectZoneAnnotations")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SmartObjectZoneAnnotations")
	}
	static class USmartObjectZoneAnnotations* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectZoneAnnotations>();
	}
};
DUMPER7_ASSERTS_USmartObjectZoneAnnotations;

}

