#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingToolsExp

#include "Basic.hpp"


namespace SDK::Params
{

// Function MeshModelingToolsExp.BakeInputMeshProperties.GetSourceUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeInputMeshProperties_GetSourceUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeInputMeshProperties_GetSourceUVLayerNamesFunc;

// Function MeshModelingToolsExp.BakeInputMeshProperties.GetTargetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeInputMeshProperties_GetTargetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeInputMeshProperties_GetTargetUVLayerNamesFunc;

// Function MeshModelingToolsExp.BakeTexture2DProperties.GetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeTexture2DProperties_GetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeTexture2DProperties_GetUVLayerNamesFunc;

// Function MeshModelingToolsExp.BakeMultiTexture2DProperties.GetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMultiTexture2DProperties_GetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeMultiTexture2DProperties_GetUVLayerNamesFunc;

// Function MeshModelingToolsExp.MeshConstraintProperties.IsPreventNormalFlipsEnabled
// 0x0001 (0x0001 - 0x0000)
struct MeshConstraintProperties_IsPreventNormalFlipsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MeshConstraintProperties_IsPreventNormalFlipsEnabled;

// Function MeshModelingToolsExp.MeshConstraintProperties.IsPreventTinyTrianglesEnabled
// 0x0001 (0x0001 - 0x0000)
struct MeshConstraintProperties_IsPreventTinyTrianglesEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MeshConstraintProperties_IsPreventTinyTrianglesEnabled;

// Function MeshModelingToolsExp.BakeMeshAttributeMapsToolProperties.GetMapPreviewNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc;

// Function MeshModelingToolsExp.BakeMultiMeshAttributeMapsToolProperties.GetMapPreviewNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc;

// Function MeshModelingToolsExp.BakeMultiMeshInputToolProperties.GetTargetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc;

// Function MeshModelingToolsExp.ConvertToPolygonsToolProperties.GetGroupOptionsList
// 0x0010 (0x0010 - 0x0000)
struct ConvertToPolygonsToolProperties_GetGroupOptionsList final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConvertToPolygonsToolProperties_GetGroupOptionsList;

// Function MeshModelingToolsExp.DisplaceMeshCommonProperties.GetWeightMapsFunc
// 0x0010 (0x0010 - 0x0000)
struct DisplaceMeshCommonProperties_GetWeightMapsFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DisplaceMeshCommonProperties_GetWeightMapsFunc;

// Function MeshModelingToolsExp.SelectiveTessellationProperties.GetMaterialIDsFunc
// 0x0010 (0x0010 - 0x0000)
struct SelectiveTessellationProperties_GetMaterialIDsFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SelectiveTessellationProperties_GetMaterialIDsFunc;

// Function MeshModelingToolsExp.MeshAttributePaintToolProperties.GetAttributeNames
// 0x0010 (0x0010 - 0x0000)
struct MeshAttributePaintToolProperties_GetAttributeNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MeshAttributePaintToolProperties_GetAttributeNames;

// Function MeshModelingToolsExp.MeshInspectorMaterialProperties.GetUVChannelNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct MeshInspectorMaterialProperties_GetUVChannelNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MeshInspectorMaterialProperties_GetUVChannelNamesFunc;

// Function MeshModelingToolsExp.MeshVertexPaintToolUtilityActions.GetWeightMapsFunc
// 0x0010 (0x0010 - 0x0000)
struct MeshVertexPaintToolUtilityActions_GetWeightMapsFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MeshVertexPaintToolUtilityActions_GetWeightMapsFunc;

// Function MeshModelingToolsExp.MeshVertexPaintToolUtilityActions.GetLODNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct MeshVertexPaintToolUtilityActions_GetLODNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MeshVertexPaintToolUtilityActions_GetLODNamesFunc;

// Function MeshModelingToolsExp.TransferMeshToolProperties.GetSourceLODNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct TransferMeshToolProperties_GetSourceLODNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TransferMeshToolProperties_GetSourceLODNamesFunc;

// Function MeshModelingToolsExp.TransferMeshToolProperties.GetTargetLODNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct TransferMeshToolProperties_GetTargetLODNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TransferMeshToolProperties_GetTargetLODNamesFunc;

}

