#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetasoundEngine

#include "Basic.hpp"

#include "MetasoundFrontend_structs.hpp"
#include "MetasoundEngine_structs.hpp"
#include "AudioExtensions_structs.hpp"


namespace SDK::Params
{

// Function MetasoundEngine.MetasoundFrontendLiteralBlueprintAccess.CreateBoolArrayMetaSoundLiteral
// 0x0068 (0x0068 - 0x0000)
struct MetasoundFrontendLiteralBlueprintAccess_CreateBoolArrayMetaSoundLiteral final
{
public:
	TArray<bool>                                  Value;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              ReturnValue;                                       // 0x0010(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundFrontendLiteralBlueprintAccess_CreateBoolArrayMetaSoundLiteral;

// Function MetasoundEngine.MetasoundFrontendLiteralBlueprintAccess.CreateBoolMetaSoundLiteral
// 0x0060 (0x0060 - 0x0000)
struct MetasoundFrontendLiteralBlueprintAccess_CreateBoolMetaSoundLiteral final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetasoundFrontendLiteral              ReturnValue;                                       // 0x0008(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundFrontendLiteralBlueprintAccess_CreateBoolMetaSoundLiteral;

// Function MetasoundEngine.MetasoundFrontendLiteralBlueprintAccess.CreateFloatArrayMetaSoundLiteral
// 0x0068 (0x0068 - 0x0000)
struct MetasoundFrontendLiteralBlueprintAccess_CreateFloatArrayMetaSoundLiteral final
{
public:
	TArray<float>                                 Value;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              ReturnValue;                                       // 0x0010(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundFrontendLiteralBlueprintAccess_CreateFloatArrayMetaSoundLiteral;

// Function MetasoundEngine.MetasoundFrontendLiteralBlueprintAccess.CreateFloatMetaSoundLiteral
// 0x0060 (0x0060 - 0x0000)
struct MetasoundFrontendLiteralBlueprintAccess_CreateFloatMetaSoundLiteral final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetasoundFrontendLiteral              ReturnValue;                                       // 0x0008(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundFrontendLiteralBlueprintAccess_CreateFloatMetaSoundLiteral;

// Function MetasoundEngine.MetasoundFrontendLiteralBlueprintAccess.CreateIntArrayMetaSoundLiteral
// 0x0068 (0x0068 - 0x0000)
struct MetasoundFrontendLiteralBlueprintAccess_CreateIntArrayMetaSoundLiteral final
{
public:
	TArray<int32>                                 Value;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              ReturnValue;                                       // 0x0010(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundFrontendLiteralBlueprintAccess_CreateIntArrayMetaSoundLiteral;

// Function MetasoundEngine.MetasoundFrontendLiteralBlueprintAccess.CreateIntMetaSoundLiteral
// 0x0060 (0x0060 - 0x0000)
struct MetasoundFrontendLiteralBlueprintAccess_CreateIntMetaSoundLiteral final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetasoundFrontendLiteral              ReturnValue;                                       // 0x0008(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundFrontendLiteralBlueprintAccess_CreateIntMetaSoundLiteral;

// Function MetasoundEngine.MetasoundFrontendLiteralBlueprintAccess.CreateMetaSoundLiteralFromParam
// 0x00F8 (0x00F8 - 0x0000)
struct MetasoundFrontendLiteralBlueprintAccess_CreateMetaSoundLiteralFromParam final
{
public:
	struct FAudioParameter                        Param;                                             // 0x0000(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              ReturnValue;                                       // 0x00A0(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundFrontendLiteralBlueprintAccess_CreateMetaSoundLiteralFromParam;

// Function MetasoundEngine.MetasoundFrontendLiteralBlueprintAccess.CreateObjectArrayMetaSoundLiteral
// 0x0068 (0x0068 - 0x0000)
struct MetasoundFrontendLiteralBlueprintAccess_CreateObjectArrayMetaSoundLiteral final
{
public:
	TArray<class UObject*>                        Value;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              ReturnValue;                                       // 0x0010(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundFrontendLiteralBlueprintAccess_CreateObjectArrayMetaSoundLiteral;

// Function MetasoundEngine.MetasoundFrontendLiteralBlueprintAccess.CreateObjectMetaSoundLiteral
// 0x0060 (0x0060 - 0x0000)
struct MetasoundFrontendLiteralBlueprintAccess_CreateObjectMetaSoundLiteral final
{
public:
	class UObject*                                Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              ReturnValue;                                       // 0x0008(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundFrontendLiteralBlueprintAccess_CreateObjectMetaSoundLiteral;

// Function MetasoundEngine.MetasoundFrontendLiteralBlueprintAccess.CreateStringArrayMetaSoundLiteral
// 0x0068 (0x0068 - 0x0000)
struct MetasoundFrontendLiteralBlueprintAccess_CreateStringArrayMetaSoundLiteral final
{
public:
	TArray<class FString>                         Value;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              ReturnValue;                                       // 0x0010(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundFrontendLiteralBlueprintAccess_CreateStringArrayMetaSoundLiteral;

// Function MetasoundEngine.MetasoundFrontendLiteralBlueprintAccess.CreateStringMetaSoundLiteral
// 0x0068 (0x0068 - 0x0000)
struct MetasoundFrontendLiteralBlueprintAccess_CreateStringMetaSoundLiteral final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              ReturnValue;                                       // 0x0010(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundFrontendLiteralBlueprintAccess_CreateStringMetaSoundLiteral;

// Function MetasoundEngine.MetasoundGeneratorHandle.CreateMetaSoundGeneratorHandle
// 0x0010 (0x0010 - 0x0000)
struct MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle final
{
public:
	class UAudioComponent*                        OnComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetasoundGeneratorHandle*              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundGeneratorHandle_CreateMetaSoundGeneratorHandle;

// Function MetasoundEngine.MetasoundGeneratorHandle.ApplyParameterPack
// 0x0010 (0x0010 - 0x0000)
struct MetasoundGeneratorHandle_ApplyParameterPack final
{
public:
	class UMetasoundParameterPack*                Pack;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetasoundGeneratorHandle_ApplyParameterPack;

// Function MetasoundEngine.MetasoundGeneratorHandle.WatchOutput
// 0x002C (0x002C - 0x0000)
struct MetasoundGeneratorHandle_WatchOutput final
{
public:
	class FName                                   OutputName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class FName OutputName, const struct FMetaSoundOutput& Output)> OnOutputValueChanged; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnalyzerName;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnalyzerOutputName;                                // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetasoundGeneratorHandle_WatchOutput;

// Function MetasoundEngine.MetasoundGeneratorHandle.EnableRuntimeRenderTiming
// 0x0001 (0x0001 - 0x0000)
struct MetasoundGeneratorHandle_EnableRuntimeRenderTiming final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundGeneratorHandle_EnableRuntimeRenderTiming;

// Function MetasoundEngine.MetasoundGeneratorHandle.GetCPUCoreUtilization
// 0x0008 (0x0008 - 0x0000)
struct MetasoundGeneratorHandle_GetCPUCoreUtilization final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundGeneratorHandle_GetCPUCoreUtilization;

// Function MetasoundEngine.MetaSoundCacheSubsystem.PrecacheMetaSound
// 0x0010 (0x0010 - 0x0000)
struct MetaSoundCacheSubsystem_PrecacheMetaSound final
{
public:
	class UMetaSoundSource*                       InMetaSound;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InNumInstances;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundCacheSubsystem_PrecacheMetaSound;

// Function MetasoundEngine.MetaSoundCacheSubsystem.RemoveCachedOperatorsForMetaSound
// 0x0008 (0x0008 - 0x0000)
struct MetaSoundCacheSubsystem_RemoveCachedOperatorsForMetaSound final
{
public:
	class UMetaSoundSource*                       InMetaSound;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundCacheSubsystem_RemoveCachedOperatorsForMetaSound;

// Function MetasoundEngine.MetaSoundCacheSubsystem.TouchOrPrecacheMetaSound
// 0x0010 (0x0010 - 0x0000)
struct MetaSoundCacheSubsystem_TouchOrPrecacheMetaSound final
{
public:
	class UMetaSoundSource*                       InMetaSound;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InNumInstances;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundCacheSubsystem_TouchOrPrecacheMetaSound;

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.GetBool
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_GetBool final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetasoundOutputBlueprintAccess_GetBool;

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.GetFloat
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_GetFloat final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundOutputBlueprintAccess_GetFloat;

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.GetInt32
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_GetInt32 final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundOutputBlueprintAccess_GetInt32;

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.GetString
// 0x0028 (0x0028 - 0x0000)
struct MetasoundOutputBlueprintAccess_GetString final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundOutputBlueprintAccess_GetString;

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.GetTimeSeconds
// 0x0020 (0x0020 - 0x0000)
struct MetasoundOutputBlueprintAccess_GetTimeSeconds final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetasoundOutputBlueprintAccess_GetTimeSeconds;

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.IsBool
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_IsBool final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetasoundOutputBlueprintAccess_IsBool;

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.IsFloat
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_IsFloat final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetasoundOutputBlueprintAccess_IsFloat;

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.IsInt32
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_IsInt32 final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetasoundOutputBlueprintAccess_IsInt32;

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.IsString
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_IsString final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetasoundOutputBlueprintAccess_IsString;

// Function MetasoundEngine.MetasoundOutputBlueprintAccess.IsTime
// 0x0018 (0x0018 - 0x0000)
struct MetasoundOutputBlueprintAccess_IsTime final
{
public:
	struct FMetaSoundOutput                       Output;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetasoundOutputBlueprintAccess_IsTime;

// Function MetasoundEngine.MetaSoundOutputSubsystem.WatchOutput
// 0x0038 (0x0038 - 0x0000)
struct MetaSoundOutputSubsystem_WatchOutput final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutputName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class FName OutputName, const struct FMetaSoundOutput& Output)> OnOutputValueChanged; // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnalyzerName;                                      // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnalyzerOutputName;                                // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundOutputSubsystem_WatchOutput;

// Function MetasoundEngine.MetaSoundQualityHelper.GetQualityNames
// 0x0010 (0x0010 - 0x0000)
struct MetaSoundQualityHelper_GetQualityNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundQualityHelper_GetQualityNames;

// Function MetasoundEngine.MetaSoundAssetSubsystem.RegisterAssetClassesInDirectories
// 0x0010 (0x0010 - 0x0000)
struct MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories final
{
public:
	TArray<struct FMetaSoundAssetDirectory>       Directories;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundAssetSubsystem_RegisterAssetClassesInDirectories;

// Function MetasoundEngine.MetaSoundAssetSubsystem.UnregisterAssetClassesInDirectories
// 0x0010 (0x0010 - 0x0000)
struct MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories final
{
public:
	TArray<struct FMetaSoundAssetDirectory>       Directories;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundAssetSubsystem_UnregisterAssetClassesInDirectories;

// Function MetasoundEngine.MetaSoundBuilderBase.AddGraphInputNode
// 0x0090 (0x0090 - 0x0000)
struct MetaSoundBuilderBase_AddGraphInputNode final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DataType;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              DefaultValue;                                      // 0x0010(0x0058)(Parm, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsConstructorInput;                               // 0x0069(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundBuilderNodeOutputHandle      ReturnValue;                                       // 0x006C(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_AddGraphInputNode;

// Function MetasoundEngine.MetaSoundBuilderBase.AddGraphOutputNode
// 0x0090 (0x0090 - 0x0000)
struct MetaSoundBuilderBase_AddGraphOutputNode final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DataType;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetasoundFrontendLiteral              DefaultValue;                                      // 0x0010(0x0058)(Parm, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsConstructorOutput;                              // 0x0069(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundBuilderNodeInputHandle       ReturnValue;                                       // 0x006C(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_AddGraphOutputNode;

// Function MetasoundEngine.MetaSoundBuilderBase.AddInterface
// 0x000C (0x000C - 0x0000)
struct MetaSoundBuilderBase_AddInterface final
{
public:
	class FName                                   InterfaceName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_AddInterface;

// Function MetasoundEngine.MetaSoundBuilderBase.AddNode
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_AddNode final
{
public:
	TScriptInterface<class IMetaSoundDocumentInterface> NodeClass;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x0014(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_AddNode;

// Function MetasoundEngine.MetaSoundBuilderBase.AddNodeByClassName
// 0x0030 (0x0030 - 0x0000)
struct MetaSoundBuilderBase_AddNodeByClassName final
{
public:
	struct FMetasoundFrontendClassName            ClassName;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MajorVersion;                                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_AddNodeByClassName;

// Function MetasoundEngine.MetaSoundBuilderBase.BuildAndOverwriteMetaSound
// 0x0018 (0x0018 - 0x0000)
struct MetaSoundBuilderBase_BuildAndOverwriteMetaSound final
{
public:
	TScriptInterface<class IMetaSoundDocumentInterface> ExistingMetaSound;                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceUniqueClassName;                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_BuildAndOverwriteMetaSound;

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeInputsToMatchingGraphInterfaceInputs
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundBuilderNodeOutputHandle> ReturnValue;                                    // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_ConnectNodeInputsToMatchingGraphInterfaceInputs;

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeInputToGraphInput
// 0x002C (0x002C - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeInputToGraphInput final
{
public:
	class FName                                   GraphInputName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_ConnectNodeInputToGraphInput;

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeOutputsToMatchingGraphInterfaceOutputs
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundBuilderNodeInputHandle> ReturnValue;                                     // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_ConnectNodeOutputsToMatchingGraphInterfaceOutputs;

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodeOutputToGraphOutput
// 0x002C (0x002C - 0x0000)
struct MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput final
{
public:
	class FName                                   GraphOutputName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_ConnectNodeOutputToGraphOutput;

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodes
// 0x0044 (0x0044 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodes final
{
public:
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0020(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_ConnectNodes;

// Function MetasoundEngine.MetaSoundBuilderBase.ConnectNodesByInterfaceBindings
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_ConnectNodesByInterfaceBindings final
{
public:
	struct FMetaSoundNodeHandle                   FromNodeHandle;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMetaSoundNodeHandle                   ToNodeHandle;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_ConnectNodesByInterfaceBindings;

// Function MetasoundEngine.MetaSoundBuilderBase.ConvertFromPreset
// 0x0001 (0x0001 - 0x0000)
struct MetaSoundBuilderBase_ConvertFromPreset final
{
public:
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_ConvertFromPreset;

// Function MetasoundEngine.MetaSoundBuilderBase.ConvertToPreset
// 0x0018 (0x0018 - 0x0000)
struct MetaSoundBuilderBase_ConvertToPreset final
{
public:
	TScriptInterface<class IMetaSoundDocumentInterface> ReferencedNodeClass;                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_ConvertToPreset;

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodeInput
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodeInput final
{
public:
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_DisconnectNodeInput;

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodeOutput
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodeOutput final
{
public:
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_DisconnectNodeOutput;

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodes
// 0x0044 (0x0044 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodes final
{
public:
	struct FMetaSoundBuilderNodeOutputHandle      NodeOutputHandle;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaSoundBuilderNodeInputHandle       NodeInputHandle;                                   // 0x0020(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_DisconnectNodes;

// Function MetasoundEngine.MetaSoundBuilderBase.DisconnectNodesByInterfaceBindings
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings final
{
public:
	struct FMetaSoundNodeHandle                   FromNodeHandle;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMetaSoundNodeHandle                   ToNodeHandle;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_DisconnectNodesByInterfaceBindings;

// Function MetasoundEngine.MetaSoundBuilderBase.FindGraphInputNode
// 0x001C (0x001C - 0x0000)
struct MetaSoundBuilderBase_FindGraphInputNode final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x000C(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindGraphInputNode;

// Function MetasoundEngine.MetaSoundBuilderBase.FindGraphOutputNode
// 0x001C (0x001C - 0x0000)
struct MetaSoundBuilderBase_FindGraphOutputNode final
{
public:
	class FName                                   OutputName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x000C(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindGraphOutputNode;

// Function MetasoundEngine.MetaSoundBuilderBase.FindInterfaceInputNodes
// 0x0020 (0x0020 - 0x0000)
struct MetaSoundBuilderBase_FindInterfaceInputNodes final
{
public:
	class FName                                   InterfaceName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundNodeHandle>           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindInterfaceInputNodes;

// Function MetasoundEngine.MetaSoundBuilderBase.FindInterfaceOutputNodes
// 0x0020 (0x0020 - 0x0000)
struct MetaSoundBuilderBase_FindInterfaceOutputNodes final
{
public:
	class FName                                   InterfaceName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundNodeHandle>           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindInterfaceOutputNodes;

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeClassVersion
// 0x0024 (0x0024 - 0x0000)
struct MetaSoundBuilderBase_FindNodeClassVersion final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetasoundFrontendVersion              ReturnValue;                                       // 0x0014(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindNodeClassVersion;

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeInputByName
// 0x003C (0x003C - 0x0000)
struct MetaSoundBuilderBase_FindNodeInputByName final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   InputName;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundBuilderNodeInputHandle       ReturnValue;                                       // 0x001C(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindNodeInputByName;

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeInputParent
// 0x0034 (0x0034 - 0x0000)
struct MetaSoundBuilderBase_FindNodeInputParent final
{
public:
	struct FMetaSoundBuilderNodeInputHandle       InputHandle;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x0024(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindNodeInputParent;

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeInputs
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_FindNodeInputs final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundBuilderNodeInputHandle> ReturnValue;                                     // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindNodeInputs;

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeInputsByDataType
// 0x0030 (0x0030 - 0x0000)
struct MetaSoundBuilderBase_FindNodeInputsByDataType final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DataType;                                          // 0x0014(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundBuilderNodeInputHandle> ReturnValue;                                     // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindNodeInputsByDataType;

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeOutputByName
// 0x003C (0x003C - 0x0000)
struct MetaSoundBuilderBase_FindNodeOutputByName final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OutputName;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundBuilderNodeOutputHandle      ReturnValue;                                       // 0x001C(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindNodeOutputByName;

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeOutputParent
// 0x0034 (0x0034 - 0x0000)
struct MetaSoundBuilderBase_FindNodeOutputParent final
{
public:
	struct FMetaSoundBuilderNodeOutputHandle      OutputHandle;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaSoundNodeHandle                   ReturnValue;                                       // 0x0024(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindNodeOutputParent;

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeOutputs
// 0x0028 (0x0028 - 0x0000)
struct MetaSoundBuilderBase_FindNodeOutputs final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMetaSoundBuilderNodeOutputHandle> ReturnValue;                                    // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MetaSoundBuilderBase_FindNodeOutputs;

// Function MetasoundEngine.MetaSoundBuilderBase.FindNodeOutputsByDataType
// 0x0030 (0x0030 - 0x0000)
struct MetaSoundBuilderBase_FindNodeOutputsByDataType final
{
public:
	struct FMetaSoundNodeHandle                   NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EMetaSoundBuilderResult                       OutResult;                                         // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
