#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetasoundEngine

#include "Basic.hpp"

#include "AudioExtensions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MetasoundFrontend_structs.hpp"


namespace SDK
{

// Enum MetasoundEngine.EMetaSoundMessageLevel
// NumValues: 0x0004
enum class EMetaSoundMessageLevel : uint8
{
	Error                                    = 0,
	Warning                                  = 1,
	Info                                     = 2,
	EMetaSoundMessageLevel_MAX               = 3,
};

// Enum MetasoundEngine.EMetaSoundOutputAudioFormat
// NumValues: 0x0007
enum class EMetaSoundOutputAudioFormat : uint8
{
	Mono                                     = 0,
	Stereo                                   = 1,
	Quad                                     = 2,
	FiveDotOne                               = 3,
	SevenDotOne                              = 4,
	COUNT                                    = 5,
	EMetaSoundOutputAudioFormat_MAX          = 6,
};

// Enum MetasoundEngine.EMetaSoundBuilderResult
// NumValues: 0x0003
enum class EMetaSoundBuilderResult : uint8
{
	Succeeded                                = 0,
	Failed                                   = 1,
	EMetaSoundBuilderResult_MAX              = 2,
};

// ScriptStruct MetasoundEngine.MetaSoundNodeHandle
// 0x0010 (0x0010 - 0x0000)
struct FMetaSoundNodeHandle final
{
public:
	struct FGuid                                  NodeID;                                            // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMetaSoundNodeHandle;

// ScriptStruct MetasoundEngine.MetaSoundOutput
// 0x0008 (0x0010 - 0x0008)
struct alignas(0x08) FMetaSoundOutput final : public FSoundGeneratorOutput
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMetaSoundOutput;

// ScriptStruct MetasoundEngine.DefaultMetaSoundAssetAutoUpdateSettings
// 0x0020 (0x0020 - 0x0000)
struct FDefaultMetaSoundAssetAutoUpdateSettings final
{
public:
	struct FSoftObjectPath                        Metasound;                                         // 0x0000(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDefaultMetaSoundAssetAutoUpdateSettings;

// ScriptStruct MetasoundEngine.MetaSoundPageSettings
// 0x0018 (0x0018 - 0x0000)
struct FMetaSoundPageSettings final
{
public:
	struct FGuid                                  UniqueID;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMetaSoundPageSettings;

// ScriptStruct MetasoundEngine.MetaSoundQualitySettings
// 0x0020 (0x0020 - 0x0000)
struct FMetaSoundQualitySettings final
{
public:
	struct FGuid                                  UniqueID;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerPlatformInt                        SampleRate;                                        // 0x0018(0x0004)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerPlatformFloat                      BlockRate;                                         // 0x001C(0x0004)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMetaSoundQualitySettings;

// ScriptStruct MetasoundEngine.MetaSoundAssetDirectory
// 0x0010 (0x0010 - 0x0000)
struct FMetaSoundAssetDirectory final
{
public:
	struct FDirectoryPath                         Directory;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMetaSoundAssetDirectory;

// ScriptStruct MetasoundEngine.MetaSoundAsyncAssetDependencies
// 0x0030 (0x0030 - 0x0000)
struct FMetaSoundAsyncAssetDependencies final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Metasound;                                         // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_10[0x20];                                      // 0x0010(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMetaSoundAsyncAssetDependencies;

// ScriptStruct MetasoundEngine.MetaSoundBuilderNodeInputHandle
// 0x0000 (0x0020 - 0x0020)
struct FMetaSoundBuilderNodeInputHandle final : public FMetasoundFrontendVertexHandle
{
};
DUMPER7_ASSERTS_FMetaSoundBuilderNodeInputHandle;

// ScriptStruct MetasoundEngine.MetaSoundBuilderNodeOutputHandle
// 0x0000 (0x0020 - 0x0020)
struct FMetaSoundBuilderNodeOutputHandle final : public FMetasoundFrontendVertexHandle
{
};
DUMPER7_ASSERTS_FMetaSoundBuilderNodeOutputHandle;

// ScriptStruct MetasoundEngine.MetaSoundBuilderOptions
// 0x0020 (0x0020 - 0x0000)
struct FMetaSoundBuilderOptions final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceUniqueClassName;                             // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddToRegistry;                                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMetaSoundDocumentInterface> ExistingMetaSound;                           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMetaSoundBuilderOptions;

}

