#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinimapWidget_ASA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ShooterGame_structs.hpp"
#include "ShooterGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MinimapWidget_ASA.MinimapWidget_ASA_C
// 0x01A0 (0x0518 - 0x0378)
class UMinimapWidget_ASA_C final : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasExtra;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainCanvas;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Minimap_Image;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMapMarkWidget_ASA_C*                   PlayerMark_Owner;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PoiCanvas;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MiniMapMAT;                                        // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPointOfInterestData>           MarkPOIs;                                          // 0x03B0(0x0010)(Edit, BlueprintVisible)
	class APrimalCharacter*                       primalChar;                                        // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ScaleMinimap;                                      // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMapMarkWidget_ASA_C*>           _MapMarksWidgets;                                  // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         NextPlayerMarkIndex;                               // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PlayerLocation;                                    // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapData                               CachedMinimapData;                                 // 0x03F8(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        LasTimeUpdate;                                     // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ScalePOI;                                          // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OriginalScaleMinimap;                              // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OriginalScaleOverridePOI;                          // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MaxScaleOverridePOI;                               // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FMinimapMark& Mark, bool IsTracking)> RefreshTracking; // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              RefreshCachedData;                                 // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         OverrideSelectedCacheMap;                          // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOverridingCacheMap;                              // 0x04DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DD[0x3];                                      // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeShowLastDeath;                                 // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastDeathMarkRemoveTime;                           // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCornerMinimap;                                   // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FMinimapMark& Mark)> HandleEditMark;                  // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector2D                              PlayerCoords;                                      // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDontShowPOI;                                      // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSpawnUI;                                         // 0x0511(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AssignOnHandleMark(class UMapMarkWidget_ASA_C* ref);
	void CalculateWorldLocationMinimap(const struct FVector2D& Vector, struct FVector* Loc);
	void Construct();
	void ExecuteUbergraph_MinimapWidget_ASA(int32 EntryPoint);
	void GeneratePOIs();
	void Get_Current_MiniMap_Data(struct FMapData* CurrentMinimapData);
	struct FVector2D Get_Render_Scale_for_POI();
	void GetAllPois(TArray<struct FPointOfInterestData>* MarkPOIs_0);
	void GetLocationWIthCoords(const struct FVector2D& Coords, struct FVector* Location);
	void GetMiniMapData(TArray<struct FMapData>* Minimaps);
	struct FVector2D GetMinimapLocation(const struct FVector& InputPin, bool NoUseScaleMinimap, struct FVector2D* Coords);
	void GetPawnLoc(class APrimalCharacter* Pawn, struct FVector* WorldLocation);
	void HaandleEditMark_Event(const struct FMinimapMark& Mark);
	void HandleTracking_Event(const struct FMinimapMark& Mark, bool IsTracking);
	void IncrementCacheOverride(int32 Qty);
	void LocAndRotYourself(const struct FVector2D& InPosition);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TraceGroundLocation(const struct FVector& WithLocation, bool* Found, double* Z);
	void UpdateCachedData();
	void UpdateOwnPlayerMark();
	void UpdateZoomMap(double Zoom);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MinimapWidget_ASA_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MinimapWidget_ASA_C")
	}
	static class UMinimapWidget_ASA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinimapWidget_ASA_C>();
	}
};
DUMPER7_ASSERTS_UMinimapWidget_ASA_C;

}

