#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinimalSwitchUI_Widget

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MinimalSwitchUI_Widget.MinimalSwitchUI_Widget_C
// 0x0048 (0x03C0 - 0x0378)
class UMinimalSwitchUI_Widget_C final : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         GamepadButton;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KBMShowButton;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 HideMoreInfoText;                                  // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 ShowMoreInfoText;                                  // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          CachedlMinimalUI;                                  // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_MinimalSwitchUI_Widget(int32 EntryPoint);
	void FixConsoleIcons();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateTooltipMoreInfo();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MinimalSwitchUI_Widget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MinimalSwitchUI_Widget_C")
	}
	static class UMinimalSwitchUI_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinimalSwitchUI_Widget_C>();
	}
};
DUMPER7_ASSERTS_UMinimalSwitchUI_Widget_C;

}

