#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieScene

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MovieScene.MovieSceneBoundObjectProxy.BP_GetBoundObjectForSequencer
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneBoundObjectProxy_BP_GetBoundObjectForSequencer final
{
public:
	class UObject*                                ResolvedObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneBoundObjectProxy_BP_GetBoundObjectForSequencer;

// Function MovieScene.MovieSceneBindingEventReceiverInterface.OnObjectBoundBySequencer
// 0x0020 (0x0020 - 0x0000)
struct MovieSceneBindingEventReceiverInterface_OnObjectBoundBySequencer final
{
public:
	class UMovieSceneSequencePlayer*              Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             BindingID;                                         // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneBindingEventReceiverInterface_OnObjectBoundBySequencer;

// Function MovieScene.MovieSceneBindingEventReceiverInterface.OnObjectUnboundBySequencer
// 0x0020 (0x0020 - 0x0000)
struct MovieSceneBindingEventReceiverInterface_OnObjectUnboundBySequencer final
{
public:
	class UMovieSceneSequencePlayer*              Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             BindingID;                                         // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneBindingEventReceiverInterface_OnObjectUnboundBySequencer;

// Function MovieScene.MovieSceneCondition.BP_EvaluateCondition
// 0x0038 (0x0038 - 0x0000)
struct MovieSceneCondition_BP_EvaluateCondition final
{
public:
	struct FMovieSceneConditionContext            ConditionContext;                                  // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovieSceneCondition_BP_EvaluateCondition;

// Function MovieScene.MovieSceneCondition.BP_GetCheckFrequency
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneCondition_BP_GetCheckFrequency final
{
public:
	EMovieSceneConditionCheckFrequency            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneCondition_BP_GetCheckFrequency;

// Function MovieScene.MovieSceneCondition.BP_GetScope
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneCondition_BP_GetScope final
{
public:
	EMovieSceneConditionScope                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneCondition_BP_GetScope;

// Function MovieScene.MovieSceneCustomBinding.GetBaseCustomPriority
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneCustomBinding_GetBaseCustomPriority final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneCustomBinding_GetBaseCustomPriority;

// Function MovieScene.MovieSceneCustomBinding.GetBaseEnginePriority
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneCustomBinding_GetBaseEnginePriority final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneCustomBinding_GetBaseEnginePriority;

// Function MovieScene.MovieSceneEasingFunction.OnEvaluate
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneEasingFunction_OnEvaluate final
{
public:
	float                                         Interp;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneEasingFunction_OnEvaluate;

// Function MovieScene.MovieSceneSection.SetBlendType
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSection_SetBlendType final
{
public:
	EMovieSceneBlendType                          InBlendType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_SetBlendType;

// Function MovieScene.MovieSceneSection.SetColorTint
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSection_SetColorTint final
{
public:
	struct FColor                                 InColorTint;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_SetColorTint;

// Function MovieScene.MovieSceneSection.SetCompletionMode
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSection_SetCompletionMode final
{
public:
	EMovieSceneCompletionMode                     InCompletionMode;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_SetCompletionMode;

// Function MovieScene.MovieSceneSection.SetIsActive
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSection_SetIsActive final
{
public:
	bool                                          bInIsActive;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_SetIsActive;

// Function MovieScene.MovieSceneSection.SetIsLocked
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSection_SetIsLocked final
{
public:
	bool                                          bInIsLocked;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_SetIsLocked;

// Function MovieScene.MovieSceneSection.SetOverlapPriority
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSection_SetOverlapPriority final
{
public:
	int32                                         NewPriority;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_SetOverlapPriority;

// Function MovieScene.MovieSceneSection.SetPostRollFrames
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSection_SetPostRollFrames final
{
public:
	int32                                         InPostRollFrames;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_SetPostRollFrames;

// Function MovieScene.MovieSceneSection.SetPreRollFrames
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSection_SetPreRollFrames final
{
public:
	int32                                         InPreRollFrames;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_SetPreRollFrames;

// Function MovieScene.MovieSceneSection.SetRowIndex
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSection_SetRowIndex final
{
public:
	int32                                         NewRowIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_SetRowIndex;

// Function MovieScene.MovieSceneSection.GetBlendType
// 0x0002 (0x0002 - 0x0000)
struct MovieSceneSection_GetBlendType final
{
public:
	struct FOptionalMovieSceneBlendType           ReturnValue;                                       // 0x0000(0x0002)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_GetBlendType;

// Function MovieScene.MovieSceneSection.GetColorTint
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSection_GetColorTint final
{
public:
	struct FColor                                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_GetColorTint;

// Function MovieScene.MovieSceneSection.GetCompletionMode
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSection_GetCompletionMode final
{
public:
	EMovieSceneCompletionMode                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_GetCompletionMode;

// Function MovieScene.MovieSceneSection.GetOverlapPriority
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSection_GetOverlapPriority final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_GetOverlapPriority;

// Function MovieScene.MovieSceneSection.GetPostRollFrames
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSection_GetPostRollFrames final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_GetPostRollFrames;

// Function MovieScene.MovieSceneSection.GetPreRollFrames
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSection_GetPreRollFrames final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_GetPreRollFrames;

// Function MovieScene.MovieSceneSection.GetRowIndex
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSection_GetRowIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_GetRowIndex;

// Function MovieScene.MovieSceneSection.IsActive
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSection_IsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_IsActive;

// Function MovieScene.MovieSceneSection.IsLocked
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSection_IsLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSection_IsLocked;

// Function MovieScene.MovieSceneCustomClockSource.OnRequestCurrentTime
// 0x001C (0x001C - 0x0000)
struct MovieSceneCustomClockSource_OnRequestCurrentTime final
{
public:
	struct FQualifiedFrameTime                    InCurrentTime;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InPlayRate;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameTime                             ReturnValue;                                       // 0x0014(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneCustomClockSource_OnRequestCurrentTime;

// Function MovieScene.MovieSceneCustomClockSource.OnStartPlaying
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneCustomClockSource_OnStartPlaying final
{
public:
	struct FQualifiedFrameTime                    InStartTime;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneCustomClockSource_OnStartPlaying;

// Function MovieScene.MovieSceneCustomClockSource.OnStopPlaying
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneCustomClockSource_OnStopPlaying final
{
public:
	struct FQualifiedFrameTime                    InStopTime;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneCustomClockSource_OnStopPlaying;

// Function MovieScene.MovieSceneCustomClockSource.OnTick
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneCustomClockSource_OnTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPlayRate;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneCustomClockSource_OnTick;

// Function MovieScene.BuiltInDynamicBindingResolverLibrary.ResolveToPlayerPawn
// 0x0020 (0x0020 - 0x0000)
struct BuiltInDynamicBindingResolverLibrary_ResolveToPlayerPawn final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayerControllerIndex;                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneDynamicBindingResolveResult ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BuiltInDynamicBindingResolverLibrary_ResolveToPlayerPawn;

// Function MovieScene.MovieSceneMetaData.SetAuthor
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneMetaData_SetAuthor final
{
public:
	class FString                                 InAuthor;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneMetaData_SetAuthor;

// Function MovieScene.MovieSceneMetaData.SetCreated
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneMetaData_SetCreated final
{
public:
	struct FDateTime                              InCreated;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneMetaData_SetCreated;

// Function MovieScene.MovieSceneMetaData.SetNotes
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneMetaData_SetNotes final
{
public:
	class FString                                 InNotes;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneMetaData_SetNotes;

// Function MovieScene.MovieSceneMetaData.GetAuthor
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneMetaData_GetAuthor final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneMetaData_GetAuthor;

// Function MovieScene.MovieSceneMetaData.GetCreated
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneMetaData_GetCreated final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneMetaData_GetCreated;

// Function MovieScene.MovieSceneMetaData.GetNotes
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneMetaData_GetNotes final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneMetaData_GetNotes;

// Function MovieScene.MovieSceneSequence.FindBindingByTag
// 0x0020 (0x0020 - 0x0000)
struct MovieSceneSequence_FindBindingByTag final
{
public:
	class FName                                   InBindingName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequence_FindBindingByTag;

// Function MovieScene.MovieSceneSequence.FindBindingsByTag
// 0x0018 (0x0018 - 0x0000)
struct MovieSceneSequence_FindBindingsByTag final
{
public:
	class FName                                   InBindingName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMovieSceneObjectBindingID>     ReturnValue;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequence_FindBindingsByTag;

// Function MovieScene.MovieSceneSequence.GetEarliestTimecodeSource
// 0x0018 (0x0018 - 0x0000)
struct MovieSceneSequence_GetEarliestTimecodeSource final
{
public:
	struct FMovieSceneTimecodeSource              ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequence_GetEarliestTimecodeSource;

// Function MovieScene.MovieSceneSequencePlayer.GetBoundObjects
// 0x0028 (0x0028 - 0x0000)
struct MovieSceneSequencePlayer_GetBoundObjects final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetBoundObjects;

// Function MovieScene.MovieSceneSequencePlayer.GetDisableCameraCuts
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSequencePlayer_GetDisableCameraCuts final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetDisableCameraCuts;

// Function MovieScene.MovieSceneSequencePlayer.GetObjectBindings
// 0x0018 (0x0018 - 0x0000)
struct MovieSceneSequencePlayer_GetObjectBindings final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMovieSceneObjectBindingID>     ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetObjectBindings;

// Function MovieScene.MovieSceneSequencePlayer.PlayLooping
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_PlayLooping final
{
public:
	int32                                         NumLoops;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_PlayLooping;

// Function MovieScene.MovieSceneSequencePlayer.PlayTo
// 0x0048 (0x0048 - 0x0000)
struct MovieSceneSequencePlayer_PlayTo final
{
public:
	struct FMovieSceneSequencePlaybackParams      PlaybackParams;                                    // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	struct FMovieSceneSequencePlayToParams        PlayToParams;                                      // 0x0040(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_PlayTo;

// Function MovieScene.MovieSceneSequencePlayer.RequestInvalidateBinding
// 0x0018 (0x0018 - 0x0000)
struct MovieSceneSequencePlayer_RequestInvalidateBinding final
{
public:
	struct FMovieSceneObjectBindingID             ObjectBinding;                                     // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_RequestInvalidateBinding;

// Function MovieScene.MovieSceneSequencePlayer.RPC_ExplicitServerUpdateEvent
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneSequencePlayer_RPC_ExplicitServerUpdateEvent final
{
public:
	EUpdatePositionMethod                         Method;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameTime                             RelevantTime;                                      // 0x0004(0x0008)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         NewSerialNumber;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_RPC_ExplicitServerUpdateEvent;

// Function MovieScene.MovieSceneSequencePlayer.RPC_OnFinishPlaybackEvent
// 0x000C (0x000C - 0x0000)
struct MovieSceneSequencePlayer_RPC_OnFinishPlaybackEvent final
{
public:
	struct FFrameTime                             StoppedTime;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         NewSerialNumber;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_RPC_OnFinishPlaybackEvent;

// Function MovieScene.MovieSceneSequencePlayer.RPC_OnStopEvent
// 0x000C (0x000C - 0x0000)
struct MovieSceneSequencePlayer_RPC_OnStopEvent final
{
public:
	struct FFrameTime                             StoppedTime;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         NewSerialNumber;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_RPC_OnStopEvent;

// Function MovieScene.MovieSceneSequencePlayer.SetCompletionModeOverride
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSequencePlayer_SetCompletionModeOverride final
{
public:
	EMovieSceneCompletionModeOverride             CompletionModeOverride;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_SetCompletionModeOverride;

// Function MovieScene.MovieSceneSequencePlayer.SetDisableCameraCuts
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSequencePlayer_SetDisableCameraCuts final
{
public:
	bool                                          bInDisableCameraCuts;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_SetDisableCameraCuts;

// Function MovieScene.MovieSceneSequencePlayer.SetFrameRange
// 0x000C (0x000C - 0x0000)
struct MovieSceneSequencePlayer_SetFrameRange final
{
public:
	int32                                         StartFrame;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Duration;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SubFrames;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_SetFrameRange;

// Function MovieScene.MovieSceneSequencePlayer.SetFrameRate
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneSequencePlayer_SetFrameRate final
{
public:
	struct FFrameRate                             FrameRate;                                         // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_SetFrameRate;

// Function MovieScene.MovieSceneSequencePlayer.SetHideHud
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSequencePlayer_SetHideHud final
{
public:
	bool                                          HideHud;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_SetHideHud;

// Function MovieScene.MovieSceneSequencePlayer.SetPlaybackPosition
// 0x0040 (0x0040 - 0x0000)
struct MovieSceneSequencePlayer_SetPlaybackPosition final
{
public:
	struct FMovieSceneSequencePlaybackParams      PlaybackParams;                                    // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_SetPlaybackPosition;

// Function MovieScene.MovieSceneSequencePlayer.SetPlayRate
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_SetPlayRate final
{
public:
	float                                         PlayRate;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_SetPlayRate;

// Function MovieScene.MovieSceneSequencePlayer.SetTimeRange
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneSequencePlayer_SetTimeRange final
{
public:
	float                                         StartTime_0;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_SetTimeRange;

// Function MovieScene.MovieSceneSequencePlayer.SetWeight
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneSequencePlayer_SetWeight final
{
public:
	double                                        InWeight;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_SetWeight;

// Function MovieScene.MovieSceneSequencePlayer.GetCompletionModeOverride
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSequencePlayer_GetCompletionModeOverride final
{
public:
	EMovieSceneCompletionModeOverride             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetCompletionModeOverride;

// Function MovieScene.MovieSceneSequencePlayer.GetCurrentTime
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneSequencePlayer_GetCurrentTime final
{
public:
	struct FQualifiedFrameTime                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetCurrentTime;

// Function MovieScene.MovieSceneSequencePlayer.GetDuration
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneSequencePlayer_GetDuration final
{
public:
	struct FQualifiedFrameTime                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetDuration;

// Function MovieScene.MovieSceneSequencePlayer.GetEndTime
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneSequencePlayer_GetEndTime final
{
public:
	struct FQualifiedFrameTime                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetEndTime;

// Function MovieScene.MovieSceneSequencePlayer.GetFrameDuration
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_GetFrameDuration final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetFrameDuration;

// Function MovieScene.MovieSceneSequencePlayer.GetFrameRate
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneSequencePlayer_GetFrameRate final
{
public:
	struct FFrameRate                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetFrameRate;

// Function MovieScene.MovieSceneSequencePlayer.GetHideHud
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSequencePlayer_GetHideHud final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetHideHud;

// Function MovieScene.MovieSceneSequencePlayer.GetPlayRate
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneSequencePlayer_GetPlayRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetPlayRate;

// Function MovieScene.MovieSceneSequencePlayer.GetSequence
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneSequencePlayer_GetSequence final
{
public:
	class UMovieSceneSequence*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetSequence;

// Function MovieScene.MovieSceneSequencePlayer.GetSequenceName
// 0x0018 (0x0018 - 0x0000)
struct MovieSceneSequencePlayer_GetSequenceName final
{
public:
	bool                                          bAddClientInfo;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetSequenceName;

// Function MovieScene.MovieSceneSequencePlayer.GetStartTime
// 0x0010 (0x0010 - 0x0000)
struct MovieSceneSequencePlayer_GetStartTime final
{
public:
	struct FQualifiedFrameTime                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_GetStartTime;

// Function MovieScene.MovieSceneSequencePlayer.IsPaused
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSequencePlayer_IsPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_IsPaused;

// Function MovieScene.MovieSceneSequencePlayer.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSequencePlayer_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_IsPlaying;

// Function MovieScene.MovieSceneSequencePlayer.IsReversed
// 0x0001 (0x0001 - 0x0000)
struct MovieSceneSequencePlayer_IsReversed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSequencePlayer_IsReversed;

// Function MovieScene.MovieSceneSubSection.SetSequence
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneSubSection_SetSequence final
{
public:
	class UMovieSceneSequence*                    Sequence;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSubSection_SetSequence;

// Function MovieScene.MovieSceneSubSection.GetSequence
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneSubSection_GetSequence final
{
public:
	class UMovieSceneSequence*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MovieSceneSubSection_GetSequence;

}

