#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineRenderPasses

#include "Basic.hpp"


namespace SDK
{

// Enum MovieRenderPipelineRenderPasses.EMovieGraphPathTracerDenoiserType
// NumValues: 0x0003
enum class EMovieGraphPathTracerDenoiserType : uint8
{
	Spatial                                  = 0,
	Temporal                                 = 1,
	EMovieGraphPathTracerDenoiserType_MAX    = 2,
};

// Enum MovieRenderPipelineRenderPasses.EEXRCompressionFormat
// NumValues: 0x000B
enum class EEXRCompressionFormat : uint8
{
	None                                     = 0,
	RLE                                      = 1,
	ZIPS                                     = 2,
	ZIP                                      = 3,
	PIZ                                      = 4,
	PXR24                                    = 5,
	B44                                      = 6,
	B44A                                     = 7,
	DWAA                                     = 8,
	DWAB                                     = 9,
	Max                                      = 10,
};

// ScriptStruct MovieRenderPipelineRenderPasses.MoviePipelinePostProcessPass
// 0x0048 (0x0048 - 0x0000)
struct FMoviePipelinePostProcessPass final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      Material;                                          // 0x0018(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHighPrecisionOutput;                              // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoviePipelinePostProcessPass;

}

