#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "MovieRenderPipelineCore_structs.hpp"
#include "OpenColorIO_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class MovieRenderPipelineCore.MovieGraphNode
// 0x0080 (0x00A8 - 0x0028)
class UMovieGraphNode : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ScriptTags;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UMovieGraphPin*>                 InputPins;                                         // 0x0050(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class UMovieGraphPin*>                 OutputPins;                                        // 0x0060(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	struct FInstancedPropertyBag                  DynamicProperties;                                 // 0x0070(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMovieGraphPropertyInfo>        ExposedPropertyInfo;                               // 0x0080(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         bIsDisabled : 1;                                   // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDisabled(const bool bNewDisableState);
	void TogglePromotePropertyToPin(const class FName& PropertyName);

	bool CanBeAddedByUser() const;
	bool CanBeDisabled() const;
	EMovieGraphBranchRestriction GetBranchRestriction() const;
	TArray<struct FMovieGraphPropertyInfo> GetExposedProperties() const;
	class UMovieGraphPin* GetFirstConnectedInputPin() const;
	class UMovieGraphPin* GetFirstConnectedOutputPin() const;
	class UMovieGraphPin* GetInputPin(const class FName& InPinLabel, const EMovieGraphPinQueryRequirement PinRequirement) const;
	TArray<struct FMovieGraphPinProperties> GetInputPinProperties() const;
	const TArray<class UMovieGraphPin*> GetInputPins() const;
	class UMovieGraphPin* GetOutputPin(const class FName& InPinLabel) const;
	TArray<struct FMovieGraphPinProperties> GetOutputPinProperties() const;
	const TArray<class UMovieGraphPin*> GetOutputPins() const;
	TArray<struct FMovieGraphPropertyInfo> GetOverrideablePropertyInfo() const;
	bool IsDisabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphNode")
	}
	static class UMovieGraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphNode;

// Class MovieRenderPipelineCore.MovieGraphSettingNode
// 0x0000 (0x00A8 - 0x00A8)
class UMovieGraphSettingNode : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphSettingNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphSettingNode")
	}
	static class UMovieGraphSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSettingNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphSettingNode;

// Class MovieRenderPipelineCore.MovieGraphRenderLayerNode
// 0x0018 (0x00C0 - 0x00A8)
class UMovieGraphRenderLayerNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_LayerName : 1;                           // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LayerName;                                         // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphRenderLayerNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphRenderLayerNode")
	}
	static class UMovieGraphRenderLayerNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRenderLayerNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphRenderLayerNode;

// Class MovieRenderPipelineCore.MoviePipelineQueue
// 0x0040 (0x0068 - 0x0028)
class UMoviePipelineQueue final : public UObject
{
public:
	TArray<class UMoviePipelineExecutorJob*>      Jobs;                                              // 0x0028(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TSoftObjectPtr<class UMoviePipelineQueue>     QueueOrigin;                                       // 0x0038(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMoviePipelineExecutorJob* AllocateNewJob(TSubclassOf<class UMoviePipelineExecutorJob> InJobType);
	class UMoviePipelineQueue* CopyFrom(class UMoviePipelineQueue* InQueue);
	void DeleteAllJobs();
	void DeleteJob(class UMoviePipelineExecutorJob* InJob);
	class UMoviePipelineExecutorJob* DuplicateJob(class UMoviePipelineExecutorJob* InJob);
	void SetJobIndex(class UMoviePipelineExecutorJob* InJob, int32 Index_0);
	void SetQueueOrigin(class UMoviePipelineQueue* InConfig);

	TArray<class UMoviePipelineExecutorJob*> GetJobs() const;
	class UMoviePipelineQueue* GetQueueOrigin() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoviePipelineQueue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoviePipelineQueue")
	}
	static class UMoviePipelineQueue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineQueue>();
	}
};
DUMPER7_ASSERTS_UMoviePipelineQueue;

// Class MovieRenderPipelineCore.MovieGraphApplyCVarPresetNode
// 0x0018 (0x00C0 - 0x00A8)
class UMovieGraphApplyCVarPresetNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_ConsoleVariablePreset : 1;               // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMovieSceneConsoleVariableTrackInterface> ConsoleVariablePreset;          // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphApplyCVarPresetNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphApplyCVarPresetNode")
	}
	static class UMovieGraphApplyCVarPresetNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphApplyCVarPresetNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphApplyCVarPresetNode;

// Class MovieRenderPipelineCore.MovieGraphFileOutputNode
// 0x0018 (0x00C0 - 0x00A8)
class UMovieGraphFileOutputNode : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_FileNameFormat : 1;                      // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FileNameFormat;                                    // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphFileOutputNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphFileOutputNode")
	}
	static class UMovieGraphFileOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphFileOutputNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphFileOutputNode;

// Class MovieRenderPipelineCore.MovieGraphAudioOutputNode
// 0x0010 (0x00D0 - 0x00C0)
class UMovieGraphAudioOutputNode final : public UMovieGraphFileOutputNode
{
public:
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphAudioOutputNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphAudioOutputNode")
	}
	static class UMovieGraphAudioOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphAudioOutputNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphAudioOutputNode;

// Class MovieRenderPipelineCore.MovieGraphBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float GetCompletionPercentage(const class UMovieGraphPipeline* InPipeline);
	static float GetCurrentAperture(const class UMovieGraphPipeline* InMovieGraphPipeline, int32 InCameraIndex);
	static class UCineCameraComponent* GetCurrentCineCamera(const class UMovieGraphPipeline* InMovieGraphPipeline, int32 InCameraIndex);
	static class UMoviePipelineExecutorShot* GetCurrentExecutorShot(const class UMovieGraphPipeline* InMoviePipeline);
	static float GetCurrentFocalLength(const class UMovieGraphPipeline* InMovieGraphPipeline, int32 InCameraIndex);
	static float GetCurrentFocusDistance(const class UMovieGraphPipeline* InMovieGraphPipeline, int32 InCameraIndex);
	static void GetCurrentSegmentName(const class UMovieGraphPipeline* InMovieGraphPipeline, class FText* OutOuterName, class FText* OutInnerName);
	static EMovieRenderShotState GetCurrentSegmentState(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FMoviePipelineSegmentWorkMetrics GetCurrentSegmentWorkMetrics(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameNumber GetCurrentShotFrameNumber(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FTimecode GetCurrentShotTimecode(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static int32 GetCurrentVersionNumber(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameRate GetEffectiveFrameRate(class UMovieGraphGlobalOutputSettingNode* InNode, const struct FFrameRate& InDefaultRate);
	static struct FIntPoint GetEffectiveOutputResolution(class UMovieGraphEvaluatedConfig* InEvaluatedGraph, float DefaultOverscan);
	static bool GetEstimatedTimeRemaining(const class UMovieGraphPipeline* InMovieGraphPipeline, struct FTimespan* OutEstimate);
	static class FText GetJobAuthor(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FDateTime GetJobInitializationTime(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static class FText GetJobName(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static void GetOverallOutputFrames(const class UMovieGraphPipeline* InMovieGraphPipeline, int32* OutCurrentIndex, int32* OutTotalCount);
	static void GetOverallSegmentCounts(const class UMovieGraphPipeline* InMovieGraphPipeline, int32* OutCurrentIndex, int32* OutTotalCount);
	static EMovieRenderPipelineState GetPipelineState(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameNumber GetRootFrameNumber(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FTimecode GetRootTimecode(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static bool IsNamedResolutionValid(const class FName& InResolutionProfileName);
	static struct FMovieGraphNamedResolution NamedResolutionFromProfile(const class FName& InResolutionProfileName);
	static struct FMovieGraphNamedResolution NamedResolutionFromSize(const int32 InResX, const int32 InResY);
	static class FString ResolveFilenameFormatArguments(const class FString& InFormatString, const struct FMovieGraphFilenameResolveParams& InParams, struct FMovieGraphResolveArgs* OutMergedFormatArgs);
	static int32 ResolveVersionNumber(const struct FMovieGraphFilenameResolveParams& InParams, const bool bGetNextVersion);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphBlueprintLibrary")
	}
	static class UMovieGraphBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UMovieGraphBlueprintLibrary;

// Class MovieRenderPipelineCore.MovieGraphBranchNode
// 0x0000 (0x00A8 - 0x00A8)
class UMovieGraphBranchNode final : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphBranchNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphBranchNode")
	}
	static class UMovieGraphBranchNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBranchNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphBranchNode;

// Class MovieRenderPipelineCore.MovieGraphConditionGroupQueryBase
// 0x0008 (0x0030 - 0x0028)
class UMovieGraphConditionGroupQueryBase : public UObject
{
public:
	EMovieGraphConditionGroupQueryOpType          OpType;                                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsEnabled;                                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetEnabled(const bool bEnabled);
	void SetOperationType(const EMovieGraphConditionGroupQueryOpType OperationType);

	void Evaluate(const TArray<class AActor*>& InActorsToQuery, const class UWorld* InWorld, TSet<class AActor*>* OutMatchingActors) const;
	EMovieGraphConditionGroupQueryOpType GetOperationType() const;
	bool IsEditorOnlyQuery() const;
	bool IsEnabled() const;
	bool IsFirstConditionGroupQuery() const;
	bool ShouldHidePropertyNames() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphConditionGroupQueryBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphConditionGroupQueryBase")
	}
	static class UMovieGraphConditionGroupQueryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConditionGroupQueryBase>();
	}
};
DUMPER7_ASSERTS_UMovieGraphConditionGroupQueryBase;

// Class MovieRenderPipelineCore.MovieGraphRenderPassNode
// 0x0000 (0x00A8 - 0x00A8)
class UMovieGraphRenderPassNode : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphRenderPassNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphRenderPassNode")
	}
	static class UMovieGraphRenderPassNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRenderPassNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphRenderPassNode;

// Class MovieRenderPipelineCore.MovieGraphConditionGroupQuery_EditorFolder
// 0x0010 (0x0040 - 0x0030)
class UMovieGraphConditionGroupQuery_EditorFolder final : public UMovieGraphConditionGroupQueryBase
{
public:
	TArray<class FName>                           FolderPaths;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphConditionGroupQuery_EditorFolder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphConditionGroupQuery_EditorFolder")
	}
	static class UMovieGraphConditionGroupQuery_EditorFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConditionGroupQuery_EditorFolder>();
	}
};
DUMPER7_ASSERTS_UMovieGraphConditionGroupQuery_EditorFolder;

// Class MovieRenderPipelineCore.MovieGraphWidgetRendererBaseNode
// 0x0078 (0x0120 - 0x00A8)
class UMovieGraphWidgetRendererBaseNode : public UMovieGraphRenderPassNode
{
public:
	uint8                                         bOverride_bCompositeOntoFinalImage : 1;            // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bCompositeOntoFinalImage;                          // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x76];                                      // 0x00AA(0x0076)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphWidgetRendererBaseNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphWidgetRendererBaseNode")
	}
	static class UMovieGraphWidgetRendererBaseNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphWidgetRendererBaseNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphWidgetRendererBaseNode;

// Class MovieRenderPipelineCore.MovieGraphBurnInNode
// 0x0078 (0x0198 - 0x0120)
class UMovieGraphBurnInNode final : public UMovieGraphWidgetRendererBaseNode
{
public:
	uint8                                         bOverride_BurnInClass : 1;                         // 0x0120(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         BurnInClass;                                       // 0x0128(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<TSubclassOf<class UObject>, class UMovieGraphBurnInWidget*> BurnInWidgetInstances;          // 0x0148(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphBurnInNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphBurnInNode")
	}
	static class UMovieGraphBurnInNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBurnInNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphBurnInNode;

// Class MovieRenderPipelineCore.MovieGraphBurnInWidget
// 0x0000 (0x0368 - 0x0368)
class UMovieGraphBurnInWidget final : public UUserWidget
{
public:
	void UpdateForGraph(class UMovieGraphPipeline* InGraphPipeline, class UMovieGraphEvaluatedConfig* InEvaluatedConfig, int32 InCameraIndex, const class FString& CameraName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphBurnInWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphBurnInWidget")
	}
	static class UMovieGraphBurnInWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBurnInWidget>();
	}
};
DUMPER7_ASSERTS_UMovieGraphBurnInWidget;

// Class MovieRenderPipelineCore.MovieGraphCameraSettingNode
// 0x0010 (0x00B8 - 0x00A8)
class UMovieGraphCameraSettingNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_ShutterTiming : 1;                       // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OverscanPercentage : 1;                  // 0x00A8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bRenderAllCameras : 1;                   // 0x00A8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EMoviePipelineShutterTiming                   ShutterTiming;                                     // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverscanPercentage;                                // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRenderAllCameras;                                 // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphCameraSettingNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphCameraSettingNode")
	}
	static class UMovieGraphCameraSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCameraSettingNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphCameraSettingNode;

// Class MovieRenderPipelineCore.MovieGraphConditionGroupQuery_ActorName
// 0x0010 (0x0040 - 0x0030)
class UMovieGraphConditionGroupQuery_ActorName final : public UMovieGraphConditionGroupQueryBase
{
public:
	class FString                                 WildcardSearch;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphConditionGroupQuery_ActorName")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphConditionGroupQuery_ActorName")
	}
	static class UMovieGraphConditionGroupQuery_ActorName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConditionGroupQuery_ActorName>();
	}
};
DUMPER7_ASSERTS_UMovieGraphConditionGroupQuery_ActorName;

// Class MovieRenderPipelineCore.MovieGraphCollectionNode
// 0x0010 (0x00B8 - 0x00A8)
class UMovieGraphCollectionNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_Collection : 1;                          // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieGraphCollection*                  Collection;                                        // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphCollectionNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphCollectionNode")
	}
	static class UMovieGraphCollectionNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCollectionNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphCollectionNode;

// Class MovieRenderPipelineCore.MovieGraphCommandLineEncoderNode
// 0x00A0 (0x0148 - 0x00A8)
class UMovieGraphCommandLineEncoderNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOverride_FileNameFormat : 1;                      // 0x00B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bDeleteSourceFiles : 1;                  // 0x00B0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bSkipEncodeOnRenderCanceled : 1;         // 0x00B0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VideoCodec : 1;                          // 0x00B0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AudioCodec : 1;                          // 0x00B0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OutputFileExtension : 1;                 // 0x00B0(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CommandLineFormat : 1;                   // 0x00B0(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VideoInputStringFormat : 1;              // 0x00B0(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AudioInputStringFormat : 1;              // 0x00B1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_EncodeSettings : 1;                      // 0x00B1(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bRetainInputTextFiles : 1;               // 0x00B1(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FileNameFormat;                                    // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteSourceFiles;                                // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipEncodeOnRenderCanceled;                       // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VideoCodec;                                        // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioCodec;                                        // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputFileExtension;                               // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CommandLineFormat;                                 // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoInputStringFormat;                            // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioInputStringFormat;                            // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings;                                    // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRetainInputTextFiles;                             // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphCommandLineEncoderNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphCommandLineEncoderNode")
	}
	static class UMovieGraphCommandLineEncoderNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCommandLineEncoderNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphCommandLineEncoderNode;

// Class MovieRenderPipelineCore.MovieGraphValueContainer
// 0x0018 (0x0040 - 0x0028)
class UMovieGraphValueContainer : public UObject
{
public:
	class FName                                   PropertyName;                                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  Value;                                             // 0x0030(0x0010)(Edit, NativeAccessSpecifierPrivate)

public:
	class FString GetValueSerializedString();
	bool SetValueBool(const bool bInValue);
	bool SetValueByte(const uint8 InValue);
	bool SetValueClass(class UClass* InValue);
	void SetValueContainerType(EMovieGraphContainerType ContainerType);
	bool SetValueDouble(const double InValue);
	bool SetValueEnum(const uint8 InValue, const class UEnum* Enum);
	bool SetValueFloat(const float InValue);
	bool SetValueInt32(const int32 InValue);
	bool SetValueInt64(const int64 InValue);
	bool SetValueName(const class FName InValue);
	bool SetValueObject(class UObject* InValue);
	bool SetValueSerializedString(const class FString& NewValue);
	bool SetValueString(const class FString& InValue);
	bool SetValueText(const class FText& InValue);
	void SetValueType(EMovieGraphValueType ValueType, class UObject* InValueTypeObject);
	void SetValueTypeObject(const class UObject* ValueTypeObject);

	bool GetValueBool(bool* bOutValue) const;
	bool GetValueByte(uint8* OutValue) const;
	bool GetValueClass(class UClass** OutValue) const;
	EMovieGraphContainerType GetValueContainerType() const;
	bool GetValueDouble(double* OutValue) const;
	bool GetValueEnum(uint8* OutValue, const class UEnum* RequestedEnum) const;
	bool GetValueFloat(float* OutValue) const;
	bool GetValueInt32(int32* OutValue) const;
	bool GetValueInt64(int64* OutValue) const;
	bool GetValueName(class FName* OutValue) const;
	bool GetValueObject(class UObject* OutValue, const class UClass* RequestedClass) const;
	bool GetValueString(class FString* OutValue) const;
	bool GetValueText(class FText* OutValue) const;
	EMovieGraphValueType GetValueType() const;
	const class UObject* GetValueTypeObject() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphValueContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphValueContainer")
	}
	static class UMovieGraphValueContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphValueContainer>();
	}
};
DUMPER7_ASSERTS_UMovieGraphValueContainer;

// Class MovieRenderPipelineCore.MovieGraphConditionGroupQuery_Sublevel
// 0x0010 (0x0040 - 0x0030)
class UMovieGraphConditionGroupQuery_Sublevel final : public UMovieGraphConditionGroupQueryBase
{
public:
	TArray<TSoftObjectPtr<class UWorld>>          Sublevels;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphConditionGroupQuery_Sublevel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphConditionGroupQuery_Sublevel")
	}
	static class UMovieGraphConditionGroupQuery_Sublevel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConditionGroupQuery_Sublevel>();
	}
};
DUMPER7_ASSERTS_UMovieGraphConditionGroupQuery_Sublevel;

// Class MovieRenderPipelineCore.MovieGraphMember
// 0x0038 (0x0078 - 0x0040)
class UMovieGraphMember : public UMovieGraphValueContainer
{
public:
	class FString                                 Description;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0050(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Guid;                                              // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEditable;                                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool SetMemberName(const class FString& InNewName);

	const struct FGuid GetGuid() const;
	class FString GetMemberName() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphMember")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphMember")
	}
	static class UMovieGraphMember* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphMember>();
	}
};
DUMPER7_ASSERTS_UMovieGraphMember;

// Class MovieRenderPipelineCore.MovieGraphVariable
// 0x0010 (0x0088 - 0x0078)
class UMovieGraphVariable : public UMovieGraphMember
{
public:
	class FString                                 Category;                                          // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphVariable")
	}
	static class UMovieGraphVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphVariable>();
	}
};
DUMPER7_ASSERTS_UMovieGraphVariable;

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable
// 0x0000 (0x0088 - 0x0088)
class UMovieGraphGlobalVariable : public UMovieGraphVariable
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphGlobalVariable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphGlobalVariable")
	}
	static class UMovieGraphGlobalVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable>();
	}
};
DUMPER7_ASSERTS_UMovieGraphGlobalVariable;

// Class MovieRenderPipelineCore.MovieGraphConditionGroupQuery_ComponentTagName
// 0x0010 (0x0040 - 0x0030)
class UMovieGraphConditionGroupQuery_ComponentTagName final : public UMovieGraphConditionGroupQueryBase
{
public:
	class FString                                 TagsToMatch;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphConditionGroupQuery_ComponentTagName")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphConditionGroupQuery_ComponentTagName")
	}
	static class UMovieGraphConditionGroupQuery_ComponentTagName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConditionGroupQuery_ComponentTagName>();
	}
};
DUMPER7_ASSERTS_UMovieGraphConditionGroupQuery_ComponentTagName;

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_ShotName
// 0x0000 (0x0088 - 0x0088)
class UMovieGraphGlobalVariable_ShotName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphGlobalVariable_ShotName")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphGlobalVariable_ShotName")
	}
	static class UMovieGraphGlobalVariable_ShotName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_ShotName>();
	}
};
DUMPER7_ASSERTS_UMovieGraphGlobalVariable_ShotName;

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_SequenceName
// 0x0000 (0x0088 - 0x0088)
class UMovieGraphGlobalVariable_SequenceName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphGlobalVariable_SequenceName")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphGlobalVariable_SequenceName")
	}
	static class UMovieGraphGlobalVariable_SequenceName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_SequenceName>();
	}
};
DUMPER7_ASSERTS_UMovieGraphGlobalVariable_SequenceName;

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_FrameNumber
// 0x0000 (0x0088 - 0x0088)
class UMovieGraphGlobalVariable_FrameNumber final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphGlobalVariable_FrameNumber")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphGlobalVariable_FrameNumber")
	}
	static class UMovieGraphGlobalVariable_FrameNumber* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_FrameNumber>();
	}
};
DUMPER7_ASSERTS_UMovieGraphGlobalVariable_FrameNumber;

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_CameraName
// 0x0000 (0x0088 - 0x0088)
class UMovieGraphGlobalVariable_CameraName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphGlobalVariable_CameraName")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphGlobalVariable_CameraName")
	}
	static class UMovieGraphGlobalVariable_CameraName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_CameraName>();
	}
};
DUMPER7_ASSERTS_UMovieGraphGlobalVariable_CameraName;

// Class MovieRenderPipelineCore.MovieGraphInterfaceBase
// 0x0008 (0x0080 - 0x0078)
class UMovieGraphInterfaceBase : public UMovieGraphMember
{
public:
	bool                                          bIsBranch;                                         // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphInterfaceBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphInterfaceBase")
	}
	static class UMovieGraphInterfaceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInterfaceBase>();
	}
};
DUMPER7_ASSERTS_UMovieGraphInterfaceBase;

// Class MovieRenderPipelineCore.MovieGraphInput
// 0x0000 (0x0080 - 0x0080)
class UMovieGraphInput final : public UMovieGraphInterfaceBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphInput")
	}
	static class UMovieGraphInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInput>();
	}
};
DUMPER7_ASSERTS_UMovieGraphInput;

// Class MovieRenderPipelineCore.MovieGraphMetadataAttributeCollection
// 0x0018 (0x0040 - 0x0028)
class UMovieGraphMetadataAttributeCollection final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMovieGraphMetadataAttribute>   MetadataAttributes;                                // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphMetadataAttributeCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphMetadataAttributeCollection")
	}
	static class UMovieGraphMetadataAttributeCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphMetadataAttributeCollection>();
	}
};
DUMPER7_ASSERTS_UMovieGraphMetadataAttributeCollection;

// Class MovieRenderPipelineCore.MovieGraphOutput
// 0x0000 (0x0080 - 0x0080)
class UMovieGraphOutput final : public UMovieGraphInterfaceBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphOutput")
	}
	static class UMovieGraphOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphOutput>();
	}
};
DUMPER7_ASSERTS_UMovieGraphOutput;

// Class MovieRenderPipelineCore.MovieGraphEvaluatedConfig
// 0x0050 (0x0078 - 0x0028)
class UMovieGraphEvaluatedConfig final : public UObject
{
public:
	TMap<class FName, struct FMovieGraphEvaluatedBranchConfig> BranchConfigMapping;                  // 0x0028(0x0050)(Transient, NativeAccessSpecifierPublic)

public:
	const TArray<class FName> GetBranchNames() const;
	class UMovieGraphSettingNode* GetSettingForBranch(class UClass* InClass, const class FName InBranchName, bool bIncludeCDOs, bool bExactMatch) const;
	TArray<class UMovieGraphSettingNode*> GetSettingsForBranch(class UClass* InClass, const class FName InBranchName, bool bIncludeCDOs, bool bExactMatch) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphEvaluatedConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphEvaluatedConfig")
	}
	static class UMovieGraphEvaluatedConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEvaluatedConfig>();
	}
};
DUMPER7_ASSERTS_UMovieGraphEvaluatedConfig;

// Class MovieRenderPipelineCore.MovieGraphCollection
// 0x0020 (0x0048 - 0x0028)
class UMovieGraphCollection final : public UObject
{
public:
	class FString                                 CollectionName;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphConditionGroup*>      ConditionGroups;                                   // 0x0038(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	class UMovieGraphConditionGroup* AddConditionGroup();
	bool MoveConditionGroupToIndex(class UMovieGraphConditionGroup* InConditionGroup, const int32 NewIndex);
	bool RemoveConditionGroup(class UMovieGraphConditionGroup* InConditionGroup);
	void SetCollectionName(const class FString& InName);

	TSet<class AActor*> Evaluate(const class UWorld* InWorld) const;
	class FString GetCollectionName() const;
	const TArray<class UMovieGraphConditionGroup*> GetConditionGroups() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphCollection")
	}
	static class UMovieGraphCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCollection>();
	}
};
DUMPER7_ASSERTS_UMovieGraphCollection;

// Class MovieRenderPipelineCore.MovieGraphTraversableObject
// 0x0000 (0x0000 - 0x0000)
class IMovieGraphTraversableObject final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphTraversableObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphTraversableObject")
	}
	static class IMovieGraphTraversableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieGraphTraversableObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieGraphTraversableObject;

// Class MovieRenderPipelineCore.MovieGraphConfig
// 0x0060 (0x0088 - 0x0028)
class UMovieGraphConfig final : public UObject
{
public:
	TArray<class UMovieGraphNode*>                AllNodes;                                          // 0x0028(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UMovieGraphNode*                        InputNode;                                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UMovieGraphNode*                        OutputNode;                                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class UMovieGraphVariable*>            Variables;                                         // 0x0048(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UMovieGraphGlobalVariable*>      GlobalVariables;                                   // 0x0058(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UMovieGraphInput*>               Inputs;                                            // 0x0068(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UMovieGraphOutput*>              Outputs;                                           // 0x0078(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	class UMovieGraphInput* AddInput(const class FText& InBaseName);
	bool AddLabeledEdge(class UMovieGraphNode* FromNode, const class FName& FromPinLabel, class UMovieGraphNode* ToNode, const class FName& ToPinLabel);
	class UMovieGraphOutput* AddOutput(const class FText& InBaseName);
	class UMovieGraphVariable* AddVariable(const class FName InCustomBaseName);
	class UMovieGraphEvaluatedConfig* CreateFlattenedGraph(const struct FMovieGraphTraversalContext& InContext, class FString* OutError);
	class UMovieGraphNode* CreateNodeByClass(const TSubclassOf<class UMovieGraphNode> InClass);
	bool DeleteMember(class UMovieGraphMember* MemberToDelete);
	bool RemoveAllInboundEdges(class UMovieGraphNode* InNode);
	bool RemoveAllOutboundEdges(class UMovieGraphNode* InNode);
	bool RemoveInboundEdges(class UMovieGraphNode* InNode, const class FName& InPinName);
	bool RemoveLabeledEdge(class UMovieGraphNode* FromNode, const class FName& FromPinName, class UMovieGraphNode* ToNode, const class FName& ToPinName);
	bool RemoveNode(class UMovieGraphNode* InNode);
	bool RemoveNodes(const TArray<class UMovieGraphNode*>& InNodes);
	bool RemoveOutboundEdges(class UMovieGraphNode* InNode, const class FName& InPinName);
	void UpdateGlobalVariableValues(const class UMovieGraphPipeline* InPipeline);

	class UMovieGraphNode* GetInputNode() const;
	TArray<class UMovieGraphInput*> GetInputs() const;
	class UMovieGraphNode* GetOutputNode() const;
	TArray<class UMovieGraphOutput*> GetOutputs() const;
	TArray<class UMovieGraphVariable*> GetVariables(const bool bIncludeGlobal) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphConfig")
	}
	static class UMovieGraphConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConfig>();
	}
};
DUMPER7_ASSERTS_UMovieGraphConfig;

// Class MovieRenderPipelineCore.MovieGraphTimeStepBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphTimeStepBase : public UObject
{
public:
	struct FMovieGraphTimeStepData GetCalculatedTimeData() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphTimeStepBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphTimeStepBase")
	}
	static class UMovieGraphTimeStepBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphTimeStepBase>();
	}
};
DUMPER7_ASSERTS_UMovieGraphTimeStepBase;

// Class MovieRenderPipelineCore.MovieGraphCoreTimeStep
// 0x0158 (0x0180 - 0x0028)
class UMovieGraphCoreTimeStep : public UMovieGraphTimeStepBase
{
public:
	struct FMovieGraphTimeStepData                CurrentTimeStepData;                               // 0x0028(0x0078)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0xE0];                                      // 0x00A0(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphCoreTimeStep")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphCoreTimeStep")
	}
	static class UMovieGraphCoreTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCoreTimeStep>();
	}
};
DUMPER7_ASSERTS_UMovieGraphCoreTimeStep;

// Class MovieRenderPipelineCore.MovieGraphEngineTimeStep
// 0x0018 (0x0040 - 0x0028)
class UMovieGraphEngineTimeStep final : public UEngineCustomTimeStep
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphEngineTimeStep")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphEngineTimeStep")
	}
	static class UMovieGraphEngineTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEngineTimeStep>();
	}
};
DUMPER7_ASSERTS_UMovieGraphEngineTimeStep;

// Class MovieRenderPipelineCore.MovieGraphRendererBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphRendererBase : public UObject
{
public:
	TArray<struct FMovieGraphImagePreviewData> GetPreviewData() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphRendererBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphRendererBase")
	}
	static class UMovieGraphRendererBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRendererBase>();
	}
};
DUMPER7_ASSERTS_UMovieGraphRendererBase;

// Class MovieRenderPipelineCore.MovieGraphDataSourceBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphDataSourceBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphDataSourceBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphDataSourceBase")
	}
	static class UMovieGraphDataSourceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDataSourceBase>();
	}
};
DUMPER7_ASSERTS_UMovieGraphDataSourceBase;

// Class MovieRenderPipelineCore.MovieGraphRemoveRenderSettingNode
// 0x0008 (0x00B0 - 0x00A8)
class UMovieGraphRemoveRenderSettingNode final : public UMovieGraphNode
{
public:
	TSubclassOf<class UMovieGraphSettingNode>     NodeType;                                          // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphRemoveRenderSettingNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphRemoveRenderSettingNode")
	}
	static class UMovieGraphRemoveRenderSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRemoveRenderSettingNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphRemoveRenderSettingNode;

// Class MovieRenderPipelineCore.MovieGraphAudioRendererBase
// 0x0030 (0x0058 - 0x0028)
class UMovieGraphAudioRendererBase : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphAudioRendererBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphAudioRendererBase")
	}
	static class UMovieGraphAudioRendererBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphAudioRendererBase>();
	}
};
DUMPER7_ASSERTS_UMovieGraphAudioRendererBase;

// Class MovieRenderPipelineCore.MovieGraphSequenceDataSource
// 0x0028 (0x0050 - 0x0028)
class UMovieGraphSequenceDataSource final : public UMovieGraphDataSourceBase
{
public:
	class ALevelSequenceActor*                    LevelSequenceActor;                                // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphSequenceDataSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphSequenceDataSource")
	}
	static class UMovieGraphSequenceDataSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSequenceDataSource>();
	}
};
DUMPER7_ASSERTS_UMovieGraphSequenceDataSource;

// Class MovieRenderPipelineCore.MovieGraphDebugSettingNode
// 0x0018 (0x00C0 - 0x00A8)
class UMovieGraphDebugSettingNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_bCaptureFramesWithRenderDoc : 1;         // 0x00A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bCaptureUnrealInsightsTrace : 1;         // 0x00A8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_UnrealInsightsTraceFileNameFormat : 1;   // 0x00A8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bCaptureFramesWithRenderDoc;                       // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureUnrealInsightsTrace;                       // 0x00AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UnrealInsightsTraceFileNameFormat;                 // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphDebugSettingNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphDebugSettingNode")
	}
	static class UMovieGraphDebugSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDebugSettingNode>();
	}
};
DUMPER7_ASSERTS_UMovieGraphDebugSettingNode;

// Class MovieRenderPipelineCore.MovieGraphConditionGroupQuery_ActorType
// 0x0020 (0x0050 - 0x0030)
class UMovieGraphConditionGroupQuery_ActorType final : public UMovieGraphConditionGroupQueryBase
{
public:
	TArray<TSubclassOf<class UObject>>            ActorTypes;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphConditionGroupQuery_ActorType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphConditionGroupQuery_ActorType")
	}
	static class UMovieGraphConditionGroupQuery_ActorType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConditionGroupQuery_ActorType>();
	}
};
DUMPER7_ASSERTS_UMovieGraphConditionGroupQuery_ActorType;

// Class MovieRenderPipelineCore.MovieGraphDefaultAudioRenderer
// 0x0000 (0x0058 - 0x0058)
class UMovieGraphDefaultAudioRenderer final : public UMovieGraphAudioRendererBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieGraphDefaultAudioRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieGraphDefaultAudioRenderer")
	}
	static class UMovieGraphDefaultAudioRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDefaultAudioRenderer>();
	}
};
DUMPER7_ASSERTS_UMovieGraphDefaultAudioRenderer;

// Class MovieRenderPipelineCore.MovieGraphDefaultRenderer
// 0x01E8 (0x0210 - 0x0028)
class UMovieGraphDefaultRenderer final : public UMovieGraphRendererBase
{
public:
	TArray<class UMovieGraphRenderPassNode*>      RenderPassesInUse;                                 // 0x0028(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
