#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieScene

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UniversalObjectLocator_structs.hpp"


namespace SDK
{

// Enum MovieScene.EMovieSceneKeyInterpolation
// NumValues: 0x0007
enum class EMovieSceneKeyInterpolation : uint8
{
	Auto                                     = 0,
	User                                     = 1,
	Break                                    = 2,
	Linear                                   = 3,
	Constant                                 = 4,
	SmartAuto                                = 5,
	EMovieSceneKeyInterpolation_MAX          = 6,
};

// Enum MovieScene.EMovieSceneCompletionMode
// NumValues: 0x0004
enum class EMovieSceneCompletionMode : uint8
{
	KeepState                                = 0,
	RestoreState                             = 1,
	ProjectDefault                           = 2,
	EMovieSceneCompletionMode_MAX            = 3,
};

// Enum MovieScene.EMovieSceneConditionScope
// NumValues: 0x0004
enum class EMovieSceneConditionScope : uint8
{
	Global                                   = 0,
	Binding                                  = 1,
	OwnerObject                              = 2,
	EMovieSceneConditionScope_MAX            = 3,
};

// Enum MovieScene.EMovieSceneConditionCheckFrequency
// NumValues: 0x0003
enum class EMovieSceneConditionCheckFrequency : uint8
{
	Once                                     = 0,
	OnTick                                   = 1,
	EMovieSceneConditionCheckFrequency_MAX   = 2,
};

// Enum MovieScene.EMovieScenePlayerStatus
// NumValues: 0x0007
enum class EMovieScenePlayerStatus : uint8
{
	Stopped                                  = 0,
	Playing                                  = 1,
	Scrubbing                                = 2,
	Jumping                                  = 3,
	Stepping                                 = 4,
	Paused                                   = 5,
	MAX                                      = 6,
};

// Enum MovieScene.EMovieSceneEvaluationType
// NumValues: 0x0003
enum class EMovieSceneEvaluationType : uint8
{
	FrameLocked                              = 0,
	WithSubFrames                            = 1,
	EMovieSceneEvaluationType_MAX            = 2,
};

// Enum MovieScene.EUpdateClockSource
// NumValues: 0x0008
enum class EUpdateClockSource : uint8
{
	Tick                                     = 0,
	Platform                                 = 1,
	Audio                                    = 2,
	RelativeTimecode                         = 3,
	Timecode                                 = 4,
	PlayEveryFrame                           = 5,
	Custom                                   = 6,
	EUpdateClockSource_MAX                   = 7,
};

// Enum MovieScene.EMovieSceneSequenceFlags
// NumValues: 0x0006
enum class EMovieSceneSequenceFlags : uint8
{
	None                                     = 0,
	Volatile                                 = 1,
	BlockingEvaluation                       = 2,
	DynamicWeighting                         = 4,
	InheritedFlags                           = 1,
	EMovieSceneSequenceFlags_MAX             = 8,
};

// Enum MovieScene.EMovieSceneServerClientMask
// NumValues: 0x0005
enum class EMovieSceneServerClientMask : uint8
{
	None                                     = 0,
	Server                                   = 1,
	Client                                   = 2,
	All                                      = 3,
	EMovieSceneServerClientMask_MAX          = 4,
};

// Enum MovieScene.EMovieSceneGroupConditionOperator
// NumValues: 0x0004
enum class EMovieSceneGroupConditionOperator : uint8
{
	And                                      = 0,
	Or                                       = 1,
	Xor                                      = 2,
	EMovieSceneGroupConditionOperator_MAX    = 3,
};

// Enum MovieScene.EMovieSceneSubSectionFlags
// NumValues: 0x0007
enum class EMovieSceneSubSectionFlags : uint8
{
	None                                     = 0,
	OverrideKeepState                        = 1,
	OverrideRestoreState                     = 2,
	IgnoreHierarchicalBias                   = 4,
	BlendHierarchicalBias                    = 8,
	AnyRestoreStateOverride                  = 3,
	EMovieSceneSubSectionFlags_MAX           = 16,
};

// Enum MovieScene.ESectionEvaluationFlags
// NumValues: 0x0006
enum class ESectionEvaluationFlags : uint8
{
	None                                     = 0,
	PreRoll                                  = 1,
	PostRoll                                 = 2,
	ForceKeepState                           = 4,
	ForceRestoreState                        = 8,
	ESectionEvaluationFlags_MAX              = 9,
};

// Enum MovieScene.EMovieSceneCompletionModeOverride
// NumValues: 0x0004
enum class EMovieSceneCompletionModeOverride : uint8
{
	None                                     = 0,
	ForceKeepState                           = 1,
	ForceRestoreState                        = 2,
	EMovieSceneCompletionModeOverride_MAX    = 3,
};

// Enum MovieScene.EMovieSceneTimeUnit
// NumValues: 0x0003
enum class EMovieSceneTimeUnit : uint8
{
	DisplayRate                              = 0,
	TickResolution                           = 1,
	EMovieSceneTimeUnit_MAX                  = 2,
};

// Enum MovieScene.EMovieSceneTimeWarpType
// NumValues: 0x0009
enum class EMovieSceneTimeWarpType : uint8
{
	FixedPlayRate                            = 0,
	Custom                                   = 1,
	FixedTime                                = 2,
	FrameRate                                = 3,
	Loop                                     = 4,
	Clamp                                    = 5,
	LoopFloat                                = 6,
	ClampFloat                               = 7,
	EMovieSceneTimeWarpType_MAX              = 8,
};

// Enum MovieScene.EMovieSceneSequenceCompilerMask
// NumValues: 0x0006
enum class EMovieSceneSequenceCompilerMask : uint8
{
	Hierarchy                                = 1,
	EvaluationTemplate                       = 2,
	EvaluationTemplateField                  = 4,
	EntityComponentField                     = 8,
	None                                     = 0,
	EMovieSceneSequenceCompilerMask_MAX      = 16,
};

// Enum MovieScene.EMovieSceneBlendType
// NumValues: 0x0007
enum class EMovieSceneBlendType : uint8
{
	Invalid                                  = 0,
	Absolute                                 = 1,
	Additive                                 = 2,
	Relative                                 = 4,
	AdditiveFromBase                         = 8,
	Override                                 = 16,
	EMovieSceneBlendType_MAX                 = 17,
};

// Enum MovieScene.EEvaluationMethod
// NumValues: 0x0003
enum class EEvaluationMethod : uint8
{
	Static                                   = 0,
	Swept                                    = 1,
	EEvaluationMethod_MAX                    = 2,
};

// Enum MovieScene.EMovieSceneBreadcrumbMode
// NumValues: 0x0003
enum class EMovieSceneBreadcrumbMode : uint8
{
	Sparse                                   = 0,
	Dense                                    = 1,
	EMovieSceneBreadcrumbMode_MAX            = 2,
};

// Enum MovieScene.EMovieSceneBuiltInEasing
// NumValues: 0x001A
enum class EMovieSceneBuiltInEasing : uint8
{
	Linear                                   = 0,
	SinIn                                    = 1,
	SinOut                                   = 2,
	SinInOut                                 = 3,
	QuadIn                                   = 4,
	QuadOut                                  = 5,
	QuadInOut                                = 6,
	Cubic                                    = 7,
	CubicIn                                  = 8,
	CubicOut                                 = 9,
	CubicInOut                               = 10,
	HermiteCubicInOut                        = 11,
	QuartIn                                  = 12,
	QuartOut                                 = 13,
	QuartInOut                               = 14,
	QuintIn                                  = 15,
	QuintOut                                 = 16,
	QuintInOut                               = 17,
	ExpoIn                                   = 18,
	ExpoOut                                  = 19,
	ExpoInOut                                = 20,
	CircIn                                   = 21,
	CircOut                                  = 22,
	CircInOut                                = 23,
	Custom                                   = 24,
	EMovieSceneBuiltInEasing_MAX             = 25,
};

// Enum MovieScene.EMovieSceneObjectBindingSpace
// NumValues: 0x0004
enum class EMovieSceneObjectBindingSpace : uint8
{
	Local                                    = 0,
	Root                                     = 1,
	Unused                                   = 2,
	EMovieSceneObjectBindingSpace_MAX        = 3,
};

// Enum MovieScene.EUpdatePositionMethod
// NumValues: 0x0004
enum class EUpdatePositionMethod : uint8
{
	Play                                     = 0,
	Jump                                     = 1,
	Scrub                                    = 2,
	EUpdatePositionMethod_MAX                = 3,
};

// Enum MovieScene.EMovieScenePositionType
// NumValues: 0x0005
enum class EMovieScenePositionType : uint8
{
	Frame                                    = 0,
	Time                                     = 1,
	MarkedFrame                              = 2,
	Timecode                                 = 3,
	EMovieScenePositionType_MAX              = 4,
};

// Enum MovieScene.ESpawnOwnership
// NumValues: 0x0004
enum class ESpawnOwnership : uint8
{
	InnerSequence                            = 0,
	RootSequence                             = 1,
	External                                 = 2,
	ESpawnOwnership_MAX                      = 3,
};

// ScriptStruct MovieScene.MovieSceneTrackInstanceInput
// 0x0010 (0x0010 - 0x0000)
struct FMovieSceneTrackInstanceInput final
{
public:
	class UMovieSceneSection*                     Section;                                           // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneTrackInstanceInput;

// ScriptStruct MovieScene.ActorForWorldTransforms
// 0x0018 (0x0018 - 0x0000)
struct FActorForWorldTransforms final
{
public:
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         Component;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FActorForWorldTransforms;

// ScriptStruct MovieScene.MovieSceneDeterminismFence
// 0x0008 (0x0008 - 0x0000)
struct FMovieSceneDeterminismFence final
{
public:
	struct FFrameNumber                           FrameNumber;                                       // 0x0000(0x0004)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInclusive : 1;                                    // 0x0004(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneDeterminismFence;

// ScriptStruct MovieScene.MovieSceneDeterminismData
// 0x0018 (0x0018 - 0x0000)
struct FMovieSceneDeterminismData final
{
public:
	TArray<struct FMovieSceneDeterminismFence>    Fences;                                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bParentSequenceRequiresLowerFence;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bParentSequenceRequiresUpperFence;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneDeterminismData;

// ScriptStruct MovieScene.MovieSceneBindingProxy
// 0x0018 (0x0018 - 0x0000)
struct FMovieSceneBindingProxy final
{
public:
	struct FGuid                                  BindingID;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMovieSceneSequence*                    Sequence;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FMovieSceneBindingProxy;

// ScriptStruct MovieScene.MovieSceneConditionContext
// 0x0030 (0x0030 - 0x0000)
struct FMovieSceneConditionContext final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FMovieSceneBindingProxy                Binding;                                           // 0x0008(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        BoundObjects;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FMovieSceneConditionContext;

// ScriptStruct MovieScene.MovieSceneConditionContainer
// 0x0008 (0x0008 - 0x0000)
struct FMovieSceneConditionContainer final
{
public:
	class UMovieSceneCondition*                   Condition;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FMovieSceneConditionContainer;

// ScriptStruct MovieScene.MovieSceneBindingResolveResult
// 0x0008 (0x0008 - 0x0000)
struct FMovieSceneBindingResolveResult final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FMovieSceneBindingResolveResult;

// ScriptStruct MovieScene.MovieSceneBindingResolveContext
// 0x0020 (0x0020 - 0x0000)
struct FMovieSceneBindingResolveContext final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FMovieSceneBindingProxy                Binding;                                           // 0x0008(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneBindingResolveContext;

// ScriptStruct MovieScene.MovieSceneEmptyStruct
// 0x0001 (0x0001 - 0x0000)
struct FMovieSceneEmptyStruct final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneEmptyStruct;

// ScriptStruct MovieScene.MovieSceneEvalTemplateBase
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FMovieSceneEvalTemplateBase
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneEvalTemplateBase;

// ScriptStruct MovieScene.MovieSceneSequenceID
// 0x0004 (0x0004 - 0x0000)
struct FMovieSceneSequenceID final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneSequenceID;

// ScriptStruct MovieScene.MovieSceneTrackIdentifier
// 0x0004 (0x0004 - 0x0000)
struct FMovieSceneTrackIdentifier final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneTrackIdentifier;

// ScriptStruct MovieScene.MovieSceneEvaluationKey
// 0x000C (0x000C - 0x0000)
struct FMovieSceneEvaluationKey final
{
public:
	struct FMovieSceneSequenceID                  SequenceID;                                        // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneTrackIdentifier             TrackIdentifier;                                   // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SectionIndex;                                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneEvaluationKey;

// ScriptStruct MovieScene.MovieSceneEvalTemplate
// 0x0010 (0x0020 - 0x0010)
struct FMovieSceneEvalTemplate : public FMovieSceneEvalTemplateBase
{
public:
	EMovieSceneCompletionMode                     CompletionMode;                                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UMovieSceneSection>      SourceSectionPtr;                                  // 0x0014(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneEvalTemplate;

// ScriptStruct MovieScene.TestMovieSceneEvalTemplate
// 0x0000 (0x0020 - 0x0020)
struct FTestMovieSceneEvalTemplate final : public FMovieSceneEvalTemplate
{
};
DUMPER7_ASSERTS_FTestMovieSceneEvalTemplate;

// ScriptStruct MovieScene.MovieSceneEvaluationOperand
// 0x0014 (0x0014 - 0x0000)
struct FMovieSceneEvaluationOperand final
{
public:
	struct FGuid                                  ObjectBindingID;                                   // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneSequenceID                  SequenceID;                                        // 0x0010(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneEvaluationOperand;

// ScriptStruct MovieScene.MovieSceneKeyStruct
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FMovieSceneKeyStruct
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneKeyStruct;

// ScriptStruct MovieScene.GeneratedMovieSceneKeyStruct
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x10) FGeneratedMovieSceneKeyStruct final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneratedMovieSceneKeyStruct;

// ScriptStruct MovieScene.MovieSceneKeyTimeStruct
// 0x0020 (0x0028 - 0x0008)
struct FMovieSceneKeyTimeStruct final : public FMovieSceneKeyStruct
{
public:
	struct FFrameNumber                           Time;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x1C];                                       // 0x000C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneKeyTimeStruct;

// ScriptStruct MovieScene.MovieSceneTrackEvaluationFieldEntry
// 0x0020 (0x0020 - 0x0000)
struct FMovieSceneTrackEvaluationFieldEntry final
{
public:
	class UMovieSceneSection*                     Section;                                           // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FFrameNumberRange                      Range;                                             // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           ForcedTime;                                        // 0x0018(0x0004)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESectionEvaluationFlags                       Flags;                                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x1];                                       // 0x001D(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         LegacySortOrder;                                   // 0x001E(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneTrackEvaluationFieldEntry;

// ScriptStruct MovieScene.MovieSceneTrackEvaluationField
// 0x0010 (0x0010 - 0x0000)
struct FMovieSceneTrackEvaluationField final
{
public:
	TArray<struct FMovieSceneTrackEvaluationFieldEntry> Entries;                                     // 0x0000(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneTrackEvaluationField;

// ScriptStruct MovieScene.MovieSceneNumericVariant
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FMovieSceneNumericVariant final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneNumericVariant;

// ScriptStruct MovieScene.MovieScenePropertyBinding
// 0x0014 (0x0014 - 0x0000)
struct FMovieScenePropertyBinding final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyPath;                                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanUseClassLookup;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieScenePropertyBinding;

// ScriptStruct MovieScene.MovieSceneTimeWarpVariant
// 0x0008 (0x0008 - 0x0000)
struct FMovieSceneTimeWarpVariant final
{
public:
	struct FMovieSceneNumericVariant              Variant;                                           // 0x0000(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneTimeWarpVariant;

// ScriptStruct MovieScene.MovieSceneSectionParameters
// 0x0030 (0x0030 - 0x0000)
struct FMovieSceneSectionParameters final
{
public:
	struct FFrameNumber                           StartFrameOffset;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanLoop;                                          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameNumber                           EndFrameOffset;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           FirstLoopStartFrameOffset;                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneTimeWarpVariant             TimeScale;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         HierarchicalBias;                                  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieSceneSubSectionFlags                    Flags;                                             // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartOffset;                                       // 0x0020(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PrerollTime;                                       // 0x0024(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PostrollTime;                                      // 0x0028(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneSectionParameters;

// ScriptStruct MovieScene.MovieSceneSectionTimingParametersSeconds
// 0x0018 (0x0018 - 0x0000)
struct FMovieSceneSectionTimingParametersSeconds final
{
public:
	struct FMovieSceneTimeWarpVariant             PlayRate;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InnerStartOffset;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerEndOffset;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FirstLoopStartOffset;                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bLoop : 1;                                         // 0x0014(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bClamp : 1;                                        // 0x0014(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReverse : 1;                                      // 0x0014(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneSectionTimingParametersSeconds;

// ScriptStruct MovieScene.MovieSceneSectionTimingParametersFrames
// 0x0018 (0x0018 - 0x0000)
struct FMovieSceneSectionTimingParametersFrames final
{
public:
	struct FMovieSceneTimeWarpVariant             PlayRate;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FFrameNumber                           InnerStartOffset;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           InnerEndOffset;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           FirstLoopStartOffset;                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bLoop : 1;                                         // 0x0014(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bClamp : 1;                                        // 0x0014(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReverse : 1;                                      // 0x0014(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneSectionTimingParametersFrames;

// ScriptStruct MovieScene.MovieSceneTrackRowMetadata
// 0x0008 (0x0008 - 0x0000)
struct FMovieSceneTrackRowMetadata final
{
public:
	struct FMovieSceneConditionContainer          ConditionContainer;                                // 0x0000(0x0008)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneTrackRowMetadata;

// ScriptStruct MovieScene.MovieSceneSegmentIdentifier
// 0x0004 (0x0004 - 0x0000)
struct FMovieSceneSegmentIdentifier final
{
public:
	int32                                         IdentifierIndex;                                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneSegmentIdentifier;

// ScriptStruct MovieScene.SectionEvaluationData
// 0x000C (0x000C - 0x0000)
struct FSectionEvaluationData final
{
public:
	int32                                         ImplIndex;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           ForcedTime;                                        // 0x0004(0x0004)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESectionEvaluationFlags                       Flags;                                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSectionEvaluationData;

// ScriptStruct MovieScene.MovieSceneSegment
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FMovieSceneSegment final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneSegment;

// ScriptStruct MovieScene.MovieSceneSequenceLoopCount
// 0x0004 (0x0004 - 0x0000)
struct FMovieSceneSequenceLoopCount final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneSequenceLoopCount;

// ScriptStruct MovieScene.MovieSceneSequenceTickInterval
// 0x000C (0x000C - 0x0000)
struct FMovieSceneSequenceTickInterval final
{
public:
	float                                         TickIntervalSeconds;                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EvaluationBudgetMicroseconds;                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTickWhenPaused;                                   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRounding;                                    // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneSequenceTickInterval;

// ScriptStruct MovieScene.MovieSceneSequencePlaybackSettings
// 0x0028 (0x0028 - 0x0000)
struct FMovieSceneSequencePlaybackSettings final
{
public:
	uint8                                         bAutoPlay : 1;                                     // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequenceLoopCount           LoopCount;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovieSceneSequenceTickInterval        TickInterval;                                      // 0x0008(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRandomStartTime : 1;                              // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableMovementInput : 1;                         // 0x001C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableLookAtInput : 1;                           // 0x001C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHidePlayer : 1;                                   // 0x001C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHideHud : 1;                                      // 0x001C(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableCameraCuts : 1;                            // 0x001C(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EMovieSceneCompletionModeOverride             FinishCompletionStateOverride;                     // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bPauseAtEnd : 1;                                   // 0x0024(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bInheritTickIntervalFromOwner : 1;                 // 0x0024(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDynamicWeighting : 1;                             // 0x0024(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneSequencePlaybackSettings;

// ScriptStruct MovieScene.MovieSceneTimeTransform
// 0x000C (0x000C - 0x0000)
struct FMovieSceneTimeTransform final
{
public:
	float                                         TimeScale;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameTime                             Offset;                                            // 0x0004(0x0008)(ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneTimeTransform;

// ScriptStruct MovieScene.MovieSceneChannel
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FMovieSceneChannel
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneChannel;

// ScriptStruct MovieScene.MovieSceneTangentData
// 0x0014 (0x0014 - 0x0000)
struct FMovieSceneTangentData final
{
public:
	float                                         ArriveTangent;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeaveTangent;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArriveTangentWeight;                               // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeaveTangentWeight;                                // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveTangentWeightMode                   TangentWeightMode;                                 // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneTangentData;

// ScriptStruct MovieScene.MovieSceneDoubleValue
// 0x0020 (0x0020 - 0x0000)
struct FMovieSceneDoubleValue final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneTangentData                 Tangent;                                           // 0x0008(0x0014)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	ERichCurveInterpMode                          InterpMode;                                        // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveTangentMode                         TangentMode;                                       // 0x001D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PaddingByte;                                       // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneDoubleValue;

// ScriptStruct MovieScene.MovieSceneKeyHandleMap
// 0x0000 (0x0088 - 0x0088)
struct FMovieSceneKeyHandleMap final : public FKeyHandleLookupTable
{
};
DUMPER7_ASSERTS_FMovieSceneKeyHandleMap;

// ScriptStruct MovieScene.MovieSceneDoubleChannel
// 0x00C8 (0x0118 - 0x0050)
struct FMovieSceneDoubleChannel : public FMovieSceneChannel
{
public:
	ERichCurveExtrapolation                       PreInfinityExtrap;                                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveExtrapolation                       PostInfinityExtrap;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFrameNumber>                   Times;                                             // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneDoubleValue>         Values;                                            // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	double                                        DefaultValue;                                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasDefaultValue;                                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneKeyHandleMap                KeyHandles;                                        // 0x0088(0x0088)(Transient, NativeAccessSpecifierPrivate)
	struct FFrameRate                             TickResolution;                                    // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneDoubleChannel;

// ScriptStruct MovieScene.MovieSceneTimeWarpChannel
// 0x0010 (0x0128 - 0x0118)
struct FMovieSceneTimeWarpChannel final : public FMovieSceneDoubleChannel
{
public:
	class UMovieScene*                            Owner;                                             // 0x0118(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneTimeWarpChannel;

// ScriptStruct MovieScene.MovieSceneTimeWarpFixedFrame
// 0x0004 (0x0004 - 0x0000)
struct FMovieSceneTimeWarpFixedFrame final
{
public:
	struct FFrameNumber                           FrameNumber;                                       // 0x0000(0x0004)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneTimeWarpFixedFrame;

// ScriptStruct MovieScene.MovieSceneFixedPlayRateStruct
// 0x0008 (0x0008 - 0x0000)
struct FMovieSceneFixedPlayRateStruct final
{
public:
	double                                        PlayRate;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneFixedPlayRateStruct;

// ScriptStruct MovieScene.MovieSceneCustomTimeWarpGetterStruct
// 0x0008 (0x0008 - 0x0000)
struct FMovieSceneCustomTimeWarpGetterStruct final
{
public:
	class UMovieSceneTimeWarpGetter*              Object;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FMovieSceneCustomTimeWarpGetterStruct;

// ScriptStruct MovieScene.MovieSceneTimeWarpLoop
// 0x0004 (0x0004 - 0x0000)
struct FMovieSceneTimeWarpLoop final
{
public:
	struct FFrameNumber                           Duration;                                          // 0x0000(0x0004)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneTimeWarpLoop;

// ScriptStruct MovieScene.MovieSceneTimeWarpClamp
// 0x0004 (0x0004 - 0x0000)
struct FMovieSceneTimeWarpClamp final
{
public:
	struct FFrameNumber                           max_0;                                             // 0x0000(0x0004)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneTimeWarpClamp;

// ScriptStruct MovieScene.MovieSceneTimeWarpLoopFloat
// 0x0004 (0x0004 - 0x0000)
struct FMovieSceneTimeWarpLoopFloat final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneTimeWarpLoopFloat;

// ScriptStruct MovieScene.MovieSceneTimeWarpClampFloat
// 0x0004 (0x0004 - 0x0000)
struct FMovieSceneTimeWarpClampFloat final
{
public:
	float                                         max_0;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneTimeWarpClampFloat;

// ScriptStruct MovieScene.MovieSceneTimeWarpFrameRate
// 0x0006 (0x0006 - 0x0000)
struct FMovieSceneTimeWarpFrameRate final
{
public:
	uint8                                         FrameRateNumerator[0x3];                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         FrameRateDenominator[0x3];                         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneTimeWarpFrameRate;

// ScriptStruct MovieScene.MovieSceneAudioTriggerChannel
// 0x00A8 (0x00F8 - 0x0050)
struct FMovieSceneAudioTriggerChannel final : public FMovieSceneChannel
{
public:
	TArray<struct FFrameNumber>                   Times;                                             // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<bool>                                  Values;                                            // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FMovieSceneKeyHandleMap                KeyHandles;                                        // 0x0070(0x0088)(Transient, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneAudioTriggerChannel;

// ScriptStruct MovieScene.MovieSceneBoolChannel
// 0x00B8 (0x0108 - 0x0050)
struct FMovieSceneBoolChannel : public FMovieSceneChannel
{
public:
	ERichCurveExtrapolation                       PreInfinityExtrap;                                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveExtrapolation                       PostInfinityExtrap;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFrameNumber>                   Times;                                             // 0x0058(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          DefaultValue;                                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasDefaultValue;                                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  Values;                                            // 0x0070(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FMovieSceneKeyHandleMap                KeyHandles;                                        // 0x0080(0x0088)(Transient, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FMovieSceneBoolChannel;

// ScriptStruct MovieScene.MovieSceneByteChannel
// 0x00C0 (0x0110 - 0x0050)
struct FMovieSceneByteChannel : public FMovieSceneChannel
{
public:
	ERichCurveExtrapolation                       PreInfinityExtrap;                                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveExtrapolation                       PostInfinityExtrap;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFrameNumber>                   Times;                                             // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         DefaultValue;                                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasDefaultValue;                                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 Values;                                            // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UEnum*                                  Enum;                                              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	struct FMovieSceneKeyHandleMap                KeyHandles;                                        // 0x0088(0x0088)(Transient, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneByteChannel;

// ScriptStruct MovieScene.MovieSceneFloatValue
// 0x001C (0x001C - 0x0000)
struct FMovieSceneFloatValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneTangentData                 Tangent;                                           // 0x0004(0x0014)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	ERichCurveInterpMode                          InterpMode;                                        // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveTangentMode                         TangentMode;                                       // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PaddingByte;                                       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneFloatValue;

// ScriptStruct MovieScene.MovieSceneFloatChannel
// 0x00C0 (0x0110 - 0x0050)
struct FMovieSceneFloatChannel final : public FMovieSceneChannel
{
public:
	ERichCurveExtrapolation                       PreInfinityExtrap;                                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveExtrapolation                       PostInfinityExtrap;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFrameNumber>                   Times;                                             // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneFloatValue>          Values;                                            // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                         DefaultValue;                                      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasDefaultValue;                                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneKeyHandleMap                KeyHandles;                                        // 0x0080(0x0088)(Transient, NativeAccessSpecifierPrivate)
	struct FFrameRate                             TickResolution;                                    // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneFloatChannel;

// ScriptStruct MovieScene.MovieSceneIntegerChannel
// 0x00B8 (0x0108 - 0x0050)
struct FMovieSceneIntegerChannel final : public FMovieSceneChannel
{
public:
	ERichCurveExtrapolation                       PreInfinityExtrap;                                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichCurveExtrapolation                       PostInfinityExtrap;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterpolateLinearKeys;                            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFrameNumber>                   Times;                                             // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         DefaultValue;                                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasDefaultValue;                                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
