#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "Niagara_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NiagaraCore_structs.hpp"
#include "NiagaraCore_classes.hpp"
#include "MovieScene_classes.hpp"
#include "NiagaraShader_structs.hpp"
#include "NiagaraShader_classes.hpp"


namespace SDK
{

// Class Niagara.NDIRenderTargetVolumeSimCacheData
// 0x0018 (0x0040 - 0x0028)
class UNDIRenderTargetVolumeSimCacheData final : public UObject
{
public:
	class FName                                   CompressionType;                                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNDIRenderTargetVolumeSimCacheFrame> Frames;                                       // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NDIRenderTargetVolumeSimCacheData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NDIRenderTargetVolumeSimCacheData")
	}
	static class UNDIRenderTargetVolumeSimCacheData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNDIRenderTargetVolumeSimCacheData>();
	}
};
DUMPER7_ASSERTS_UNDIRenderTargetVolumeSimCacheData;

// Class Niagara.NiagaraDataInterface
// 0x0010 (0x0038 - 0x0028)
class UNiagaraDataInterface : public UNiagaraDataInterfaceBase
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterface")
	}
	static class UNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterface;

// Class Niagara.NiagaraDataInterfaceMeshRendererInfo
// 0x0018 (0x0050 - 0x0038)
class UNiagaraDataInterfaceMeshRendererInfo final : public UNiagaraDataInterface
{
public:
	class UNiagaraMeshRendererProperties*         MeshRenderer;                                      // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceMeshRendererInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceMeshRendererInfo")
	}
	static class UNiagaraDataInterfaceMeshRendererInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceMeshRendererInfo>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceMeshRendererInfo;

// Class Niagara.NiagaraAssetTagDefinitions
// 0x0038 (0x0060 - 0x0028)
class UNiagaraAssetTagDefinitions final : public UObject
{
public:
	class FText                                   DisplayName;                                       // 0x0028(0x0010)(Edit, NativeAccessSpecifierPrivate)
	class FText                                   Description;                                       // 0x0038(0x0010)(Edit, NativeAccessSpecifierPrivate)
	TArray<struct FNiagaraAssetTagDefinition>     TagDefinitions;                                    // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bDisplayTagsAsFlatList;                            // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SortOrder;                                         // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraAssetTagDefinitions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraAssetTagDefinitions")
	}
	static class UNiagaraAssetTagDefinitions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraAssetTagDefinitions>();
	}
};
DUMPER7_ASSERTS_UNiagaraAssetTagDefinitions;

// Class Niagara.NiagaraConvertInPlaceUtilityBase
// 0x0000 (0x0028 - 0x0028)
class UNiagaraConvertInPlaceUtilityBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraConvertInPlaceUtilityBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraConvertInPlaceUtilityBase")
	}
	static class UNiagaraConvertInPlaceUtilityBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraConvertInPlaceUtilityBase>();
	}
};
DUMPER7_ASSERTS_UNiagaraConvertInPlaceUtilityBase;

// Class Niagara.NiagaraBakerOutput
// 0x0010 (0x0038 - 0x0028)
class UNiagaraBakerOutput : public UObject
{
public:
	class FString                                 OutputName;                                        // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraBakerOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraBakerOutput")
	}
	static class UNiagaraBakerOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraBakerOutput>();
	}
};
DUMPER7_ASSERTS_UNiagaraBakerOutput;

// Class Niagara.NiagaraBakerOutputSparseVolumeTexture
// 0x0038 (0x0070 - 0x0038)
class UNiagaraBakerOutputSparseVolumeTexture final : public UNiagaraBakerOutput
{
public:
	struct FNiagaraBakerTextureSource             SourceBinding;                                     // 0x0038(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraParameterBinding               VolumeWorldSpaceSizeBinding;                       // 0x0050(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SparseVolumeTextureAssetPathFormat;                // 0x0060(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraBakerOutputSparseVolumeTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraBakerOutputSparseVolumeTexture")
	}
	static class UNiagaraBakerOutputSparseVolumeTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraBakerOutputSparseVolumeTexture>();
	}
};
DUMPER7_ASSERTS_UNiagaraBakerOutputSparseVolumeTexture;

// Class Niagara.NiagaraDataChannelReader
// 0x0020 (0x0048 - 0x0028)
class UNiagaraDataChannelReader final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraDataChannelHandler*             Owner;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	bool InitAccess(const struct FNiagaraDataChannelSearchParameters& SearchParams, bool bReadPrevFrameData);

	int32 Num() const;
	bool ReadBool(class FName VarName, int32 Index_0, bool* IsValid) const;
	uint8 ReadEnum(class FName VarName, int32 Index_0, bool* IsValid) const;
	double ReadFloat(class FName VarName, int32 Index_0, bool* IsValid) const;
	struct FNiagaraID ReadID(class FName VarName, int32 Index_0, bool* IsValid) const;
	int32 ReadInt(class FName VarName, int32 Index_0, bool* IsValid) const;
	struct FLinearColor ReadLinearColor(class FName VarName, int32 Index_0, bool* IsValid) const;
	struct FVector ReadPosition(class FName VarName, int32 Index_0, bool* IsValid) const;
	struct FQuat ReadQuat(class FName VarName, int32 Index_0, bool* IsValid) const;
	struct FNiagaraSpawnInfo ReadSpawnInfo(class FName VarName, int32 Index_0, bool* IsValid) const;
	struct FVector ReadVector(class FName VarName, int32 Index_0, bool* IsValid) const;
	struct FVector2D ReadVector2D(class FName VarName, int32 Index_0, bool* IsValid) const;
	struct FVector4 ReadVector4(class FName VarName, int32 Index_0, bool* IsValid) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannelReader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannelReader")
	}
	static class UNiagaraDataChannelReader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelReader>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannelReader;

// Class Niagara.NiagaraDataChannelWriter
// 0x0018 (0x0040 - 0x0028)
class UNiagaraDataChannelWriter final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraDataChannelHandler*             Owner;                                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	bool InitWrite(const struct FNiagaraDataChannelSearchParameters& SearchParams, int32 Count, bool bVisibleToGame, bool bVisibleToCPU, bool bVisibleToGPU, const class FString& DebugSource);
	void WriteBool(class FName VarName, int32 Index_0, bool InData);
	void WriteEnum(class FName VarName, int32 Index_0, uint8 InData);
	void WriteFloat(class FName VarName, int32 Index_0, double InData);
	void WriteID(class FName VarName, int32 Index_0, const struct FNiagaraID& InData);
	void WriteInt(class FName VarName, int32 Index_0, int32 InData);
	void WriteLinearColor(class FName VarName, int32 Index_0, const struct FLinearColor& InData);
	void WritePosition(class FName VarName, int32 Index_0, const struct FVector& InData);
	void WriteQuat(class FName VarName, int32 Index_0, const struct FQuat& InData);
	void WriteSpawnInfo(class FName VarName, int32 Index_0, const struct FNiagaraSpawnInfo& InData);
	void WriteVector(class FName VarName, int32 Index_0, const struct FVector& InData);
	void WriteVector2D(class FName VarName, int32 Index_0, const struct FVector2D& InData);
	void WriteVector4(class FName VarName, int32 Index_0, const struct FVector4& InData);

	int32 Num() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannelWriter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannelWriter")
	}
	static class UNiagaraDataChannelWriter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelWriter>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannelWriter;

// Class Niagara.NiagaraDataInterfaceCurveBase
// 0x0038 (0x0070 - 0x0038)
class UNiagaraDataInterfaceCurveBase : public UNiagaraDataInterface
{
public:
	TArray<float>                                 ShaderLUT;                                         // 0x0038(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         LUTMinTime;                                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTMaxTime;                                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTInvTimeRange;                                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTNumSamplesMinusOne;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x4];                                       // 0x0058(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bUseLUT : 1;                                       // 0x005C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bExposeCurve : 1;                                  // 0x005C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ExposedName;                                       // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ExposedTexture;                                    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceCurveBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceCurveBase")
	}
	static class UNiagaraDataInterfaceCurveBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurveBase>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceCurveBase;

// Class Niagara.NiagaraDataInterfaceCurve
// 0x0080 (0x00F0 - 0x0070)
class UNiagaraDataInterfaceCurve final : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                             Curve;                                             // 0x0070(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceCurve")
	}
	static class UNiagaraDataInterfaceCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurve>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceCurve;

// Class Niagara.NiagaraDataChannelHandler
// 0x0038 (0x0060 - 0x0028)
class UNiagaraDataChannelHandler : public UObject
{
public:
	TWeakObjectPtr<class UNiagaraDataChannel>     DataChannel;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraDataChannelWriter*              Writer;                                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UNiagaraDataChannelReader*              Reader;                                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UNiagaraDataChannelReader* GetDataChannelReader();
	class UNiagaraDataChannelWriter* GetDataChannelWriter();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannelHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannelHandler")
	}
	static class UNiagaraDataChannelHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelHandler>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannelHandler;

// Class Niagara.NiagaraDataChannelAsset
// 0x0008 (0x0030 - 0x0028)
class UNiagaraDataChannelAsset final : public UObject
{
public:
	class UNiagaraDataChannel*                    DataChannel;                                       // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannelAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannelAsset")
	}
	static class UNiagaraDataChannelAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelAsset>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannelAsset;

// Class Niagara.NiagaraDataInterfaceUnfogQuery
// 0x0000 (0x0038 - 0x0038)
class UNiagaraDataInterfaceUnfogQuery final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceUnfogQuery")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceUnfogQuery")
	}
	static class UNiagaraDataInterfaceUnfogQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceUnfogQuery>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceUnfogQuery;

// Class Niagara.NiagaraDataChannel
// 0x0030 (0x0058 - 0x0028)
class UNiagaraDataChannel : public UObject
{
public:
	TArray<struct FNiagaraDataChannelVariable>    ChannelVariables;                                  // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bKeepPreviousFrameData;                            // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnforceTickGroupReadWriteOrder;                   // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ETickingGroup                                 FinalWriteTickGroup;                               // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B[0x1D];                                      // 0x003B(0x001D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannel")
	}
	static class UNiagaraDataChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannel>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannel;

// Class Niagara.NiagaraDataChannel_Global
// 0x0000 (0x0058 - 0x0058)
class UNiagaraDataChannel_Global final : public UNiagaraDataChannel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannel_Global")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannel_Global")
	}
	static class UNiagaraDataChannel_Global* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannel_Global>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannel_Global;

// Class Niagara.NiagaraDataInterfaceRWBase
// 0x0000 (0x0038 - 0x0038)
class UNiagaraDataInterfaceRWBase : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceRWBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceRWBase")
	}
	static class UNiagaraDataInterfaceRWBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRWBase>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceRWBase;

// Class Niagara.NiagaraDataInterfaceRenderTarget2DArray
// 0x0030 (0x0068 - 0x0038)
class UNiagaraDataInterfaceRenderTarget2DArray final : public UNiagaraDataInterfaceRWBase
{
public:
	struct FIntVector                             Size;                                              // 0x0038(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureRenderTargetFormat                    OverrideRenderTargetFormat;                        // 0x0044(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureFilter                                OverrideRenderTargetFilter;                        // 0x0045(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInheritUserParameterSettings : 1;                 // 0x0046(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideFormat : 1;                               // 0x0046(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraUserParameterBinding           RenderTargetUserParameter;                         // 0x0048(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceRenderTarget2DArray")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceRenderTarget2DArray")
	}
	static class UNiagaraDataInterfaceRenderTarget2DArray* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRenderTarget2DArray>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceRenderTarget2DArray;

// Class Niagara.NiagaraDataChannelHandler_Global
// 0x0010 (0x0070 - 0x0060)
class UNiagaraDataChannelHandler_Global final : public UNiagaraDataChannelHandler
{
public:
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannelHandler_Global")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannelHandler_Global")
	}
	static class UNiagaraDataChannelHandler_Global* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelHandler_Global>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannelHandler_Global;

// Class Niagara.NiagaraDataChannel_Islands
// 0x0088 (0x00E0 - 0x0058)
class UNiagaraDataChannel_Islands final : public UNiagaraDataChannel
{
public:
	ENiagraDataChannel_IslandMode                 Mode;                                              // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitialExtents;                                    // 0x0060(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                MaxExtents;                                        // 0x0078(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PerElementExtents;                                 // 0x0090(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UNiagaraSystem>>  Systems;                                           // 0x00A8(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	int32                                         IslandPoolSize;                                    // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNDCIslandDebugDrawSettings            DebugDrawSettings;                                 // 0x00BC(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UNiagaraSystem*>                 SystemsInternal;                                   // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannel_Islands")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannel_Islands")
	}
	static class UNiagaraDataChannel_Islands* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannel_Islands>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannel_Islands;

// Class Niagara.NiagaraDataInterfaceVectorField
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceVectorField final : public UNiagaraDataInterface
{
public:
	class UVectorField*                           Field;                                             // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	bool                                          bTileX;                                            // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTileY;                                            // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTileZ;                                            // 0x0042(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceVectorField")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceVectorField")
	}
	static class UNiagaraDataInterfaceVectorField* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceVectorField>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceVectorField;

// Class Niagara.NiagaraDataChannelHandler_Islands
// 0x0030 (0x0090 - 0x0060)
class UNiagaraDataChannelHandler_Islands final : public UNiagaraDataChannelHandler
{
public:
	TArray<int32>                                 ActiveIslands;                                     // 0x0060(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 FreeIslands;                                       // 0x0070(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FNDCIsland>                     IslandPool;                                        // 0x0080(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataChannelHandler_Islands")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataChannelHandler_Islands")
	}
	static class UNiagaraDataChannelHandler_Islands* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataChannelHandler_Islands>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataChannelHandler_Islands;

// Class Niagara.AsyncNiagaraCaptureSimCache
// 0x0100 (0x0130 - 0x0030)
class UAsyncNiagaraCaptureSimCache final : public UCancellableAsyncAction
{
public:
	class UNiagaraSimCache*                       CaptureSimCache;                                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UNiagaraComponent*                      CaptureComponent;                                  // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TMulticastInlineDelegate<void(bool bSuccess)> CaptureComplete;                                   // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0xE0];                                      // 0x0050(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncNiagaraCaptureSimCache* CaptureNiagaraSimCache(class UNiagaraSimCache* SimCache, const struct FNiagaraSimCacheCreateParameters& CreateParameters, class UNiagaraComponent* NiagaraComponent, const struct FNiagaraSimCacheCaptureParameters& CaptureParameters, class UNiagaraSimCache** OutSimCache);
	static class UAsyncNiagaraCaptureSimCache* CaptureNiagaraSimCacheMultiFrame(class UNiagaraSimCache* SimCache, const struct FNiagaraSimCacheCreateParameters& CreateParameters, class UNiagaraComponent* NiagaraComponent, class UNiagaraSimCache** OutSimCache, int32 NumFrames, int32 CaptureRate, bool bAdvanceSimulation, float AdvanceDeltaTime);
	static class UAsyncNiagaraCaptureSimCache* CaptureNiagaraSimCacheUntilComplete(class UNiagaraSimCache* SimCache, const struct FNiagaraSimCacheCreateParameters& CreateParameters, class UNiagaraComponent* NiagaraComponent, class UNiagaraSimCache** OutSimCache, int32 CaptureRate, bool bAdvanceSimulation, float AdvanceDeltaTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncNiagaraCaptureSimCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncNiagaraCaptureSimCache")
	}
	static class UAsyncNiagaraCaptureSimCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncNiagaraCaptureSimCache>();
	}
};
DUMPER7_ASSERTS_UAsyncNiagaraCaptureSimCache;

// Class Niagara.NiagaraDataInterfaceDataChannelRead
// 0x0080 (0x00B8 - 0x0038)
class UNiagaraDataInterfaceDataChannelRead final : public UNiagaraDataInterfaceRWBase
{
public:
	class UNiagaraDataChannelAsset*               Channel;                                           // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	bool                                          bReadCurrentFrame;                                 // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateSourceDataEveryTick;                        // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSpawnGroupToDataChannelIndex;             // 0x0042(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNDIDataChannelCompiledData            CompiledData;                                      // 0x0048(0x0070)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceDataChannelRead")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceDataChannelRead")
	}
	static class UNiagaraDataInterfaceDataChannelRead* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceDataChannelRead>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceDataChannelRead;

// Class Niagara.NiagaraRendererProperties
// 0x0090 (0x00B8 - 0x0028)
class UNiagaraRendererProperties : public UNiagaraMergeable
{
public:
	struct FNiagaraPlatformSet                    Platforms;                                         // 0x0028(0x0030)(Edit, NativeAccessSpecifierPublic)
	int32                                         SortOrderHint;                                     // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRendererMotionVectorSetting           MotionVectorSetting;                               // 0x005C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInCullProxies;                               // 0x005E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraVariableAttributeBinding       RendererEnabledBinding;                            // 0x0060(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGuid                                  OuterEmitterVersion;                               // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraRendererProperties")
	}
	static class UNiagaraRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraRendererProperties;

// Class Niagara.NiagaraDecalRendererProperties
// 0x0268 (0x0320 - 0x00B8)
class UNiagaraDecalRendererProperties final : public UNiagaraRendererProperties
{
public:
	class UMaterialInterface*                     Material;                                          // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FNiagaraParameterBinding               MaterialParameterBinding;                          // 0x00C0(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	ENiagaraRendererSourceDataMode                SourceMode;                                        // 0x00CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RendererVisibility;                                // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DecalScreenSizeFade;                               // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       PositionBinding;                                   // 0x00D8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DecalOrientationBinding;                           // 0x0110(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DecalSizeBinding;                                  // 0x0148(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DecalFadeBinding;                                  // 0x0180(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DecalSortOrderBinding;                             // 0x01B8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DecalColorBinding;                                 // 0x01F0(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DecalVisibleBinding;                               // 0x0228(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RendererVisibilityTagBinding;                      // 0x0260(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraRendererMaterialParameters     MaterialParameters;                                // 0x0298(0x0050)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E8[0x38];                                     // 0x02E8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDecalRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDecalRendererProperties")
	}
	static class UNiagaraDecalRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDecalRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraDecalRendererProperties;

// Class Niagara.NDIDataChannelWriteSimCacheData
// 0x0040 (0x0068 - 0x0028)
class UNDIDataChannelWriteSimCacheData final : public UObject
{
public:
	TArray<struct FNDIDataChannelWriteSimCacheFrame> FrameData;                                      // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DataChannelReference;                              // 0x0038(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraDataInterfaceDataChannelWrite*  DataInterface;                                     // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NDIDataChannelWriteSimCacheData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NDIDataChannelWriteSimCacheData")
	}
	static class UNDIDataChannelWriteSimCacheData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNDIDataChannelWriteSimCacheData>();
	}
};
DUMPER7_ASSERTS_UNDIDataChannelWriteSimCacheData;

// Class Niagara.NiagaraDataInterfaceDataChannelWrite
// 0x00D8 (0x0110 - 0x0038)
class UNiagaraDataInterfaceDataChannelWrite final : public UNiagaraDataInterface
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ENiagaraDataChannelAllocationMode             AllocationMode;                                    // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        AllocationCount;                                   // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPublishToGame;                                    // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPublishToCPU;                                     // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPublishToGPU;                                     // 0x004A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateDestinationDataEveryTick;                   // 0x004B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraDataChannelAsset*               Channel;                                           // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FNDIDataChannelWriteCompiledData       CompiledData;                                      // 0x0058(0x00B8)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceDataChannelWrite")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceDataChannelWrite")
	}
	static class UNiagaraDataInterfaceDataChannelWrite* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceDataChannelWrite>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceDataChannelWrite;

// Class Niagara.NiagaraDataInterfaceSpriteRendererInfo
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterfaceSpriteRendererInfo final : public UNiagaraDataInterface
{
public:
	class UNiagaraSpriteRendererProperties*       SpriteRenderer;                                    // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceSpriteRendererInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceSpriteRendererInfo")
	}
	static class UNiagaraDataInterfaceSpriteRendererInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceSpriteRendererInfo>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceSpriteRendererInfo;

// Class Niagara.NiagaraMessageDataBase
// 0x0000 (0x0028 - 0x0028)
class UNiagaraMessageDataBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraMessageDataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraMessageDataBase")
	}
	static class UNiagaraMessageDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraMessageDataBase>();
	}
};
DUMPER7_ASSERTS_UNiagaraMessageDataBase;

// Class Niagara.NiagaraParameterDefinitionsBase
// 0x0000 (0x0028 - 0x0028)
class UNiagaraParameterDefinitionsBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraParameterDefinitionsBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraParameterDefinitionsBase")
	}
	static class UNiagaraParameterDefinitionsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraParameterDefinitionsBase>();
	}
};
DUMPER7_ASSERTS_UNiagaraParameterDefinitionsBase;

// Class Niagara.NiagaraSignificanceHandler
// 0x0000 (0x0028 - 0x0028)
class UNiagaraSignificanceHandler : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraSignificanceHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraSignificanceHandler")
	}
	static class UNiagaraSignificanceHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSignificanceHandler>();
	}
};
DUMPER7_ASSERTS_UNiagaraSignificanceHandler;

// Class Niagara.NiagaraSignificanceHandlerDistance
// 0x0000 (0x0028 - 0x0028)
class UNiagaraSignificanceHandlerDistance final : public UNiagaraSignificanceHandler
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraSignificanceHandlerDistance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraSignificanceHandlerDistance")
	}
	static class UNiagaraSignificanceHandlerDistance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSignificanceHandlerDistance>();
	}
};
DUMPER7_ASSERTS_UNiagaraSignificanceHandlerDistance;

// Class Niagara.NiagaraRenderableMeshInterface
// 0x0000 (0x0000 - 0x0000)
class INiagaraRenderableMeshInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraRenderableMeshInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraRenderableMeshInterface")
	}
	static class INiagaraRenderableMeshInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<INiagaraRenderableMeshInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_INiagaraRenderableMeshInterface;

// Class Niagara.NiagaraScriptSourceBase
// 0x0020 (0x0048 - 0x0028)
class UNiagaraScriptSourceBase final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraScriptSourceBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraScriptSourceBase")
	}
	static class UNiagaraScriptSourceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraScriptSourceBase>();
	}
};
DUMPER7_ASSERTS_UNiagaraScriptSourceBase;

// Class Niagara.NiagaraDataInterfacePlatformSet
// 0x0030 (0x0068 - 0x0038)
class UNiagaraDataInterfacePlatformSet final : public UNiagaraDataInterface
{
public:
	struct FNiagaraPlatformSet                    Platforms;                                         // 0x0038(0x0030)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfacePlatformSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfacePlatformSet")
	}
	static class UNiagaraDataInterfacePlatformSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfacePlatformSet>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfacePlatformSet;

// Class Niagara.NiagaraSettings
// 0x00F8 (0x0130 - 0x0038)
class UNiagaraSettings final : public UDeveloperSettings
{
public:
	bool                                          bSystemsSupportLargeWorldCoordinates;              // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnforceStrictStackTypes;                          // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExperimentalVMEnabled;                            // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStatelessEmittersEnabled;                         // 0x003B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAccurateQuatInterpolation;                        // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraCompileErrorSeverity                  InvalidNamespaceWriteSeverity;                     // 0x003D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLimitDeltaTime;                                   // 0x003E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDeltaTimePerTick;                               // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        DefaultEffectType;                                 // 0x0048(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowCreateActorFromSystemWithNoEffectType;       // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           PositionPinTypeColor;                              // 0x006C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraStripScriptByteCodeOption             ByteCodeStripOption;                               // 0x007C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           QualityLevels;                                     // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TMap<class FString, class FText>              ComponentRendererWarningsPerClass;                 // 0x0090(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	ETextureRenderTargetFormat                    DefaultRenderTargetFormat;                         // 0x00E0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraGpuBufferFormat                       DefaultGridFormat;                                 // 0x00E1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDefaultRendererMotionVectorSetting    DefaultRendererMotionVectorSetting;                // 0x00E2(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDefaultRendererPixelCoverageMode      DefaultPixelCoverageMode;                          // 0x00E3(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDefaultSortPrecision                  DefaultSortPrecision;                              // 0x00E4(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDefaultGpuTranslucentLatency          DefaultGpuTranslucentLatency;                      // 0x00E5(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultLightInverseExposureBlend;                  // 0x00E8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NDISkelMesh_SupportReadingDeformedGeometry;        // 0x00EC(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NDISkelMesh_Support16BitIndexWeight;               // 0x00ED(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENDISkelMesh_GpuMaxInfluences                 NDISkelMesh_GpuMaxInfluences;                      // 0x00EE(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENDISkelMesh_GpuUniformSamplingFormat         NDISkelMesh_GpuUniformSamplingFormat;              // 0x00EF(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENDISkelMesh_AdjacencyTriangleIndexFormat     NDISkelMesh_AdjacencyTriangleIndexFormat;          // 0x00F0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NDIStaticMesh_AllowDistanceFields;                 // 0x00F1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ENDICollisionQuery_AsyncGpuTraceProvider> NDICollisionQuery_AsyncGpuTraceProviderOrder;   // 0x00F8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 SimCacheAuxiliaryFileBasePath;                     // 0x0108(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         SimCacheMaxCPUMemoryVolumetrics;                   // 0x0118(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraPlatformSetRedirect>    PlatformSetRedirects;                              // 0x0120(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraSettings")
	}
	static class UNiagaraSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSettings>();
	}
};
DUMPER7_ASSERTS_UNiagaraSettings;

// Class Niagara.NiagaraSimCacheCustomStorageInterface
// 0x0000 (0x0000 - 0x0000)
class INiagaraSimCacheCustomStorageInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraSimCacheCustomStorageInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraSimCacheCustomStorageInterface")
	}
	static class INiagaraSimCacheCustomStorageInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<INiagaraSimCacheCustomStorageInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_INiagaraSimCacheCustomStorageInterface;

// Class Niagara.NiagaraSimCacheDebugData
// 0x0010 (0x0038 - 0x0028)
class UNiagaraSimCacheDebugData final : public UObject
{
public:
	TArray<struct FNiagaraSimCacheDebugDataFrame> Frames;                                            // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraSimCacheDebugData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraSimCacheDebugData")
	}
	static class UNiagaraSimCacheDebugData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSimCacheDebugData>();
	}
};
DUMPER7_ASSERTS_UNiagaraSimCacheDebugData;

// Class Niagara.NiagaraStatelessEmitter
// 0x01B8 (0x01E0 - 0x0028)
class UNiagaraStatelessEmitter final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UniqueEmitterName;                                 // 0x0038(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UObject>                    EmitterTemplateClass;                              // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         bDeterministic : 1;                                // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        AllowedFeatureMask;                                // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RandomSeed;                                        // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   FixedBounds;                                       // 0x0060(0x0038)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FNiagaraEmitterStateData               EmitterState;                                      // 0x0098(0x0070)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FNiagaraStatelessSpawnInfo>     SpawnInfos;                                        // 0x0108(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UNiagaraStatelessModule*>        modules;                                           // 0x0118(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class UNiagaraRendererProperties*>     RendererProperties;                                // 0x0128(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
