#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraSimCaching

#include "Basic.hpp"

#include "MovieSceneTracks_structs.hpp"
#include "Niagara_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Enum NiagaraSimCaching.ENiagaraSimCacheSectionPlayMode
// NumValues: 0x0003
enum class ENiagaraSimCacheSectionPlayMode : uint8
{
	SimWithoutCache                          = 0,
	DisplayCacheOnly                         = 1,
	ENiagaraSimCacheSectionPlayMode_MAX      = 2,
};

// Enum NiagaraSimCaching.ENiagaraSimCacheSectionStretchMode
// NumValues: 0x0003
enum class ENiagaraSimCacheSectionStretchMode : uint8
{
	Repeat                                   = 0,
	TimeDilate                               = 1,
	ENiagaraSimCacheSectionStretchMode_MAX   = 2,
};

// ScriptStruct NiagaraSimCaching.MovieSceneNiagaraCacheParams
// 0x0068 (0x0088 - 0x0020)
struct FMovieSceneNiagaraCacheParams final : public FMovieSceneBaseCacheParams
{
public:
	struct FNiagaraSimCacheCreateParameters       CacheParameters;                                   // 0x0020(0x0058)(Edit, NativeAccessSpecifierPublic)
	class UNiagaraSimCache*                       SimCache;                                          // 0x0078(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	bool                                          bLockCacheToReadOnly;                              // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideQualityLevel;                             // 0x0081(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerQualityLevels                             RecordQualityLevel;                                // 0x0082(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraSimCacheSectionPlayMode               CacheReplayPlayMode;                               // 0x0083(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraSimCacheSectionStretchMode            SectionStretchMode;                                // 0x0084(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneNiagaraCacheParams;

// ScriptStruct NiagaraSimCaching.MovieSceneNiagaraSectionTemplateParameter
// 0x0098 (0x0098 - 0x0000)
struct FMovieSceneNiagaraSectionTemplateParameter final
{
public:
	struct FMovieSceneFrameRange                  SectionRange;                                      // 0x0000(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMovieSceneNiagaraCacheParams          Params;                                            // 0x0010(0x0088)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneNiagaraSectionTemplateParameter;

// ScriptStruct NiagaraSimCaching.MovieSceneNiagaraCacheSectionTemplate
// 0x0010 (0x0020 - 0x0010)
struct FMovieSceneNiagaraCacheSectionTemplate final : public FMovieSceneTrackImplementation
{
public:
	TArray<struct FMovieSceneNiagaraSectionTemplateParameter> CacheSections;                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMovieSceneNiagaraCacheSectionTemplate;

}

