#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraSimCaching

#include "Basic.hpp"

#include "MovieSceneTracks_classes.hpp"
#include "NiagaraSimCaching_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class NiagaraSimCaching.MovieSceneNiagaraCacheSection
// 0x0090 (0x0190 - 0x0100)
class UMovieSceneNiagaraCacheSection final : public UMovieSceneBaseCacheSection
{
public:
	struct FMovieSceneNiagaraCacheParams          Params_0;                                          // 0x0100(0x0088)(Edit, NativeAccessSpecifierPublic)
	bool                                          bCacheOutOfDate;                                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraCacheSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraCacheSection")
	}
	static class UMovieSceneNiagaraCacheSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraCacheSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraCacheSection;

// Class NiagaraSimCaching.MovieSceneNiagaraCacheTrack
// 0x0030 (0x0128 - 0x00F8)
class UMovieSceneNiagaraCacheTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsRecording;                                      // 0x0108(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             AnimationSections;                                 // 0x0110(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	bool                                          bCacheRecordingEnabled;                            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraCacheTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraCacheTrack")
	}
	static class UMovieSceneNiagaraCacheTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraCacheTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraCacheTrack;

}

