#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitradoGameServerQuery

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "NitradoGameServerQuery_structs.hpp"


namespace SDK
{

// Class NitradoGameServerQuery.GameServerQuerySubsystem
// 0x00C8 (0x00F8 - 0x0030)
class UGameServerQuerySubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0xC0];                                      // 0x0030(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableReadyEndpoint;                              // 0x00F0(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableQueryEndpoint;                              // 0x00F1(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        QueryPort;                                         // 0x00F2(0x0002)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePlugin;                                     // 0x00F4(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddListenPortInfo(EPortType Type, int32 Port, const class FString& Address);
	void AddModInfo(const class FString& ID, const class FString& Version);
	void AddPlatform(EPlatform Platform);
	void AddTag(const class FString& Tag);
	void DecrementPlayerCount();
	void IncrementPlayerCount();
	void RemovePlatform(EPlatform Platform);
	void RemoveTag(const class FString& Tag);
	void Reset();
	void SetMapName(const class FString& Name_0);
	void SetPasswordProtected(const bool Enabled);
	void SetPlayerCount(const int32 Count);
	void SetPlayerMax(const int32 Count);
	void SetReady(bool Ready);
	void SetServerName(const class FString& Name_0);
	void SetTicksPerSecond(const int32 TickCount);
	void SetUniqueID(const class FString& UniqueID);
	void SetVersion(const class FString& Version);
	bool Start();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameServerQuerySubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameServerQuerySubsystem")
	}
	static class UGameServerQuerySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameServerQuerySubsystem>();
	}
};
DUMPER7_ASSERTS_UGameServerQuerySubsystem;

}

