#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitradoGameServerQuery

#include "Basic.hpp"


namespace SDK
{

// Enum NitradoGameServerQuery.EPortType
// NumValues: 0x0004
enum class EPortType : uint8
{
	game                                     = 0,
	query                                    = 1,
	rcon                                     = 2,
	EPortType_MAX                            = 3,
};

// Enum NitradoGameServerQuery.EPlatform
// NumValues: 0x0009
enum class EPlatform : uint8
{
	Unknown                                  = 0,
	PC                                       = 1,
	MAC                                      = 2,
	XBOX                                     = 3,
	PLAYSTATION                              = 4,
	SWITCH                                   = 5,
	ANDROID                                  = 6,
	IOS                                      = 7,
	EPlatform_MAX                            = 8,
};

// ScriptStruct NitradoGameServerQuery.PortInfo
// 0x0018 (0x0018 - 0x0000)
struct FPortInfo final
{
public:
	uint16                                        Port;                                              // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPortType                                     Type;                                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Address;                                           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPortInfo;

// ScriptStruct NitradoGameServerQuery.ModState
// 0x0020 (0x0020 - 0x0000)
struct FModState final
{
public:
	class FString                                 modId;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FModState;

// ScriptStruct NitradoGameServerQuery.GameServerState
// 0x0090 (0x0090 - 0x0000)
struct FGameServerState final
{
public:
	class FString                                 UniqueID;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 serverName;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapName;                                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPortInfo>                      Ports;                                             // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EPlatform>                             Platforms;                                         // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int16                                         PlayerCount;                                       // 0x0060(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         PlayerMax;                                         // 0x0062(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         PlayerReserved;                                    // 0x0064(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         BotCount;                                          // 0x0066(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        TicksPerSecond;                                    // 0x0068(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Ready;                                             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Password;                                          // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModState>                      mods;                                              // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameServerState;

}

