#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NNERuntimeORT

#include "Basic.hpp"


namespace SDK
{

// Enum NNERuntimeORT.EExecutionMode
// NumValues: 0x0003
enum class EExecutionMode : uint8
{
	SEQUENTIAL                               = 0,
	PARALLEL                                 = 1,
	EExecutionMode_MAX                       = 2,
};

// ScriptStruct NNERuntimeORT.ThreadingOptions
// 0x0010 (0x0010 - 0x0000)
struct FThreadingOptions final
{
public:
	bool                                          bUseGlobalThreadPool;                              // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntraOpNumThreads;                                 // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InterOpNumThreads;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EExecutionMode                                ExecutionMode;                                     // 0x000C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FThreadingOptions;

}

