#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NotWithinDistance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NotWithinDistance.NotWithinDistance_C
// 0x00B0 (0x0150 - 0x00A0)
class UNotWithinDistance_C final : public UBTDecorator_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Range;                                             // 0x00A8(0x0028)(Edit, BlueprintVisible)
	double                                        RangeOffsetValue;                                  // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 ShouldFlyKey;                                      // 0x00D8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 TargetBlackboardKey;                               // 0x0100(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 FollowStoppingDistanceKey;                         // 0x0128(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_NotWithinDistance(int32 EntryPoint);
	void ReceiveConditionCheck(class AActor* OwnerActor);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NotWithinDistance_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NotWithinDistance_C")
	}
	static class UNotWithinDistance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNotWithinDistance_C>();
	}
};
DUMPER7_ASSERTS_UNotWithinDistance_C;

}

