#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionSelector_Widget

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionSelector_Widget.OptionSelector_Widget_C
// 0x0030 (0x03A8 - 0x0378)
class UOptionSelector_Widget_C final : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCustomButton_HUB_ASA_C*                CustomButton_HUB_ASA_C_40;                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_36;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__OptionSelector_Widget_CustomButton_HUB_ASA_C_40_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_OptionSelector_Widget(int32 EntryPoint);
	void InitOption(class UTexture2D* Icon_0, bool IsToggled, const class FText& InText, class UObject* Asset);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("OptionSelector_Widget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptionSelector_Widget_C")
	}
	static class UOptionSelector_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionSelector_Widget_C>();
	}
};
DUMPER7_ASSERTS_UOptionSelector_Widget_C;

}

