#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptimusCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ComputeFramework_structs.hpp"
#include "ComputeFramework_classes.hpp"
#include "Engine_classes.hpp"
#include "OptimusCore_structs.hpp"


namespace SDK
{

// Class OptimusCore.OptimusAlternativeSelectedObjectProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusAlternativeSelectedObjectProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusAlternativeSelectedObjectProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusAlternativeSelectedObjectProvider")
	}
	static class IOptimusAlternativeSelectedObjectProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusAlternativeSelectedObjectProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusAlternativeSelectedObjectProvider;

// Class OptimusCore.OptimusComponentBindingProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusComponentBindingProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusComponentBindingProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusComponentBindingProvider")
	}
	static class IOptimusComponentBindingProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusComponentBindingProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusComponentBindingProvider;

// Class OptimusCore.OptimusComponentBindingReceiver
// 0x0000 (0x0000 - 0x0000)
class IOptimusComponentBindingReceiver final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusComponentBindingReceiver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusComponentBindingReceiver")
	}
	static class IOptimusComponentBindingReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusComponentBindingReceiver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusComponentBindingReceiver;

// Class OptimusCore.OptimusComputeKernelDataInterface
// 0x0000 (0x0000 - 0x0000)
class IOptimusComputeKernelDataInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusComputeKernelDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusComputeKernelDataInterface")
	}
	static class IOptimusComputeKernelDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusComputeKernelDataInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusComputeKernelDataInterface;

// Class OptimusCore.OptimusComputeKernelProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusComputeKernelProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusComputeKernelProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusComputeKernelProvider")
	}
	static class IOptimusComputeKernelProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusComputeKernelProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusComputeKernelProvider;

// Class OptimusCore.OptimusDataInterfaceProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusDataInterfaceProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusDataInterfaceProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusDataInterfaceProvider")
	}
	static class IOptimusDataInterfaceProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusDataInterfaceProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusDataInterfaceProvider;

// Class OptimusCore.OptimusDeformerInstanceAccessor
// 0x0000 (0x0000 - 0x0000)
class IOptimusDeformerInstanceAccessor final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusDeformerInstanceAccessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusDeformerInstanceAccessor")
	}
	static class IOptimusDeformerInstanceAccessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusDeformerInstanceAccessor>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusDeformerInstanceAccessor;

// Class OptimusCore.OptimusDeprecatedExecutionDataInterface
// 0x0000 (0x0000 - 0x0000)
class IOptimusDeprecatedExecutionDataInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusDeprecatedExecutionDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusDeprecatedExecutionDataInterface")
	}
	static class IOptimusDeprecatedExecutionDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusDeprecatedExecutionDataInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusDeprecatedExecutionDataInterface;

// Class OptimusCore.OptimusExecutionDomainProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusExecutionDomainProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusExecutionDomainProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusExecutionDomainProvider")
	}
	static class IOptimusExecutionDomainProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusExecutionDomainProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusExecutionDomainProvider;

// Class OptimusCore.OptimusGeneratedClassDefiner
// 0x0000 (0x0000 - 0x0000)
class IOptimusGeneratedClassDefiner final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGeneratedClassDefiner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGeneratedClassDefiner")
	}
	static class IOptimusGeneratedClassDefiner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusGeneratedClassDefiner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusGeneratedClassDefiner;

// Class OptimusCore.OptimusNodeAdderPinProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusNodeAdderPinProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusNodeAdderPinProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusNodeAdderPinProvider")
	}
	static class IOptimusNodeAdderPinProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeAdderPinProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusNodeAdderPinProvider;

// Class OptimusCore.OptimusNodeFunctionLibraryOwner
// 0x0000 (0x0000 - 0x0000)
class IOptimusNodeFunctionLibraryOwner final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusNodeFunctionLibraryOwner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusNodeFunctionLibraryOwner")
	}
	static class IOptimusNodeFunctionLibraryOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeFunctionLibraryOwner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusNodeFunctionLibraryOwner;

// Class OptimusCore.OptimusNodeGraphCollectionOwner
// 0x0000 (0x0000 - 0x0000)
class IOptimusNodeGraphCollectionOwner final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusNodeGraphCollectionOwner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusNodeGraphCollectionOwner")
	}
	static class IOptimusNodeGraphCollectionOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeGraphCollectionOwner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusNodeGraphCollectionOwner;

// Class OptimusCore.OptimusNodeGraphProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusNodeGraphProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusNodeGraphProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusNodeGraphProvider")
	}
	static class IOptimusNodeGraphProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeGraphProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusNodeGraphProvider;

// Class OptimusCore.OptimusNodePairProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusNodePairProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusNodePairProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusNodePairProvider")
	}
	static class IOptimusNodePairProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodePairProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusNodePairProvider;

// Class OptimusCore.OptimusNodePinRouter
// 0x0000 (0x0000 - 0x0000)
class IOptimusNodePinRouter final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusNodePinRouter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusNodePinRouter")
	}
	static class IOptimusNodePinRouter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodePinRouter>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusNodePinRouter;

// Class OptimusCore.OptimusNodeSubGraphReferencer
// 0x0000 (0x0000 - 0x0000)
class IOptimusNodeSubGraphReferencer final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusNodeSubGraphReferencer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusNodeSubGraphReferencer")
	}
	static class IOptimusNodeSubGraphReferencer* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNodeSubGraphReferencer>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusNodeSubGraphReferencer;

// Class OptimusCore.OptimusNonCollapsibleNode
// 0x0000 (0x0000 - 0x0000)
class IOptimusNonCollapsibleNode final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusNonCollapsibleNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusNonCollapsibleNode")
	}
	static class IOptimusNonCollapsibleNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNonCollapsibleNode>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusNonCollapsibleNode;

// Class OptimusCore.OptimusNonCopyableNode
// 0x0000 (0x0000 - 0x0000)
class IOptimusNonCopyableNode final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusNonCopyableNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusNonCopyableNode")
	}
	static class IOptimusNonCopyableNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusNonCopyableNode>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusNonCopyableNode;

// Class OptimusCore.OptimusOutputBufferWriter
// 0x0000 (0x0000 - 0x0000)
class IOptimusOutputBufferWriter final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusOutputBufferWriter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusOutputBufferWriter")
	}
	static class IOptimusOutputBufferWriter* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusOutputBufferWriter>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusOutputBufferWriter;

// Class OptimusCore.OptimusParameterBindingProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusParameterBindingProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusParameterBindingProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusParameterBindingProvider")
	}
	static class IOptimusParameterBindingProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusParameterBindingProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusParameterBindingProvider;

// Class OptimusCore.OptimusPathResolver
// 0x0000 (0x0000 - 0x0000)
class IOptimusPathResolver final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusPathResolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusPathResolver")
	}
	static class IOptimusPathResolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusPathResolver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusPathResolver;

// Class OptimusCore.OptimusPersistentBufferProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusPersistentBufferProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusPersistentBufferProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusPersistentBufferProvider")
	}
	static class IOptimusPersistentBufferProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusPersistentBufferProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusPersistentBufferProvider;

// Class OptimusCore.OptimusPinMutabilityDefiner
// 0x0000 (0x0000 - 0x0000)
class IOptimusPinMutabilityDefiner final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusPinMutabilityDefiner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusPinMutabilityDefiner")
	}
	static class IOptimusPinMutabilityDefiner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusPinMutabilityDefiner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusPinMutabilityDefiner;

// Class OptimusCore.OptimusPropertyPinProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusPropertyPinProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusPropertyPinProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusPropertyPinProvider")
	}
	static class IOptimusPropertyPinProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusPropertyPinProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusPropertyPinProvider;

// Class OptimusCore.OptimusShaderTextProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusShaderTextProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusShaderTextProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusShaderTextProvider")
	}
	static class IOptimusShaderTextProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusShaderTextProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusShaderTextProvider;

// Class OptimusCore.OptimusUnnamedNodePinProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusUnnamedNodePinProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusUnnamedNodePinProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusUnnamedNodePinProvider")
	}
	static class IOptimusUnnamedNodePinProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusUnnamedNodePinProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusUnnamedNodePinProvider;

// Class OptimusCore.OptimusValueProvider
// 0x0000 (0x0000 - 0x0000)
class IOptimusValueProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusValueProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusValueProvider")
	}
	static class IOptimusValueProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IOptimusValueProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IOptimusValueProvider;

// Class OptimusCore.OptimusComputeDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusComputeDataInterface : public UComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusComputeDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusComputeDataInterface")
	}
	static class UOptimusComputeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusComputeDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusComputeDataInterface;

// Class OptimusCore.OptimusSkinnedMeshVertexAttributeDataInterface
// 0x0008 (0x0030 - 0x0028)
class UOptimusSkinnedMeshVertexAttributeDataInterface final : public UOptimusComputeDataInterface
{
public:
	class FName                                   AttributeName;                                     // 0x0028(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusSkinnedMeshVertexAttributeDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusSkinnedMeshVertexAttributeDataInterface")
	}
	static class UOptimusSkinnedMeshVertexAttributeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshVertexAttributeDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusSkinnedMeshVertexAttributeDataInterface;

// Class OptimusCore.OptimusSkinnedMeshVertexAttributeDataProvider
// 0x0028 (0x0050 - 0x0028)
class UOptimusSkinnedMeshVertexAttributeDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkinnedMeshComponent*                  SkinnedMeshComponent;                              // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class FName                                   AttributeName;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptimusDeformerInstance*               DeformerInstance;                                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusSkinnedMeshVertexAttributeDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusSkinnedMeshVertexAttributeDataProvider")
	}
	static class UOptimusSkinnedMeshVertexAttributeDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshVertexAttributeDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusSkinnedMeshVertexAttributeDataProvider;

// Class OptimusCore.OptimusSkinWeightsAsVertexMaskDataInterface
// 0x0058 (0x0080 - 0x0028)
class UOptimusSkinWeightsAsVertexMaskDataInterface final : public UOptimusComputeDataInterface
{
public:
	class FName                                   SkinWeightProfile;                                 // 0x0028(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           BoneNames;                                         // 0x0030(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ExpandTowardsRoot;                                 // 0x0040(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpandTowardsLeaf;                                 // 0x0044(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugDrawIncludedBones;                           // 0x0048(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 DebugDrawColor;                                    // 0x004C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x30];                                      // 0x0050(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusSkinWeightsAsVertexMaskDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusSkinWeightsAsVertexMaskDataInterface")
	}
	static class UOptimusSkinWeightsAsVertexMaskDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinWeightsAsVertexMaskDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusSkinWeightsAsVertexMaskDataInterface;

// Class OptimusCore.OptimusSkinWeightsAsVertexMaskDataProvider
// 0x00B0 (0x00D8 - 0x0028)
class UOptimusSkinWeightsAsVertexMaskDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_38[0x90];                                      // 0x0038(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptimusDeformerInstance*               DeformerInstance;                                  // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusSkinWeightsAsVertexMaskDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusSkinWeightsAsVertexMaskDataProvider")
	}
	static class UOptimusSkinWeightsAsVertexMaskDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinWeightsAsVertexMaskDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusSkinWeightsAsVertexMaskDataProvider;

// Class OptimusCore.OptimusDeformerDynamicInstanceManager
// 0x0108 (0x0130 - 0x0028)
class UOptimusDeformerDynamicInstanceManager final : public UMeshDeformerInstance
{
public:
	class UOptimusDeformerInstance*               DefaultInstance;                                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TMap<struct FGuid, class UOptimusDeformerInstance*> GuidToRigDeformerInstanceMap;                // 0x0030(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_80[0xB0];                                      // 0x0080(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusDeformerDynamicInstanceManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusDeformerDynamicInstanceManager")
	}
	static class UOptimusDeformerDynamicInstanceManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDeformerDynamicInstanceManager>();
	}
};
DUMPER7_ASSERTS_UOptimusDeformerDynamicInstanceManager;

// Class OptimusCore.OptimusKernelSource
// 0x0010 (0x00A8 - 0x0098)
class UOptimusKernelSource final : public UComputeKernelSource
{
public:
	class FString                                 Source;                                            // 0x0098(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusKernelSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusKernelSource")
	}
	static class UOptimusKernelSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusKernelSource>();
	}
};
DUMPER7_ASSERTS_UOptimusKernelSource;

// Class OptimusCore.OptimusComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusComponentSource : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusComponentSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusComponentSource")
	}
	static class UOptimusComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusComponentSource>();
	}
};
DUMPER7_ASSERTS_UOptimusComponentSource;

// Class OptimusCore.OptimusSceneComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusSceneComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusSceneComponentSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusSceneComponentSource")
	}
	static class UOptimusSceneComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSceneComponentSource>();
	}
};
DUMPER7_ASSERTS_UOptimusSceneComponentSource;

// Class OptimusCore.OptimusSkinnedMeshComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusSkinnedMeshComponentSource : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusSkinnedMeshComponentSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusSkinnedMeshComponentSource")
	}
	static class UOptimusSkinnedMeshComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkinnedMeshComponentSource>();
	}
};
DUMPER7_ASSERTS_UOptimusSkinnedMeshComponentSource;

// Class OptimusCore.OptimusSkeletalMeshComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusSkeletalMeshComponentSource final : public UOptimusSkinnedMeshComponentSource
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusSkeletalMeshComponentSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusSkeletalMeshComponentSource")
	}
	static class UOptimusSkeletalMeshComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusSkeletalMeshComponentSource>();
	}
};
DUMPER7_ASSERTS_UOptimusSkeletalMeshComponentSource;

// Class OptimusCore.OptimusAdvancedSkeletonDataInterface
// 0x0050 (0x0078 - 0x0028)
class UOptimusAdvancedSkeletonDataInterface final : public UOptimusComputeDataInterface
{
public:
	class FName                                   SkinWeightProfile;                                 // 0x0028(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLayeredSkinning;                            // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOptimusAnimAttributeBufferArray       AttributeBufferArray;                              // 0x0038(0x0010)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x30];                                      // 0x0048(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusAdvancedSkeletonDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusAdvancedSkeletonDataInterface")
	}
	static class UOptimusAdvancedSkeletonDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusAdvancedSkeletonDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusAdvancedSkeletonDataInterface;

// Class OptimusCore.OptimusAdvancedSkeletonDataProvider
// 0x00B0 (0x00D8 - 0x0028)
class UOptimusAdvancedSkeletonDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_38[0x90];                                      // 0x0038(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptimusDeformerInstance*               DeformerInstance;                                  // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusAdvancedSkeletonDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusAdvancedSkeletonDataProvider")
	}
	static class UOptimusAdvancedSkeletonDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusAdvancedSkeletonDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusAdvancedSkeletonDataProvider;

// Class OptimusCore.OptimusAnimAttributeDataInterface
// 0x0030 (0x0058 - 0x0028)
class UOptimusAnimAttributeDataInterface final : public UOptimusComputeDataInterface
{
public:
	struct FOptimusAnimAttributeArray             AttributeArray;                                    // 0x0028(0x0010)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusAnimAttributeDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusAnimAttributeDataInterface")
	}
	static class UOptimusAnimAttributeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusAnimAttributeDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusAnimAttributeDataInterface;

// Class OptimusCore.OptimusAnimAttributeDataProvider
// 0x0020 (0x0048 - 0x0028)
class UOptimusAnimAttributeDataProvider final : public UComputeDataProvider
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusAnimAttributeDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusAnimAttributeDataProvider")
	}
	static class UOptimusAnimAttributeDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusAnimAttributeDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusAnimAttributeDataProvider;

// Class OptimusCore.OptimusClothDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusClothDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusClothDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusClothDataInterface")
	}
	static class UOptimusClothDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusClothDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusClothDataInterface;

// Class OptimusCore.OptimusClothDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusClothDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusClothDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusClothDataProvider")
	}
	static class UOptimusClothDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusClothDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusClothDataProvider;

// Class OptimusCore.OptimusConnectivityDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusConnectivityDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusConnectivityDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusConnectivityDataInterface")
	}
	static class UOptimusConnectivityDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusConnectivityDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusConnectivityDataInterface;

// Class OptimusCore.OptimusConnectivityDataProvider
// 0x0018 (0x0040 - 0x0028)
class UOptimusConnectivityDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusConnectivityDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusConnectivityDataProvider")
	}
	static class UOptimusConnectivityDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusConnectivityDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusConnectivityDataProvider;

// Class OptimusCore.OptimusCopyKernelDataInterface
// 0x0020 (0x0048 - 0x0028)
class UOptimusCopyKernelDataInterface final : public UComputeDataInterface
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UOptimusComponentSourceBinding> ComponentSourceBinding;                     // 0x0030(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NumThreadsExpression;                              // 0x0038(0x0010)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusCopyKernelDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusCopyKernelDataInterface")
	}
	static class UOptimusCopyKernelDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusCopyKernelDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusCopyKernelDataInterface;

// Class OptimusCore.OptimusCopyKernelDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusCopyKernelDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusCopyKernelDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusCopyKernelDataProvider")
	}
	static class UOptimusCopyKernelDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusCopyKernelDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusCopyKernelDataProvider;

// Class OptimusCore.OptimusCustomComputeKernelDataInterface
// 0x0038 (0x0060 - 0x0028)
class UOptimusCustomComputeKernelDataInterface final : public UComputeDataInterface
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UOptimusComponentSourceBinding> ComponentSourceBinding;                     // 0x0030(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NumThreadsExpression;                              // 0x0038(0x0010)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusConstantIdentifier             ExecutionDomainConstantIdentifier;                 // 0x0048(0x0018)(BlueprintReadOnly, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusCustomComputeKernelDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusCustomComputeKernelDataInterface")
	}
	static class UOptimusCustomComputeKernelDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusCustomComputeKernelDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusCustomComputeKernelDataInterface;

// Class OptimusCore.OptimusCustomComputeKernelDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusCustomComputeKernelDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusCustomComputeKernelDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusCustomComputeKernelDataProvider")
	}
	static class UOptimusCustomComputeKernelDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusCustomComputeKernelDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusCustomComputeKernelDataProvider;

// Class OptimusCore.OptimusDebugDrawDataInterface
// 0x0018 (0x0040 - 0x0028)
class UOptimusDebugDrawDataInterface final : public UOptimusComputeDataInterface
{
public:
	bool                                          bIsSupported;                                      // 0x0028(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOptimusDebugDrawParameters            DebugDrawParameters;                               // 0x002C(0x0014)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusDebugDrawDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusDebugDrawDataInterface")
	}
	static class UOptimusDebugDrawDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDebugDrawDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusDebugDrawDataInterface;

// Class OptimusCore.OptimusDebugDrawDataProvider
// 0x0020 (0x0048 - 0x0028)
class UOptimusDebugDrawDataProvider final : public UComputeDataProvider
{
public:
	class UPrimitiveComponent*                    PrimitiveComponent;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FOptimusDebugDrawParameters            DebugDrawParameters;                               // 0x0030(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusDebugDrawDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusDebugDrawDataProvider")
	}
	static class UOptimusDebugDrawDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDebugDrawDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusDebugDrawDataProvider;

// Class OptimusCore.OptimusDuplicateVerticesDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusDuplicateVerticesDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusDuplicateVerticesDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusDuplicateVerticesDataInterface")
	}
	static class UOptimusDuplicateVerticesDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDuplicateVerticesDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusDuplicateVerticesDataInterface;

// Class OptimusCore.OptimusDuplicateVerticesDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusDuplicateVerticesDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusDuplicateVerticesDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusDuplicateVerticesDataProvider")
	}
	static class UOptimusDuplicateVerticesDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusDuplicateVerticesDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusDuplicateVerticesDataProvider;

// Class OptimusCore.OptimusGraphDataInterface
// 0x0018 (0x0040 - 0x0028)
class UOptimusGraphDataInterface final : public UComputeDataInterface
{
public:
	TArray<struct FOptimusGraphVariableDescription> Variables;                                       // 0x0028(0x0010)(BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         ParameterBufferSize;                               // 0x0038(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGraphDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGraphDataInterface")
	}
	static class UOptimusGraphDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGraphDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusGraphDataInterface;

// Class OptimusCore.OptimusGraphDataProvider
// 0x0040 (0x0068 - 0x0028)
class UOptimusGraphDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         MeshComponent;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<struct FOptimusGraphVariableDescription> Variables;                                       // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptimusDeformerInstance*               DeformerInstance;                                  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusGraphDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusGraphDataProvider")
	}
	static class UOptimusGraphDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGraphDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusGraphDataProvider;

// Class OptimusCore.OptimusHalfEdgeDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusHalfEdgeDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusHalfEdgeDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusHalfEdgeDataInterface")
	}
	static class UOptimusHalfEdgeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusHalfEdgeDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusHalfEdgeDataInterface;

// Class OptimusCore.OptimusHalfEdgeDataProvider
// 0x0020 (0x0048 - 0x0028)
class UOptimusHalfEdgeDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusHalfEdgeDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusHalfEdgeDataProvider")
	}
	static class UOptimusHalfEdgeDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusHalfEdgeDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusHalfEdgeDataProvider;

// Class OptimusCore.OptimusLoopTerminalDataInterface
// 0x0008 (0x0030 - 0x0028)
class UOptimusLoopTerminalDataInterface final : public UOptimusComputeDataInterface
{
public:
	uint32                                        Index_0;                                           // 0x0028(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        Count;                                             // 0x002C(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusLoopTerminalDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusLoopTerminalDataInterface")
	}
	static class UOptimusLoopTerminalDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusLoopTerminalDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusLoopTerminalDataInterface;

// Class OptimusCore.OptimusLoopTerminalDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusLoopTerminalDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusLoopTerminalDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusLoopTerminalDataProvider")
	}
	static class UOptimusLoopTerminalDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusLoopTerminalDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusLoopTerminalDataProvider;

// Class OptimusCore.OptimusMorphTargetDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusMorphTargetDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusMorphTargetDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusMorphTargetDataInterface")
	}
	static class UOptimusMorphTargetDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusMorphTargetDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusMorphTargetDataInterface;

// Class OptimusCore.OptimusMorphTargetDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusMorphTargetDataProvider final : public UComputeDataProvider
{
public:
	class USkinnedMeshComponent*                  SkinnedMesh;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusMorphTargetDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusMorphTargetDataProvider")
	}
	static class UOptimusMorphTargetDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusMorphTargetDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusMorphTargetDataProvider;

// Class OptimusCore.OptimusRawBufferDataInterface
// 0x0068 (0x0090 - 0x0028)
class UOptimusRawBufferDataInterface : public UOptimusComputeDataInterface
{
public:
	struct FShaderValueTypeHandle                 ValueType;                                         // 0x0028(0x0008)(BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusDataDomain                     DataDomain;                                        // 0x0030(0x0040)(BlueprintReadOnly, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UOptimusComponentSourceBinding> ComponentSourceBinding;                     // 0x0070(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOptimusConstantIdentifier             DomainConstantIdentifier;                          // 0x0078(0x0018)(BlueprintReadOnly, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusRawBufferDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusRawBufferDataInterface")
	}
	static class UOptimusRawBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusRawBufferDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusRawBufferDataInterface;

// Class OptimusCore.OptimusTransientBufferDataInterface
// 0x0008 (0x0098 - 0x0090)
class UOptimusTransientBufferDataInterface final : public UOptimusRawBufferDataInterface
{
public:
	bool                                          bZeroInitForAtomicWrites;                          // 0x0090(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusTransientBufferDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusTransientBufferDataInterface")
	}
	static class UOptimusTransientBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusTransientBufferDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusTransientBufferDataInterface;

// Class OptimusCore.OptimusImplicitPersistentBufferDataInterface
// 0x0008 (0x0098 - 0x0090)
class UOptimusImplicitPersistentBufferDataInterface final : public UOptimusRawBufferDataInterface
{
public:
	bool                                          bZeroInitForAtomicWrites;                          // 0x0090(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusImplicitPersistentBufferDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusImplicitPersistentBufferDataInterface")
	}
	static class UOptimusImplicitPersistentBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusImplicitPersistentBufferDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusImplicitPersistentBufferDataInterface;

// Class OptimusCore.OptimusPersistentBufferDataInterface
// 0x0008 (0x0098 - 0x0090)
class UOptimusPersistentBufferDataInterface final : public UOptimusRawBufferDataInterface
{
public:
	class FName                                   ResourceName;                                      // 0x0090(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusPersistentBufferDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusPersistentBufferDataInterface")
	}
	static class UOptimusPersistentBufferDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusPersistentBufferDataInterface>();
	}
};
DUMPER7_ASSERTS_UOptimusPersistentBufferDataInterface;

// Class OptimusCore.OptimusRawBufferDataProvider
// 0x0058 (0x0080 - 0x0028)
class UOptimusRawBufferDataProvider : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusRawBufferDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusRawBufferDataProvider")
	}
	static class UOptimusRawBufferDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusRawBufferDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusRawBufferDataProvider;

// Class OptimusCore.OptimusTransientBufferDataProvider
// 0x0008 (0x0088 - 0x0080)
class UOptimusTransientBufferDataProvider final : public UOptimusRawBufferDataProvider
{
public:
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OptimusTransientBufferDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptimusTransientBufferDataProvider")
	}
	static class UOptimusTransientBufferDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusTransientBufferDataProvider>();
	}
};
DUMPER7_ASSERTS_UOptimusTransientBufferDataProvider;

// Class OptimusCore.OptimusImplicitPersistentBufferDataProvider
// 0x0028 (0x00A8 - 0x0080)
class UOptimusImplicitPersistentBufferDataProvider final : public UOptimusRawBufferDataProvider
{
public:
	uint8                                         Pad_80[0x28];                                      // 0x0080(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
