#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PCG_structs.hpp"
#include "ComputeFramework_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class PCG.PCGNodeSourceTextProvider
// 0x0000 (0x0000 - 0x0000)
class IPCGNodeSourceTextProvider final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGNodeSourceTextProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGNodeSourceTextProvider")
	}
	static class IPCGNodeSourceTextProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPCGNodeSourceTextProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IPCGNodeSourceTextProvider;

// Class PCG.PCGDebugDataInterface
// 0x0008 (0x0030 - 0x0028)
class UPCGDebugDataInterface final : public UComputeDataInterface
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGDebugDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGDebugDataInterface")
	}
	static class UPCGDebugDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGDebugDataInterface>();
	}
};
DUMPER7_ASSERTS_UPCGDebugDataInterface;

// Class PCG.PCGData
// 0x0010 (0x0038 - 0x0028)
class UPCGData : public UObject
{
public:
	uint64                                        UID;                                               // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGData")
	}
	static class UPCGData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGData>();
	}
};
DUMPER7_ASSERTS_UPCGData;

// Class PCG.PCGSettingsInterface
// 0x0008 (0x0040 - 0x0038)
class UPCGSettingsInterface : public UPCGData
{
public:
	bool                                          bEnabled;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSettingsInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSettingsInterface")
	}
	static class UPCGSettingsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettingsInterface>();
	}
};
DUMPER7_ASSERTS_UPCGSettingsInterface;

// Class PCG.PCGSettings
// 0x0078 (0x00B8 - 0x0040)
class UPCGSettings : public UPCGSettingsInterface
{
public:
	int32                                         Seed;                                              // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseSeed;                                          // 0x0050(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x3F];                                      // 0x0051(0x003F)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPCGSettingsOverridableParam>   CachedOverridableParams;                           // 0x0090(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x1];                                       // 0x00A0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bExecuteOnGPU;                                     // 0x00A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDumpCookedHLSL;                                   // 0x00A2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDumpDataDescriptions;                             // 0x00A3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPrintShaderDebugValues;                           // 0x00A4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DebugBufferSize;                                   // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC[0xC];                                       // 0x00AC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 BP_GetTypeUnionOfIncidentEdges(const class FName& PinLabel) const;
	bool UseSeed() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSettings")
	}
	static class UPCGSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettings>();
	}
};
DUMPER7_ASSERTS_UPCGSettings;

// Class PCG.PCGGetLoopIndexSettings
// 0x0008 (0x00C0 - 0x00B8)
class UPCGGetLoopIndexSettings final : public UPCGSettings
{
public:
	bool                                          bWarnIfCalledOutsideOfLoop;                        // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGGetLoopIndexSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGGetLoopIndexSettings")
	}
	static class UPCGGetLoopIndexSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGGetLoopIndexSettings>();
	}
};
DUMPER7_ASSERTS_UPCGGetLoopIndexSettings;

// Class PCG.PCGAddComponentSettings
// 0x0098 (0x0150 - 0x00B8)
class UPCGAddComponentSettings final : public UPCGSettings
{
public:
	bool                                          bUseClassAttribute;                                // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     ClassAttribute;                                    // 0x00C0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorComponent>            TemplateComponentClass;                            // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowTemplateComponentEditing;                    // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        TemplateComponent;                                 // 0x00F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FPCGAttributePropertyInputSelector     ActorReferenceAttribute;                           // 0x0100(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyOutputNoSourceSelector ComponentReferenceAttribute;                  // 0x0128(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAddComponentSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAddComponentSettings")
	}
	static class UPCGAddComponentSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAddComponentSettings>();
	}
};
DUMPER7_ASSERTS_UPCGAddComponentSettings;

// Class PCG.PCGSubdivisionBaseSettings
// 0x00E0 (0x0198 - 0x00B8)
class UPCGSubdivisionBaseSettings : public UPCGSettings
{
public:
	bool                                          bModuleInfoAsInput;                                // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPCGSubdivisionSubmodule>       ModulesInfo;                                       // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPCGSubdivisionModuleAttributeNames    ModulesInfoAttributeNames;                         // 0x00D0(0x0028)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPCGGrammarSelection                   GrammarSelection;                                  // 0x00F8(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bUseSeedAttribute;                                 // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     SeedAttribute;                                     // 0x0140(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForwardAttributesFromModulesInfo;                 // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SymbolAttributeName;                               // 0x016C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputSizeAttribute;                              // 0x0174(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SizeAttributeName;                                 // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputScalableAttribute;                          // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ScalableAttributeName;                             // 0x0184(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputDebugColorAttribute;                        // 0x018C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DebugColorAttributeName;                           // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSubdivisionBaseSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSubdivisionBaseSettings")
	}
	static class UPCGSubdivisionBaseSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSubdivisionBaseSettings>();
	}
};
DUMPER7_ASSERTS_UPCGSubdivisionBaseSettings;

// Class PCG.PCGSubdivideSegmentSettings
// 0x0060 (0x01F8 - 0x0198)
class UPCGSubdivideSegmentSettings final : public UPCGSubdivisionBaseSettings
{
public:
	EPCGSplitAxis                                 SubdivisionAxis;                                   // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlipAxisAsAttribute;                              // 0x019C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldFlipAxis;                                   // 0x019D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19E[0x2];                                      // 0x019E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     FlipAxisAttribute;                                 // 0x01A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAcceptIncompleteSubdivision;                      // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputModuleIndexAttribute;                       // 0x01C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ModuleIndexAttributeName;                          // 0x01CC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputExtremityAttributes;                        // 0x01D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   IsFirstAttributeName;                              // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   IsFinalAttributeName;                              // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputExtremityNeighborIndexAttribute;            // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ExtremityNeighborIndexAttributeName;               // 0x01EC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSubdivideSegmentSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSubdivideSegmentSettings")
	}
	static class UPCGSubdivideSegmentSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSubdivideSegmentSettings>();
	}
};
DUMPER7_ASSERTS_UPCGSubdivideSegmentSettings;

// Class PCG.PCGAddTagSettings
// 0x0038 (0x00F0 - 0x00B8)
class UPCGAddTagSettings final : public UPCGSettings
{
public:
	class FString                                 TagsToAdd;                                         // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Prefix;                                            // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Suffix;                                            // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreTagValueParsing;                            // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTokenizeOnWhiteSpace;                             // 0x00E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAddTagSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAddTagSettings")
	}
	static class UPCGAddTagSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAddTagSettings>();
	}
};
DUMPER7_ASSERTS_UPCGAddTagSettings;

// Class PCG.PCGApplyOnActorSettings
// 0x0050 (0x0108 - 0x00B8)
class UPCGApplyOnActorSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     ObjectReferenceAttribute;                          // 0x00B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPCGObjectPropertyOverrideDescription> PropertyOverrideDescriptions;               // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           PostProcessFunctionNames;                          // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bSilenceErrorOnEmptyObjectPath;                    // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSynchronousLoad;                                  // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGApplyOnActorSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGApplyOnActorSettings")
	}
	static class UPCGApplyOnActorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGApplyOnActorSettings>();
	}
};
DUMPER7_ASSERTS_UPCGApplyOnActorSettings;

// Class PCG.PCGBaseSubgraphSettings
// 0x0000 (0x00B8 - 0x00B8)
class UPCGBaseSubgraphSettings : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGBaseSubgraphSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGBaseSubgraphSettings")
	}
	static class UPCGBaseSubgraphSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBaseSubgraphSettings>();
	}
};
DUMPER7_ASSERTS_UPCGBaseSubgraphSettings;

// Class PCG.PCGSubgraphSettings
// 0x0010 (0x00C8 - 0x00B8)
class UPCGSubgraphSettings : public UPCGBaseSubgraphSettings
{
public:
	class UPCGGraphInstance*                      SubgraphInstance;                                  // 0x00B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UPCGGraphInterface*                     SubgraphOverride;                                  // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSubgraphSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSubgraphSettings")
	}
	static class UPCGSubgraphSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSubgraphSettings>();
	}
};
DUMPER7_ASSERTS_UPCGSubgraphSettings;

// Class PCG.PCGApplyScaleToBoundsSettings
// 0x0000 (0x00B8 - 0x00B8)
class UPCGApplyScaleToBoundsSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGApplyScaleToBoundsSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGApplyScaleToBoundsSettings")
	}
	static class UPCGApplyScaleToBoundsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGApplyScaleToBoundsSettings>();
	}
};
DUMPER7_ASSERTS_UPCGApplyScaleToBoundsSettings;

// Class PCG.PCGAssetExporter
// 0x0000 (0x0028 - 0x0028)
class UPCGAssetExporter : public UObject
{
public:
	bool BP_ExportToAsset(class UPCGDataAsset* Asset);

	TSubclassOf<class UPCGDataAsset> BP_GetAssetType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAssetExporter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAssetExporter")
	}
	static class UPCGAssetExporter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAssetExporter>();
	}
};
DUMPER7_ASSERTS_UPCGAssetExporter;

// Class PCG.PCGComputeGraphSettings
// 0x0008 (0x00C0 - 0x00B8)
class UPCGComputeGraphSettings final : public UPCGSettings
{
public:
	int32                                         ComputeGraphIndex;                                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGComputeGraphSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGComputeGraphSettings")
	}
	static class UPCGComputeGraphSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGComputeGraphSettings>();
	}
};
DUMPER7_ASSERTS_UPCGComputeGraphSettings;

// Class PCG.PCGAssetExporterUtils
// 0x0000 (0x0028 - 0x0028)
class UPCGAssetExporterUtils final : public UBlueprintFunctionLibrary
{
public:
	static class UPackage* CreateAsset(class UPCGAssetExporter* Exporter, const struct FPCGAssetExporterParameters& Parameters);
	static void UpdateAssets(const TArray<struct FAssetData>& PCGAssets, const struct FPCGAssetExporterParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAssetExporterUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAssetExporterUtils")
	}
	static class UPCGAssetExporterUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAssetExporterUtils>();
	}
};
DUMPER7_ASSERTS_UPCGAssetExporterUtils;

// Class PCG.PCGAttractSettings
// 0x0150 (0x0208 - 0x00B8)
class UPCGAttractSettings final : public UPCGSettings
{
public:
	EPCGAttractMode                               Mode;                                              // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     AttractorIndexAttribute;                           // 0x00C0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Distance;                                          // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveUnattractedPoints;                          // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     TargetAttribute;                                   // 0x00F8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSourceWeight;                                  // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     SourceWeightAttribute;                             // 0x0128(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTargetWeight;                                  // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     TargetWeightAttribute;                             // 0x0158(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Weight;                                            // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FPCGAttributePropertyInputSelector, struct FPCGAttributePropertyInputSelector> SourceAndTargetAttributeMapping; // 0x0188(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bOutputAttractIndex;                               // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyOutputNoSourceSelector OutputAttractIndexAttribute;                  // 0x01E0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttractSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttractSettings")
	}
	static class UPCGAttractSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttractSettings>();
	}
};
DUMPER7_ASSERTS_UPCGAttractSettings;

// Class PCG.PCGPointExtentsModifierSettings
// 0x0020 (0x00D8 - 0x00B8)
class UPCGPointExtentsModifierSettings final : public UPCGSettings
{
public:
	struct FVector                                Extents;                                           // 0x00B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGPointExtentsModifierMode                  Mode;                                              // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGPointExtentsModifierSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGPointExtentsModifierSettings")
	}
	static class UPCGPointExtentsModifierSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGPointExtentsModifierSettings>();
	}
};
DUMPER7_ASSERTS_UPCGPointExtentsModifierSettings;

// Class PCG.PCGAttributeCastSettings
// 0x0058 (0x0110 - 0x00B8)
class UPCGAttributeCastSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x00B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGMetadataTypes                             OutputType;                                        // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyOutputSelector    OutputTarget;                                      // 0x00E8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributeCastSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributeCastSettings")
	}
	static class UPCGAttributeCastSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeCastSettings>();
	}
};
DUMPER7_ASSERTS_UPCGAttributeCastSettings;

// Class PCG.PCGAttributeExtractorTestObject
// 0x0008 (0x0030 - 0x0028)
class UPCGAttributeExtractorTestObject final : public UObject
{
public:
	double                                        DoubleValue;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributeExtractorTestObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributeExtractorTestObject")
	}
	static class UPCGAttributeExtractorTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeExtractorTestObject>();
	}
};
DUMPER7_ASSERTS_UPCGAttributeExtractorTestObject;

// Class PCG.PCGComputeDataInterface
// 0x0020 (0x0048 - 0x0028)
class UPCGComputeDataInterface : public UComputeDataInterface
{
public:
	class FName                                   OutputPinLabel;                                    // 0x0028(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   OutputPinLabelAlias;                               // 0x0030(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           DownstreamInputPinLabelAliases;                    // 0x0038(0x0010)(BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGComputeDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGComputeDataInterface")
	}
	static class UPCGComputeDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGComputeDataInterface>();
	}
};
DUMPER7_ASSERTS_UPCGComputeDataInterface;

// Class PCG.PCGCopyPointsDataInterface
// 0x0008 (0x0050 - 0x0048)
class UPCGCopyPointsDataInterface final : public UPCGComputeDataInterface
{
public:
	class UPCGSettings*                           Settings;                                          // 0x0048(0x0008)(BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGCopyPointsDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGCopyPointsDataInterface")
	}
	static class UPCGCopyPointsDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCopyPointsDataInterface>();
	}
};
DUMPER7_ASSERTS_UPCGCopyPointsDataInterface;

// Class PCG.PCGAttributeFilteringSettings
// 0x01E8 (0x02A0 - 0x00B8)
class UPCGAttributeFilteringSettings final : public UPCGSettings
{
public:
	EPCGAttributeFilterOperator                   Operator;                                          // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     TargetAttribute;                                   // 0x00C0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseConstantThreshold;                             // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     ThresholdAttribute;                                // 0x00F0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSpatialQuery;                                  // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGMetadataTypesConstantStruct        AttributeTypes;                                    // 0x0120(0x0170)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bWarnOnDataMissingAttribute;                       // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasSpatialToPointDeprecation;                     // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_292[0xE];                                      // 0x0292(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributeFilteringSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributeFilteringSettings")
	}
	static class UPCGAttributeFilteringSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeFilteringSettings>();
	}
};
DUMPER7_ASSERTS_UPCGAttributeFilteringSettings;

// Class PCG.PCGAttributeFilteringRangeSettings
// 0x0398 (0x0450 - 0x00B8)
class UPCGAttributeFilteringRangeSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     TargetAttribute;                                   // 0x00B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributeFilterThresholdSettings   MinThreshold;                                      // 0x00E0(0x01B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPCGAttributeFilterThresholdSettings   MaxThreshold;                                      // 0x0290(0x01B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bWarnOnDataMissingAttribute;                       // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasSpatialToPointDeprecation;                     // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_442[0xE];                                      // 0x0442(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributeFilteringRangeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributeFilteringRangeSettings")
	}
	static class UPCGAttributeFilteringRangeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeFilteringRangeSettings>();
	}
};
DUMPER7_ASSERTS_UPCGAttributeFilteringRangeSettings;

// Class PCG.PCGSpatialData
// 0x0048 (0x0080 - 0x0038)
class UPCGSpatialData : public UPCGData
{
public:
	TWeakObjectPtr<class AActor>                  TargetActor;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepZeroDensityPoints;                            // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGMetadata*                           MetaData;                                          // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	bool                                          bHasCachedLastSelector;                            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     CachedLastSelector;                                // 0x0058(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UPCGMetadata* CreateEmptyMetadata();
	void InitializeFromData(const class UPCGSpatialData* InSource, const class UPCGMetadata* InMetadataParentOverride, bool bInheritMetadata, bool bInheritAttributes);
	class UPCGMetadata* MutableMetadata();

	const class UPCGMetadata* ConstMetadata() const;
	struct FBox GetBounds() const;
	float GetDensityAtPosition(const struct FVector& InPosition) const;
	int32 GetDimension() const;
	struct FVector GetNormal() const;
	struct FBox GetStrictBounds() const;
	bool HasNonTrivialTransform() const;
	class UPCGIntersectionData* K2_IntersectWith(const class UPCGSpatialData* InOther) const;
	class UPCGSpatialData* K2_ProjectOn(const class UPCGSpatialData* InOther, const struct FPCGProjectionParams& InParams) const;
	bool K2_ProjectPoint(const struct FTransform& InTransform, const struct FBox& InBounds, const struct FPCGProjectionParams& InParams, struct FPCGPoint* OutPoint, class UPCGMetadata* OutMetadata) const;
	bool K2_SamplePoint(const struct FTransform& Transform, const struct FBox& Bounds, struct FPCGPoint* OutPoint, class UPCGMetadata* OutMetadata) const;
	class UPCGDifferenceData* K2_Subtract(const class UPCGSpatialData* InOther) const;
	class UPCGUnionData* K2_UnionWith(const class UPCGSpatialData* InOther) const;
	const class UPCGPointData* ToPointData() const;
	const class UPCGPointData* ToPointDataWithContext(struct FPCGContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSpatialData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSpatialData")
	}
	static class UPCGSpatialData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSpatialData>();
	}
};
DUMPER7_ASSERTS_UPCGSpatialData;

// Class PCG.PCGSpatialDataWithPointCache
// 0x0050 (0x00D0 - 0x0080)
class UPCGSpatialDataWithPointCache : public UPCGSpatialData
{
public:
	class UPCGPointData*                          CachedPointData;                                   // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<struct FBox>                           CachedBoundedPointDataBoxes;                       // 0x0088(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UPCGPointData*>                  CachedBoundedPointData;                            // 0x0098(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_A8[0x28];                                      // 0x00A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSpatialDataWithPointCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSpatialDataWithPointCache")
	}
	static class UPCGSpatialDataWithPointCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSpatialDataWithPointCache>();
	}
};
DUMPER7_ASSERTS_UPCGSpatialDataWithPointCache;

// Class PCG.PCGSurfaceData
// 0x00A0 (0x0170 - 0x00D0)
#pragma pack(push, 0x1)
class alignas(0x10) UPCGSurfaceData : public UPCGSpatialDataWithPointCache
{
public:
	struct FTransform                             Transform;                                         // 0x00D0(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox                                   LocalBounds;                                       // 0x0130(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGSurfaceData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGSurfaceData")
	}
	static class UPCGSurfaceData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSurfaceData>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UPCGSurfaceData;

// Class PCG.PCGBaseTextureData
// 0x00B0 (0x0220 - 0x0170)
#pragma pack(push, 0x1)
class alignas(0x10) UPCGBaseTextureData : public UPCGSurfaceData
{
public:
	bool                                          bUseDensitySourceChannel;                          // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGTextureColorChannel                       ColorChannel;                                      // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGTextureFilter                             Filter;                                            // 0x016A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16B[0x1];                                      // 0x016B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TexelSize;                                         // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAdvancedTiling;                                // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Tiling;                                            // 0x0178(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CenterOffset;                                      // 0x0188(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rotation;                                          // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTileBounds;                                    // 0x019C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox2D                                 TileBounds;                                        // 0x01A0(0x0028)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   ColorData;                                         // 0x01C8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FBox                                   Bounds;                                            // 0x01D8(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                         Height;                                            // 0x0210(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Width;                                             // 0x0214(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetDensityFunctionEquivalent(EPCGTextureDensityFunction DensityFunction);

	EPCGTextureDensityFunction GetDensityFunctionEquivalent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGBaseTextureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGBaseTextureData")
	}
	static class UPCGBaseTextureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBaseTextureData>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UPCGBaseTextureData;

// Class PCG.PCGTextureData
// 0x0050 (0x0270 - 0x0220)
class UPCGTextureData final : public UPCGBaseTextureData
{
public:
	TWeakObjectPtr<class UTexture>                Texture;                                           // 0x0218(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TextureIndex;                                      // 0x0220(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccessfullyInitialized;                          // 0x0224(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReadbackFromGPUInitiated;                         // 0x0225(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_226[0x4A];                                     // 0x0226(0x004A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGTextureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGTextureData")
	}
	static class UPCGTextureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGTextureData>();
	}
};
DUMPER7_ASSERTS_UPCGTextureData;

// Class PCG.PCGAttributePropertySelectorBlueprintHelpers
// 0x0000 (0x0028 - 0x0028)
class UPCGAttributePropertySelectorBlueprintHelpers final : public UBlueprintFunctionLibrary
{
public:
	static struct FPCGAttributePropertyInputSelector CopyAndFixLast(const struct FPCGAttributePropertyInputSelector& Selector, const class UPCGData* InData);
	static struct FPCGAttributePropertyOutputSelector CopyAndFixSource(const struct FPCGAttributePropertyOutputSelector& OutputSelector, const struct FPCGAttributePropertyInputSelector& InputSelector);
	static class FName GetAttributeName(const struct FPCGAttributePropertySelector& Selector);
	static const TArray<class FString> GetExtraNames(const struct FPCGAttributePropertySelector& Selector);
	static EPCGExtraProperties GetExtraProperty(const struct FPCGAttributePropertySelector& Selector);
	static class FName GetName(const struct FPCGAttributePropertySelector& Selector);
	static EPCGPointProperties GetPointProperty(const struct FPCGAttributePropertySelector& Selector);
	static EPCGAttributePropertySelection GetSelection(const struct FPCGAttributePropertySelector& Selector);
	static bool SetAttributeName(struct FPCGAttributePropertySelector& Selector, class FName InAttributeName);
	static bool SetExtraProperty(struct FPCGAttributePropertySelector& Selector, EPCGExtraProperties InExtraProperty);
	static bool SetPointProperty(struct FPCGAttributePropertySelector& Selector, EPCGPointProperties InPointProperty);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributePropertySelectorBlueprintHelpers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributePropertySelectorBlueprintHelpers")
	}
	static class UPCGAttributePropertySelectorBlueprintHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributePropertySelectorBlueprintHelpers>();
	}
};
DUMPER7_ASSERTS_UPCGAttributePropertySelectorBlueprintHelpers;

// Class PCG.PCGMetadataSettingsBase
// 0x0030 (0x00E8 - 0x00B8)
class UPCGMetadataSettingsBase : public UPCGSettings
{
public:
	struct FPCGAttributePropertyOutputSelector    OutputTarget;                                      // 0x00B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutputDataFromPin;                                 // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	TArray<class FName> GetOutputDataFromPinOptions() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGMetadataSettingsBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGMetadataSettingsBase")
	}
	static class UPCGMetadataSettingsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMetadataSettingsBase>();
	}
};
DUMPER7_ASSERTS_UPCGMetadataSettingsBase;

// Class PCG.PCGPolyLineData
// 0x0000 (0x00D0 - 0x00D0)
class UPCGPolyLineData : public UPCGSpatialDataWithPointCache
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGPolyLineData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGPolyLineData")
	}
	static class UPCGPolyLineData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGPolyLineData>();
	}
};
DUMPER7_ASSERTS_UPCGPolyLineData;

// Class PCG.PCGAttributeRemapSettings
// 0x0050 (0x0138 - 0x00E8)
class UPCGAttributeRemapSettings final : public UPCGMetadataSettingsBase
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x00E8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InRangeMin;                                        // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InRangeMax;                                        // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutRangeMin;                                       // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutRangeMax;                                       // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampToUnitRange;                                 // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreValuesOutsideInputRange;                    // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInverseRange;                                // 0x0132(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributeRemapSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributeRemapSettings")
	}
	static class UPCGAttributeRemapSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeRemapSettings>();
	}
};
DUMPER7_ASSERTS_UPCGAttributeRemapSettings;

// Class PCG.PCGAttributeRemoveDuplicatesSettings
// 0x0020 (0x00D8 - 0x00B8)
class UPCGAttributeRemoveDuplicatesSettings final : public UPCGSettings
{
public:
	TArray<struct FPCGAttributePropertyInputSelector> AttributeSelectors;                            // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 AttributeNamesToRemoveDuplicates;                  // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PCGAttributeRemoveDuplicatesSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PCGAttributeRemoveDuplicatesSettings")
	}
	static class UPCGAttributeRemoveDuplicatesSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeRemoveDuplicatesSettings>();
	}
};
DUMPER7_ASSERTS_UPCGAttributeRemoveDuplicatesSettings;

// Class PCG.PCGWorldRayHitData
// 0x0100 (0x0270 - 0x0170)
class UPCGWorldRayHitData final : public UPCGSurfaceData
{
public:
	TWeakObjectPtr<class UWorld>                  World;                                             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UPCGComponent>           OriginatingComponent;                              // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   Bounds;                                            // 0x0178(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPCGWorldRayHitQueryParams             QueryParams;                                       // 0x01B0(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
