#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PCG_structs.hpp"


namespace SDK::Params
{

// Function PCG.PCGSettings.BP_GetTypeUnionOfIncidentEdges
// 0x000C (0x000C - 0x0000)
struct PCGSettings_BP_GetTypeUnionOfIncidentEdges final
{
public:
	class FName                                   PinLabel;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSettings_BP_GetTypeUnionOfIncidentEdges;

// Function PCG.PCGSettings.UseSeed
// 0x0001 (0x0001 - 0x0000)
struct PCGSettings_UseSeed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSettings_UseSeed;

// Function PCG.PCGAssetExporter.BP_ExportToAsset
// 0x0010 (0x0010 - 0x0000)
struct PCGAssetExporter_BP_ExportToAsset final
{
public:
	class UPCGDataAsset*                          Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGAssetExporter_BP_ExportToAsset;

// Function PCG.PCGAssetExporter.BP_GetAssetType
// 0x0008 (0x0008 - 0x0000)
struct PCGAssetExporter_BP_GetAssetType final
{
public:
	TSubclassOf<class UPCGDataAsset>              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGAssetExporter_BP_GetAssetType;

// Function PCG.PCGAssetExporterUtils.CreateAsset
// 0x0040 (0x0040 - 0x0000)
struct PCGAssetExporterUtils_CreateAsset final
{
public:
	class UPCGAssetExporter*                      Exporter;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAssetExporterParameters            Parameters;                                        // 0x0008(0x0030)(Parm, NativeAccessSpecifierPublic)
	class UPackage*                               ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGAssetExporterUtils_CreateAsset;

// Function PCG.PCGAssetExporterUtils.UpdateAssets
// 0x0040 (0x0040 - 0x0000)
struct PCGAssetExporterUtils_UpdateAssets final
{
public:
	TArray<struct FAssetData>                     PCGAssets;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPCGAssetExporterParameters            Parameters;                                        // 0x0010(0x0030)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGAssetExporterUtils_UpdateAssets;

// Function PCG.PCGSpatialData.CreateEmptyMetadata
// 0x0008 (0x0008 - 0x0000)
struct PCGSpatialData_CreateEmptyMetadata final
{
public:
	class UPCGMetadata*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_CreateEmptyMetadata;

// Function PCG.PCGSpatialData.InitializeFromData
// 0x0018 (0x0018 - 0x0000)
struct PCGSpatialData_InitializeFromData final
{
public:
	const class UPCGSpatialData*                  InSource;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UPCGMetadata*                     InMetadataParentOverride;                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInheritMetadata;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInheritAttributes;                                // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGSpatialData_InitializeFromData;

// Function PCG.PCGSpatialData.MutableMetadata
// 0x0008 (0x0008 - 0x0000)
struct PCGSpatialData_MutableMetadata final
{
public:
	class UPCGMetadata*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_MutableMetadata;

// Function PCG.PCGSpatialData.ConstMetadata
// 0x0008 (0x0008 - 0x0000)
struct PCGSpatialData_ConstMetadata final
{
public:
	const class UPCGMetadata*                     ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_ConstMetadata;

// Function PCG.PCGSpatialData.GetBounds
// 0x0038 (0x0038 - 0x0000)
struct PCGSpatialData_GetBounds final
{
public:
	struct FBox                                   ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_GetBounds;

// Function PCG.PCGSpatialData.GetDensityAtPosition
// 0x0020 (0x0020 - 0x0000)
struct PCGSpatialData_GetDensityAtPosition final
{
public:
	struct FVector                                InPosition;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGSpatialData_GetDensityAtPosition;

// Function PCG.PCGSpatialData.GetDimension
// 0x0004 (0x0004 - 0x0000)
struct PCGSpatialData_GetDimension final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_GetDimension;

// Function PCG.PCGSpatialData.GetNormal
// 0x0018 (0x0018 - 0x0000)
struct PCGSpatialData_GetNormal final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_GetNormal;

// Function PCG.PCGSpatialData.GetStrictBounds
// 0x0038 (0x0038 - 0x0000)
struct PCGSpatialData_GetStrictBounds final
{
public:
	struct FBox                                   ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_GetStrictBounds;

// Function PCG.PCGSpatialData.HasNonTrivialTransform
// 0x0001 (0x0001 - 0x0000)
struct PCGSpatialData_HasNonTrivialTransform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_HasNonTrivialTransform;

// Function PCG.PCGSpatialData.K2_IntersectWith
// 0x0010 (0x0010 - 0x0000)
struct PCGSpatialData_K2_IntersectWith final
{
public:
	const class UPCGSpatialData*                  InOther;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCGIntersectionData*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_K2_IntersectWith;

// Function PCG.PCGSpatialData.K2_ProjectOn
// 0x0030 (0x0030 - 0x0000)
struct PCGSpatialData_K2_ProjectOn final
{
public:
	const class UPCGSpatialData*                  InOther;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGProjectionParams                   InParams;                                          // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UPCGSpatialData*                        ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_K2_ProjectOn;

// Function PCG.PCGSpatialData.K2_ProjectPoint
// 0x01A0 (0x01A0 - 0x0000)
struct PCGSpatialData_K2_ProjectPoint final
{
public:
	struct FTransform                             InTransform;                                       // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   InBounds;                                          // 0x0060(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPCGProjectionParams                   InParams;                                          // 0x0098(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGPoint                              OutPoint;                                          // 0x00C0(0x00D0)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	class UPCGMetadata*                           OutMetadata;                                       // 0x0190(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0198(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGSpatialData_K2_ProjectPoint;

// Function PCG.PCGSpatialData.K2_SamplePoint
// 0x0180 (0x0180 - 0x0000)
struct PCGSpatialData_K2_SamplePoint final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   Bounds;                                            // 0x0060(0x0038)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGPoint                              OutPoint;                                          // 0x00A0(0x00D0)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	class UPCGMetadata*                           OutMetadata;                                       // 0x0170(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0178(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGSpatialData_K2_SamplePoint;

// Function PCG.PCGSpatialData.K2_Subtract
// 0x0010 (0x0010 - 0x0000)
struct PCGSpatialData_K2_Subtract final
{
public:
	const class UPCGSpatialData*                  InOther;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCGDifferenceData*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_K2_Subtract;

// Function PCG.PCGSpatialData.K2_UnionWith
// 0x0010 (0x0010 - 0x0000)
struct PCGSpatialData_K2_UnionWith final
{
public:
	const class UPCGSpatialData*                  InOther;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCGUnionData*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_K2_UnionWith;

// Function PCG.PCGSpatialData.ToPointData
// 0x0008 (0x0008 - 0x0000)
struct PCGSpatialData_ToPointData final
{
public:
	const class UPCGPointData*                    ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_ToPointData;

// Function PCG.PCGSpatialData.ToPointDataWithContext
// 0x01C0 (0x01C0 - 0x0000)
struct PCGSpatialData_ToPointDataWithContext final
{
public:
	struct FPCGContext                            Context;                                           // 0x0000(0x01B8)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UPCGPointData*                    ReturnValue;                                       // 0x01B8(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGSpatialData_ToPointDataWithContext;

// Function PCG.PCGBaseTextureData.SetDensityFunctionEquivalent
// 0x0001 (0x0001 - 0x0000)
struct PCGBaseTextureData_SetDensityFunctionEquivalent final
{
public:
	EPCGTextureDensityFunction                    DensityFunction;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGBaseTextureData_SetDensityFunctionEquivalent;

// Function PCG.PCGBaseTextureData.GetDensityFunctionEquivalent
// 0x0001 (0x0001 - 0x0000)
struct PCGBaseTextureData_GetDensityFunctionEquivalent final
{
public:
	EPCGTextureDensityFunction                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGBaseTextureData_GetDensityFunctionEquivalent;

// Function PCG.PCGRenderTargetData.Initialize
// 0x0070 (0x0070 - 0x0000)
struct PCGRenderTargetData_Initialize final
{
public:
	class UTextureRenderTarget2D*                 InRenderTarget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InTransform;                                       // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGRenderTargetData_Initialize;

// Function PCG.PCGDifferenceData.Initialize
// 0x0008 (0x0008 - 0x0000)
struct PCGDifferenceData_Initialize final
{
public:
	const class UPCGSpatialData*                  InData;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGDifferenceData_Initialize;

// Function PCG.PCGDifferenceData.K2_AddDifference
// 0x0008 (0x0008 - 0x0000)
struct PCGDifferenceData_K2_AddDifference final
{
public:
	const class UPCGSpatialData*                  InDifference;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGDifferenceData_K2_AddDifference;

// Function PCG.PCGDifferenceData.SetDensityFunction
// 0x0001 (0x0001 - 0x0000)
struct PCGDifferenceData_SetDensityFunction final
{
public:
	EPCGDifferenceDensityFunction                 InDensityFunction;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGDifferenceData_SetDensityFunction;

// Function PCG.PCGAttributePropertySelectorBlueprintHelpers.CopyAndFixLast
// 0x0058 (0x0058 - 0x0000)
struct PCGAttributePropertySelectorBlueprintHelpers_CopyAndFixLast final
{
public:
	struct FPCGAttributePropertyInputSelector     Selector;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UPCGData*                         InData;                                            // 0x0028(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyInputSelector     ReturnValue;                                       // 0x0030(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGAttributePropertySelectorBlueprintHelpers_CopyAndFixLast;

// Function PCG.PCGAttributePropertySelectorBlueprintHelpers.CopyAndFixSource
// 0x0078 (0x0078 - 0x0000)
struct PCGAttributePropertySelectorBlueprintHelpers_CopyAndFixSource final
{
public:
	struct FPCGAttributePropertyOutputSelector    OutputSelector;                                    // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyInputSelector     InputSelector;                                     // 0x0028(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyOutputSelector    ReturnValue;                                       // 0x0050(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGAttributePropertySelectorBlueprintHelpers_CopyAndFixSource;

// Function PCG.PCGAttributePropertySelectorBlueprintHelpers.GetAttributeName
// 0x0030 (0x0030 - 0x0000)
struct PCGAttributePropertySelectorBlueprintHelpers_GetAttributeName final
{
public:
	struct FPCGAttributePropertySelector          Selector;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGAttributePropertySelectorBlueprintHelpers_GetAttributeName;

// Function PCG.PCGAttributePropertySelectorBlueprintHelpers.GetExtraNames
// 0x0038 (0x0038 - 0x0000)
struct PCGAttributePropertySelectorBlueprintHelpers_GetExtraNames final
{
public:
	struct FPCGAttributePropertySelector          Selector;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGAttributePropertySelectorBlueprintHelpers_GetExtraNames;

// Function PCG.PCGAttributePropertySelectorBlueprintHelpers.GetExtraProperty
// 0x0030 (0x0030 - 0x0000)
struct PCGAttributePropertySelectorBlueprintHelpers_GetExtraProperty final
{
public:
	struct FPCGAttributePropertySelector          Selector;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGExtraProperties                           ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGAttributePropertySelectorBlueprintHelpers_GetExtraProperty;

// Function PCG.PCGAttributePropertySelectorBlueprintHelpers.GetName
// 0x0030 (0x0030 - 0x0000)
struct PCGAttributePropertySelectorBlueprintHelpers_GetName final
{
public:
	struct FPCGAttributePropertySelector          Selector;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGAttributePropertySelectorBlueprintHelpers_GetName;

// Function PCG.PCGAttributePropertySelectorBlueprintHelpers.GetPointProperty
// 0x0030 (0x0030 - 0x0000)
struct PCGAttributePropertySelectorBlueprintHelpers_GetPointProperty final
{
public:
	struct FPCGAttributePropertySelector          Selector;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGPointProperties                           ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGAttributePropertySelectorBlueprintHelpers_GetPointProperty;

// Function PCG.PCGAttributePropertySelectorBlueprintHelpers.GetSelection
// 0x0030 (0x0030 - 0x0000)
struct PCGAttributePropertySelectorBlueprintHelpers_GetSelection final
{
public:
	struct FPCGAttributePropertySelector          Selector;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGAttributePropertySelection                ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGAttributePropertySelectorBlueprintHelpers_GetSelection;

// Function PCG.PCGAttributePropertySelectorBlueprintHelpers.SetAttributeName
// 0x0038 (0x0038 - 0x0000)
struct PCGAttributePropertySelectorBlueprintHelpers_SetAttributeName final
{
public:
	struct FPCGAttributePropertySelector          Selector;                                          // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InAttributeName;                                   // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGAttributePropertySelectorBlueprintHelpers_SetAttributeName;

// Function PCG.PCGAttributePropertySelectorBlueprintHelpers.SetExtraProperty
// 0x0030 (0x0030 - 0x0000)
struct PCGAttributePropertySelectorBlueprintHelpers_SetExtraProperty final
{
public:
	struct FPCGAttributePropertySelector          Selector;                                          // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGExtraProperties                           InExtraProperty;                                   // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGAttributePropertySelectorBlueprintHelpers_SetExtraProperty;

// Function PCG.PCGAttributePropertySelectorBlueprintHelpers.SetPointProperty
// 0x0030 (0x0030 - 0x0000)
struct PCGAttributePropertySelectorBlueprintHelpers_SetPointProperty final
{
public:
	struct FPCGAttributePropertySelector          Selector;                                          // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGPointProperties                           InPointProperty;                                   // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGAttributePropertySelectorBlueprintHelpers_SetPointProperty;

// Function PCG.PCGMetadataSettingsBase.GetOutputDataFromPinOptions
// 0x0010 (0x0010 - 0x0000)
struct PCGMetadataSettingsBase_GetOutputDataFromPinOptions final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGMetadataSettingsBase_GetOutputDataFromPinOptions;

// Function PCG.PCGPartitionActor.GetLocalComponent
// 0x0010 (0x0010 - 0x0000)
struct PCGPartitionActor_GetLocalComponent final
{
public:
	const class UPCGComponent*                    OriginalComponent;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCGComponent*                          ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGPartitionActor_GetLocalComponent;

// Function PCG.PCGPartitionActor.GetOriginalComponent
// 0x0010 (0x0010 - 0x0000)
struct PCGPartitionActor_GetOriginalComponent final
{
public:
	const class UPCGComponent*                    LocalComponent;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCGComponent*                          ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGPartitionActor_GetOriginalComponent;

// Function PCG.PCGManagedComponent.SetGeneratedComponentFromBP
// 0x0028 (0x0028 - 0x0000)
struct PCGManagedComponent_SetGeneratedComponentFromBP final
{
public:
	TSoftObjectPtr<class UActorComponent>         InGeneratedComponent;                              // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGManagedComponent_SetGeneratedComponentFromBP;

// Function PCG.PCGPointData.CopyPointsFrom
// 0x0018 (0x0018 - 0x0000)
struct PCGPointData_CopyPointsFrom final
{
public:
	const class UPCGPointData*                    InData;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 InDataIndices;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGPointData_CopyPointsFrom;

// Function PCG.PCGPointData.SetPoints
// 0x0010 (0x0010 - 0x0000)
struct PCGPointData_SetPoints final
{
public:
	TArray<struct FPCGPoint>                      InPoints;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGPointData_SetPoints;

// Function PCG.PCGPointData.GetNumPoints
// 0x0004 (0x0004 - 0x0000)
struct PCGPointData_GetNumPoints final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGPointData_GetNumPoints;

// Function PCG.PCGPointData.GetPoint
// 0x00E0 (0x00E0 - 0x0000)
struct PCGPointData_GetPoint final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGPoint                              ReturnValue;                                       // 0x0010(0x00D0)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGPointData_GetPoint;

// Function PCG.PCGPointData.GetPoints
// 0x0010 (0x0010 - 0x0000)
struct PCGPointData_GetPoints final
{
public:
	TArray<struct FPCGPoint>                      ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGPointData_GetPoints;

// Function PCG.PCGPointData.GetPointsCopy
// 0x0010 (0x0010 - 0x0000)
struct PCGPointData_GetPointsCopy final
{
public:
	TArray<struct FPCGPoint>                      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGPointData_GetPointsCopy;

// Function PCG.PCGPointData.IsEmpty
// 0x0001 (0x0001 - 0x0000)
struct PCGPointData_IsEmpty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGPointData_IsEmpty;

// Function PCG.PCGGraphParametersHelpers.GetBoolParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_GetBoolParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetBoolParameter;

// Function PCG.PCGGraphParametersHelpers.GetByteParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_GetByteParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetByteParameter;

// Function PCG.PCGGraphParametersHelpers.GetClassParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_GetClassParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetClassParameter;

// Function PCG.PCGGraphParametersHelpers.GetDoubleParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_GetDoubleParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetDoubleParameter;

// Function PCG.PCGGraphParametersHelpers.GetEnumParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_GetEnumParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetEnumParameter;

// Function PCG.PCGGraphParametersHelpers.GetFloatParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_GetFloatParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetFloatParameter;

// Function PCG.PCGGraphParametersHelpers.GetInt32Parameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_GetInt32Parameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetInt32Parameter;

// Function PCG.PCGGraphParametersHelpers.GetInt64Parameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_GetInt64Parameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetInt64Parameter;

// Function PCG.PCGGraphParametersHelpers.GetNameParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_GetNameParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetNameParameter;

// Function PCG.PCGGraphParametersHelpers.GetObjectParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_GetObjectParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetObjectParameter;

// Function PCG.PCGGraphParametersHelpers.GetQuaternionParameter
// 0x0030 (0x0030 - 0x0000)
struct PCGGraphParametersHelpers_GetQuaternionParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetQuaternionParameter;

// Function PCG.PCGGraphParametersHelpers.GetRotatorParameter
// 0x0028 (0x0028 - 0x0000)
struct PCGGraphParametersHelpers_GetRotatorParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetRotatorParameter;

// Function PCG.PCGGraphParametersHelpers.GetSoftClassParameter
// 0x0038 (0x0038 - 0x0000)
struct PCGGraphParametersHelpers_GetSoftClassParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetSoftClassParameter;

// Function PCG.PCGGraphParametersHelpers.GetSoftObjectParameter
// 0x0038 (0x0038 - 0x0000)
struct PCGGraphParametersHelpers_GetSoftObjectParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetSoftObjectParameter;

// Function PCG.PCGGraphParametersHelpers.GetSoftObjectPathParameter
// 0x0030 (0x0030 - 0x0000)
struct PCGGraphParametersHelpers_GetSoftObjectPathParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetSoftObjectPathParameter;

// Function PCG.PCGGraphParametersHelpers.GetStringParameter
// 0x0020 (0x0020 - 0x0000)
struct PCGGraphParametersHelpers_GetStringParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetStringParameter;

// Function PCG.PCGGraphParametersHelpers.GetTransformParameter
// 0x0070 (0x0070 - 0x0000)
struct PCGGraphParametersHelpers_GetTransformParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetTransformParameter;

// Function PCG.PCGGraphParametersHelpers.GetVector2DParameter
// 0x0020 (0x0020 - 0x0000)
struct PCGGraphParametersHelpers_GetVector2DParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetVector2DParameter;

// Function PCG.PCGGraphParametersHelpers.GetVector4Parameter
// 0x0030 (0x0030 - 0x0000)
struct PCGGraphParametersHelpers_GetVector4Parameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetVector4Parameter;

// Function PCG.PCGGraphParametersHelpers.GetVectorParameter
// 0x0028 (0x0028 - 0x0000)
struct PCGGraphParametersHelpers_GetVectorParameter final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_GetVectorParameter;

// Function PCG.PCGGraphParametersHelpers.IsOverridden
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_IsOverridden final
{
public:
	const class UPCGGraphInterface*               GraphInterface;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_IsOverridden;

// Function PCG.PCGGraphParametersHelpers.SetBoolParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_SetBoolParameter final
{
public:
	class UPCGGraphInterface*                     GraphInterface;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_SetBoolParameter;

// Function PCG.PCGGraphParametersHelpers.SetByteParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_SetByteParameter final
{
public:
	class UPCGGraphInterface*                     GraphInterface;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Value;                                             // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_SetByteParameter;

// Function PCG.PCGGraphParametersHelpers.SetClassParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_SetClassParameter final
{
public:
	class UPCGGraphInterface*                     GraphInterface;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_SetClassParameter;

// Function PCG.PCGGraphParametersHelpers.SetDoubleParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_SetDoubleParameter final
{
public:
	class UPCGGraphInterface*                     GraphInterface;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Value;                                             // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_SetDoubleParameter;

// Function PCG.PCGGraphParametersHelpers.SetEnumParameter
// 0x0020 (0x0020 - 0x0000)
struct PCGGraphParametersHelpers_SetEnumParameter final
{
public:
	class UPCGGraphInterface*                     GraphInterface;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Value;                                             // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UEnum*                            Enum;                                              // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PCGGraphParametersHelpers_SetEnumParameter;

// Function PCG.PCGGraphParametersHelpers.SetFloatParameter
// 0x0018 (0x0018 - 0x0000)
struct PCGGraphParametersHelpers_SetFloatParameter final
{
public:
	class UPCGGraphInterface*                     GraphInterface;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
