#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPawnTest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"
#include "Enum_VoiceCollectionLine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerPawnTest.PlayerPawnTest_C
// 0x01D0 (0x2680 - 0x24B0)
class APlayerPawnTest_C final : public AShooterCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x24B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAC_FaceCustomization_C*                AC_FaceCustomization;                              // 0x24B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SecondaryImplantTPVSkeletalMesh;                   // 0x24C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ImplantTPVSkeletalMesh;                            // 0x24C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base_RightFoot_FI;    // 0x24D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base_LeftFoot_FI;     // 0x24D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base_Torso_FI;        // 0x24E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base_RightFoot;       // 0x24E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base_LeftFoot;        // 0x24F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base_RightArm;        // 0x24F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base1_Head;           // 0x2500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base1_LeftArm;        // 0x2508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base_Torso;           // 0x2510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNS_DinoFootprint_BP_C*                 NS_DinoFootprint_BP;                               // 0x2518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base_HandR_FPV;       // 0x2520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base_HandL_FPV;       // 0x2528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_PrimalWindSourceComponent_Base_C*   BP_PrimalWindSourceComponent_Base_TorsoFPV;        // 0x2530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SecondaryMesh1P;                                   // 0x2538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       StasisComponent;                                   // 0x2540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPrimalInventoryComponent*              PrimalInventory1;                                  // 0x2548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         NumAscensions;                                     // 0x2550(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2554[0x4];                                     // 0x2554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   AscensionMeshesFPV;                                // 0x2558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UStaticMesh>>     AscensionMeshesTPV;                                // 0x2568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         AlphaAscensionEngrams;                             // 0x2578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NumAscensionsAb;                                   // 0x2588(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_258C[0x4];                                     // 0x258C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UStaticMesh>>     AscensionMeshesTPV_Ab;                             // 0x2590(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   AscensionMeshesFPV_Ab;                             // 0x25A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   TestAscensionBossNameTag;                          // 0x25B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UStaticMesh>>     AscensionMeshesTPV_Ext;                            // 0x25B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   AscensionMeshesFPV_Ext;                            // 0x25C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NumAscensionsExt;                                  // 0x25D8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25DC[0x4];                                     // 0x25DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CurrentDome;                                       // 0x25E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 Current_Cruise_Missile_Message;                    // 0x25E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         NumChibiLevelUps;                                  // 0x25F8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumAscensionsGenesis;                              // 0x25FC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumAscensionsGen2;                                 // 0x2600(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnlockedAllExplorerNotes;                         // 0x2604(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasSetupMeshes;                                   // 0x2605(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2606[0x2];                                     // 0x2606(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 RestrictedLevelsBasedOnUnobtainedGeneralizedAchievementTags; // 0x2608(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<class FName>                           GeneralizedUnlockedAchievementTags;                // 0x2618(0x0010)(Edit, BlueprintVisible, Net, Transient, DisableEditOnInstance, SaveGame)
	int32                                         NumAscensionsScorched;                             // 0x2628(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262C[0x4];                                     // 0x262C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   AscensionSkeletalMeshesTPV;                        // 0x2630(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   AscensionSkeletalMeshesTPV_Ext;                    // 0x2640(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   AscensionSkeletalMeshesTPV_AB;                     // 0x2650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsCheatAscending;                                 // 0x2660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2661[0x3];                                     // 0x2661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastAscendIndex;                                   // 0x2664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLastAscendWasImmediate;                           // 0x2668(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUnlockedAllBTT1ExplorerNotes;                     // 0x2669(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUnlockedAllBTT2ExplorerNotes;                     // 0x266A(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUnlockedAllBTT3ExplorerNotes;                     // 0x266B(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_266C[0x4];                                     // 0x266C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CurrentMeshToCustomization;                        // 0x2670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         NumAscensionsLostColony;                           // 0x2678(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AscensionCheck();
	void AssignAssetsFromVoiceCollection();
	void BPApplyBodyColors(class USkeletalMeshComponent* toMesh);
	void BPApplyPreviewData(class USkeletalMeshComponent* toMesh);
	bool BPCustomRequest(class FName RequestName, int32* OutIndex, int32 InIndex, class AActor* FromActor);
	bool BPGetCustomBlueprintData(class FName DataName, const struct FBPNetExecParams& InData, struct FBPNetExecParams* OutData);
	void BPGetOverrideCameraInterpSpeed(float DefaultTPVCameraSpeedInterpolationMultiplier, float DefaultTPVOffsetInterpSpeed, float* TPVCameraSpeedInterpolationMultiplier, float* TPVOffsetInterpSpeed);
	int32 BPGetPlayerHexagonCount();
	void BPGetShowDebugAnimationComponents(TArray<class USkeletalMeshComponent*>* SkelMeshComponents);
	bool BPOverrideCameraArmLength(const struct FPrimalCameraParams& CameraParams, float CurrentCameraArmLength, float& DesiredCameraArmLength);
	bool BPOverrideCameraArmLengthInterpParams(const struct FPrimalCameraParams& CameraParams, struct FPrimalCameraInterpParams& OutInterpParams);
	bool BPOverrideCameraDesiredPivotLocation(const struct FVector& CurrentCameraPivotLocation, struct FVector& DesiredCameraPivotLocation);
	bool BPOverrideCameraDesiredPivotOffset(const struct FPrimalCameraParams& CameraParams, struct FVector& DesiredCameraOffset);
	bool BPOverrideCameraDesiredPivotRotation(const struct FRotator& CurrentCameraPivotRotation, struct FRotator& DesiredCameraPivotRotation);
	bool BPOverrideCameraPivotLocationInterpParams(const struct FPrimalCameraParams& CameraParams, const struct FPrimalCameraPivotZInterpOverrides& PivotZInterpOverrides, const struct FPrimalCameraInterpParams& LastInterpParamsX, const struct FPrimalCameraInterpParams& LastInterpParamsY, const struct FPrimalCameraInterpParams& LastInterpParamsZ, struct FPrimalCameraInterpParams& OutInterpParamsX, struct FPrimalCameraInterpParams& OutInterpParamsY, struct FPrimalCameraInterpParams& OutInterpParamsZ);
	void BPSetFirstPersonMasterPoseComponent(class USkeletalMeshComponent* firstPersonMasterPosecomponent);
	bool BPSetPlayerHexagonCount(int32 NewHexagonCount);
	void BPSetupFirstPersonHandsMesh();
	void BPSpawnAttackerDamageImpactFX(class FName SocketName, class APrimalCharacter* VictimChar);
	void BPUnlockedAllBTTExplorerNotes(int32 exp);
	void BPUnlockedAllExplorerNotes();
	void ClientShowHUDNotification(const class FString& Text, const struct FLinearColor& Color, double LifetimeSeconds, double DisplayScale, class USoundCue* SoundToPlay);
	void DefeatedBoss(class APrimalDinoCharacter* BossCharacter, class FName BossTag, int32 BossDifficulty);
	void DisableFluidInteraction();
	void DontCreateAnyMoreSpawnUIs();
	void EnableFluidInteraction();
	void ExecuteUbergraph_PlayerPawnTest(int32 EntryPoint);
	struct FLinearColor GetFXBloodColor();
	void GetShooterHud(class AShooterHUD** ShooterHUD);
	void GetTheNumChibiLevelUps(int32* OutVal);
	void HasEquipToHideImplant(bool* ShouldHideImplant);
	void InterceptInputEvent(const class FString& InputName);
	void NetClientAscend(int32 AscendIndex, bool bImmediateAscend, bool bIsCheatAscend);
	void NetClientPreLoadAcension();
	void OnBossfightTeleport(class FName DataName);
	class FString PlayerCommand(const class FString& TheCommand);
	void ReceiveBeginPlay();
	void ServerAscend(int32 DifficultyIndex, bool bImmediateAscend, bool bSuppressAchievements, bool bIsCheatAscend);
	void SetGeneralizedUnlockedAchievementTags(TArray<class FName>& GeneralizedUnlockedAchievementTags_0);
	void SetNumChibiLevelUps(int32 NewNum);
	void SetupMeshes(bool bForce);
	void ShowHUDNotification(const class FString& Text, const struct FLinearColor& Color, double LifetimeSeconds, double DisplayScale, class USoundCue* SoundToPlay);
	void TrySpawnMound();
	void TrySpawnMoundEx(double Angle, double Range);
	void UpdateFace();
	void UserConstructionScript();

	void PlayVOLine(Enum_VoiceCollectionLine Voiceline, double VolumeMultiplier) const;
	void SelectVOSound(class UPDA_VoiceCollection_C* VoiceCollection, Enum_VoiceCollectionLine VoiceLineSelection, class USoundBase** VoiceSoundReference) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PlayerPawnTest_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerPawnTest_C")
	}
	static class APlayerPawnTest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerPawnTest_C>();
	}
};
DUMPER7_ASSERTS_APlayerPawnTest_C;

}

