#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItem_StartingNote

#include "Basic.hpp"

#include "PrimalItem_Note_classes.hpp"
#include "Engine_structs.hpp"
#include "ArrayOfStrings_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItem_StartingNote.PrimalItem_StartingNote_C
// 0x00E0 (0x0C40 - 0x0B60)
class UPrimalItem_StartingNote_C final : public UPrimalItem_Note_C
{
public:
	uint8                                         Pad_B53[0x5];                                      // 0x0B53(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UTexture2D*>                     AscensionIcons;                                    // 0x0B60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 LocalCustomItemDesc;                               // 0x0B70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FString>                         DifficultyStrings;                                 // 0x0B80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         BossStrings;                                       // 0x0B90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FArrayOfStrings>                BossPostStrings;                                   // 0x0BA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             LocalItemIcon;                                     // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     LocalAscensionIcons;                               // 0x0BB8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture2D*>                     SecondaryAscensionIcons;                           // 0x0BC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             SecondaryIcon;                                     // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     TertiaryAscensionIcons;                            // 0x0BE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             TertiaryIcon;                                      // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     QuaternaryAscensionIcons;                          // 0x0BF8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             QuaternaryIcon;                                    // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bResetHighlightTime;                               // 0x0C10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C11[0x7];                                      // 0x0C11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HighlightStartTime;                                // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HighlightTimeToEnableRespawn;                      // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     QuinaryAscensionIcons;                             // 0x0C28(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             QuinaryIcon;                                       // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintUsed();
	bool BPCanUse(bool bIgnoreCooldown);
	void BPDrawItemIcon(class UCanvas* ItemCanvas, const struct FVector2D& ItemCanvasSize, const struct FVector2D& ItemCanvasScale, bool bItemEnabled, const struct FLinearColor& TheTintColor);
	class FString BPGetItemDescription(const class FString& InDescription, bool bGetLongDescription, class AShooterPlayerController* ForPC);
	class UTexture2D* BPGetItemIcon(class AShooterPlayerController* ForPC);
	class FString BPGetItemName(const class FString& ItemNameIn, class AShooterPlayerController* ForPC);
	void BPOnUpdatedItemContextMenu();
	void BPPreInitializeItem(class UWorld* OptionalInitWorld);
	void ExecuteUbergraph_PrimalItem_StartingNote(int32 EntryPoint);
	void Get_Survival_Quotient_String(TArray<double>& SurvData, class FString* OutString);
	void IsLocalImplant(class AShooterPlayerController* ForPC, bool* IsLocal);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItem_StartingNote_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItem_StartingNote_C")
	}
	static class UPrimalItem_StartingNote_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItem_StartingNote_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItem_StartingNote_C;

}

