#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItemConsumable_TekCanteenCraftable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PrimalItemConsumableEatable_WaterContainer_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItemConsumable_TekCanteenCraftable.PrimalItemConsumable_TekCanteenCraftable_C
// 0x0090 (0x0BF0 - 0x0B60)
class UPrimalItemConsumable_TekCanteenCraftable_C final : public UPrimalItemConsumableEatable_WaterContainer_C
{
public:
	uint8                                         Pad_B53[0x5];                                      // 0x0B53(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        MaxShardPower;                                     // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PowerCostPerUse;                                   // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         UnpoweredBuffsToGive;                              // 0x0B70(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         PoweredBuffsToGive_Cold;                           // 0x0B80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         PoweredBuffsToGive_Hot;                            // 0x0B90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   DefaultWaterMode;                                  // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HotWaterBuffClearTag;                              // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ColdWaterBuffClearTag;                             // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HotWaterModeTextColor;                             // 0x0BB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColdWaterModeTextColor;                            // 0x0BC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NormalWaterModeTextColor;                          // 0x0BD8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShardPowerCost;                                 // 0x0BE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyUnpoweredBuffs();
	void BlueprintUsed();
	class FString BPGetCustomInventoryWidgetText();
	struct FColor BPGetCustomInventoryWidgetTextColor();
	void BPPostInitializeItem(class UWorld* OptionalInitWorld);
	void ExecuteUbergraph_PrimalItemConsumable_TekCanteenCraftable(int32 EntryPoint);
	void SelectedCustomContextMenuItem(const class FName& ContextItem, class AShooterPlayerController* ForPC);
	void SetShardDescription();
	void SetWaterMode(class FName NewWaterMode);
	void TryClearBuffs();
	void TryConsumeWithPower();

	void GetCurrentWaterMode(class FName* WaterMode) const;
	void GetElementShardValue(bool* HasData, double* Value) const;
	void HasEnoughPowerForUse(bool* bHasEnoughPower) const;
	bool IsCustomContextMenuItemEnabled(const class FName& ContextItem) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItemConsumable_TekCanteenCraftable_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItemConsumable_TekCanteenCraftable_C")
	}
	static class UPrimalItemConsumable_TekCanteenCraftable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItemConsumable_TekCanteenCraftable_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItemConsumable_TekCanteenCraftable_C;

}

