#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItemStructure_PlantPot_Base

#include "Basic.hpp"

#include "PrimalItemStructureGeneric_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItemStructure_PlantPot_Base.PrimalItemStructure_PlantPot_Base_C
// 0x0090 (0x0BF0 - 0x0B60)
class UPrimalItemStructure_PlantPot_Base_C : public UPrimalItemStructureGeneric_C
{
public:
	uint8                                         Pad_B53[0x5];                                      // 0x0B53(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<double, class FText>                     FoliageSizeCategoriesByVolume;                     // 0x0B60(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          AllowHidingPot;                                    // 0x0BB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB1[0x7];                                      // 0x0BB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             PlantPotUnfilledIcon;                              // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CropPlotUnfilledIcon;                              // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             PlantPotFilledIcon;                                // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CropPlotFilledIcon;                                // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   Hyphen_text;                                       // 0x0BD8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	class FString BPAllowCrafting(class AShooterPlayerController* ForPC);
	class UTexture2D* BPGetItemIcon(class AShooterPlayerController* ForPC);
	class FString BPGetItemName(const class FString& ItemNameIn, class AShooterPlayerController* ForPC);
	void ExecuteUbergraph_PrimalItemStructure_PlantPot_Base(int32 EntryPoint);
	void GetCategoryByFoliageVolume(bool* HasFoliage, int32* FoliageCategoryIndex, class FString* FoliageCategoryString, double* FoliageVolume, double* FoliageHeight);
	void SelectedCustomContextMenuItem(const class FName& ContextItem, class AShooterPlayerController* ForPC);
	void TogglePotToCropPlotAndViceVersa();
	void TogglePotVisibility();

	bool BPShouldHideTopLevelCustomContextMenuOption(const class FName& ContextItem) const;
	bool IsCustomContextMenuItemEnabled(const class FName& ContextItem) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItemStructure_PlantPot_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItemStructure_PlantPot_Base_C")
	}
	static class UPrimalItemStructure_PlantPot_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItemStructure_PlantPot_Base_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItemStructure_PlantPot_Base_C;

}

