#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItem_WeaponSpyglass

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PrimalItemWeaponGenericNoStats_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItem_WeaponSpyglass.PrimalItem_WeaponSpyglass_C
// 0x0010 (0x0B70 - 0x0B60)
class UPrimalItem_WeaponSpyglass_C : public UPrimalItemWeaponGenericNoStats_C
{
public:
	uint8                                         Pad_B53[0x5];                                      // 0x0B53(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AShooterPlayerController*               For_PC;                                            // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          UsedWeapon;                                        // 0x0B68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldTrack;                                       // 0x0B69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool BPPreventWeaponEquip();
	void BPServerHandleItemNetExecCommand(class AShooterPlayerController* ForPC, class FName CommandName, const struct FBPNetExecParams& ExecParams);
	bool CanUseItemPing();
	void ExecuteUbergraph_PrimalItem_WeaponSpyglass(int32 EntryPoint);
	void LocalUseAfterHoldBP(class AShooterPlayerController* ForPC);
	void LocalUseItemReleaseBP(class AShooterPlayerController* ForPC);
	void LocalUseStartHoldBP(class AShooterPlayerController* ForPC);
	void TimerDoubleTap();
	void TimerUsePingWheel();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItem_WeaponSpyglass_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItem_WeaponSpyglass_C")
	}
	static class UPrimalItem_WeaponSpyglass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItem_WeaponSpyglass_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItem_WeaponSpyglass_C;

}

