#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItemArmor_MinersHelmet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PrimalItemArmor_BaseHelmet_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItemArmor_MinersHelmet.PrimalItemArmor_MinersHelmet_C
// 0x0020 (0x0B90 - 0x0B70)
class UPrimalItemArmor_MinersHelmet_C final : public UPrimalItemArmor_BaseHelmet_C
{
public:
	uint8                                         Pad_B63[0x5];                                      // 0x0B63(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B68(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         BatteryDrainPerInterval;                           // 0x0B70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B74[0x4];                                      // 0x0B74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastBatteryDrainTime;                              // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLightEnabled;                                     // 0x0B80(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLightWasEnabled;                                  // 0x0B81(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B82[0x6];                                      // 0x0B82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class APrimalBuff>                FlashlightBuffClass;                               // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void BlueprintEquipped(bool bIsFromSaveGame);
	void DisableLight();
	void EnableLight();
	void EquippedBlueprintTick(float DeltaSeconds);
	void ExecuteUbergraph_PrimalItemArmor_MinersHelmet(int32 EntryPoint);
	void GetBatteries(TArray<class UPrimalItem_ChargeBattery_C*>* Batteries);
	void GetNextBatteryToDrain(class UPrimalItem_ChargeBattery_C** NextBatteryToDrain);
	void SERVER_DisableLight();
	void SERVER_EnableLight();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItemArmor_MinersHelmet_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItemArmor_MinersHelmet_C")
	}
	static class UPrimalItemArmor_MinersHelmet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItemArmor_MinersHelmet_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItemArmor_MinersHelmet_C;

}

