#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalProgressionTree

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "PrimalProgressionTree_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PrimalProgressionTree.PrimalProgressionTreeAsset
// 0x0048 (0x0078 - 0x0030)
class UPrimalProgressionTreeAsset final : public UPrimaryDataAsset
{
public:
	TSubclassOf<class UPrimalProgressionTreeGraph> ProgressionGraphClass;                            // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimalProgressionTreeGraph*            ProgressionGraph;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              InputDataTable;                                    // 0x0040(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           AdditionalStrings;                                 // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void InitializeGraph();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrimalProgressionTreeAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalProgressionTreeAsset")
	}
	static class UPrimalProgressionTreeAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalProgressionTreeAsset>();
	}
};
DUMPER7_ASSERTS_UPrimalProgressionTreeAsset;

// Class PrimalProgressionTree.PrimalProgressionTreeGraph
// 0x0060 (0x0088 - 0x0028)
class UPrimalProgressionTreeGraph : public UObject
{
public:
	TMap<class FName, struct FPrimalProgressionNode> Nodes;                                          // 0x0028(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<class UPrimalProgressionTreeFeature*>  GraphFeatures;                                     // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void AddChild(class FName NodeID, class FName ChildID);
	void AddNode(class FName NodeID, const struct FVector2D& NodePosition);
	void AddPrerequisite(class FName NodeID, class FName PrereqID, int32 GroupIndex);
	void RemoveNode(class FName NodeID);
	bool ValidateGraph(TArray<class FString>* ValidationErrors);

	bool ArePrerequisitesMet(class FName NodeID, const TSet<class FName>& UnlockedNodes) const;
	bool ArePrerequisitesMetForController(class FName NodeID, class APlayerController* ForPC) const;
	TArray<class FName> GetAllAncestors(class FName NodeID) const;
	TArray<class FName> GetAllDescendants(class FName NodeID) const;
	TArray<struct FPrimalProgressionPath> GetAllPathsBetweenNodes(class FName StartNodeID, class FName EndNodeID, int32 MaxPathLength) const;
	TArray<class FName> GetAvailableNodes(const TSet<class FName>& UnlockedNodes) const;
	float GetEdgeWeight(class FName FromNodeID, class FName ToNodeID) const;
	TArray<class FName> GetLeafNodes() const;
	TArray<class FName> GetPathBetweenNodes(class FName StartNodeID, class FName EndNodeID) const;
	TArray<class FName> GetRootNodes() const;
	TArray<class FName> GetShortestWeightedPath(class FName StartNodeID, class FName EndNodeID) const;
	bool PathExists(class FName StartNodeID, class FName EndNodeID) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrimalProgressionTreeGraph")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalProgressionTreeGraph")
	}
	static class UPrimalProgressionTreeGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalProgressionTreeGraph>();
	}
};
DUMPER7_ASSERTS_UPrimalProgressionTreeGraph;

// Class PrimalProgressionTree.PrimalProgressionTreeFeature
// 0x0000 (0x0028 - 0x0028)
class UPrimalProgressionTreeFeature : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrimalProgressionTreeFeature")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalProgressionTreeFeature")
	}
	static class UPrimalProgressionTreeFeature* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalProgressionTreeFeature>();
	}
};
DUMPER7_ASSERTS_UPrimalProgressionTreeFeature;

// Class PrimalProgressionTree.PrimalProgressionTreeRowFeature
// 0x0060 (0x0088 - 0x0028)
class UPrimalProgressionTreeRowFeature final : public UPrimalProgressionTreeFeature
{
public:
	TArray<struct FRowDefinition>                 Rows;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FIntPoint>           NodeRowAssignments;                                // 0x0038(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	void SetNodeRow(class FName NodeID, const struct FIntPoint& NodeRowAndIndex);

	bool CheckRowRequirements(class FName NodeID, const TSet<class FName>& UnlockedNodes) const;
	int32 GetNodeRow(class FName NodeID) const;
	int32 GetPointsSpentInRow(int32 RowIndex, const TSet<class FName>& UnlockedNodes) const;
	bool IsRowAvailable(int32 RowIndex, const TSet<class FName>& UnlockedNodes) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrimalProgressionTreeRowFeature")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalProgressionTreeRowFeature")
	}
	static class UPrimalProgressionTreeRowFeature* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalProgressionTreeRowFeature>();
	}
};
DUMPER7_ASSERTS_UPrimalProgressionTreeRowFeature;

// Class PrimalProgressionTree.PrimalProgressionTreeTierFeature
// 0x00A0 (0x00C8 - 0x0028)
class UPrimalProgressionTreeTierFeature final : public UPrimalProgressionTreeFeature
{
public:
	TMap<class FName, struct FSkillTierConfig>    SkillTierConfigs;                                  // 0x0028(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, int32>                      UnlockedTiers;                                     // 0x0078(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	bool IncreaseSkillTier(class FName SkillID);
	void SetSkillTierConfig(class FName SkillID, int32 MaxTier, int32 BaseCost, int32 CostIncreasePerTier);

	TSet<class FName> GetEffectiveUnlockedNodes() const;
	int32 GetSkillTier(class FName SkillID) const;
	TMap<class FName, struct FSkillTierConfig> GetSkillTierConfigs() const;
	int32 GetSkillUpgradeCost(class FName SkillID) const;
	TMap<class FName, int32> GetUnlockedTiers() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrimalProgressionTreeTierFeature")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalProgressionTreeTierFeature")
	}
	static class UPrimalProgressionTreeTierFeature* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalProgressionTreeTierFeature>();
	}
};
DUMPER7_ASSERTS_UPrimalProgressionTreeTierFeature;

// Class PrimalProgressionTree.PrimalProgressionTreeGraph_RowsAndTiers
// 0x0010 (0x0098 - 0x0088)
class UPrimalProgressionTreeGraph_RowsAndTiers final : public UPrimalProgressionTreeGraph
{
public:
	class UPrimalProgressionTreeRowFeature*       RowTrait;                                          // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimalProgressionTreeTierFeature*      TierTrait;                                         // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	int32 GetPointsSpentInRow(int32 RowIndex, const TSet<class FName>& UnlockedNodes) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrimalProgressionTreeGraph_RowsAndTiers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalProgressionTreeGraph_RowsAndTiers")
	}
	static class UPrimalProgressionTreeGraph_RowsAndTiers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalProgressionTreeGraph_RowsAndTiers>();
	}
};
DUMPER7_ASSERTS_UPrimalProgressionTreeGraph_RowsAndTiers;

}

