#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalDestructibleFoliage

#include "Basic.hpp"

#include "GeometryCollectionEngine_classes.hpp"
#include "Chaos_structs.hpp"
#include "Engine_structs.hpp"
#include "UDS_and_UDW_State_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalDestructibleFoliage.PrimalDestructibleFoliage_C
// 0x0328 (0x07B8 - 0x0490)
class APrimalDestructibleFoliage_C : public APrimalDestructibleActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 Damage_Amount;                                     // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Break_Damage_Propagation_Factor;                   // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                VelocityVector;                                    // 0x04B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Damage_Threshold;                                  // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ClusterIndex;                                      // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Item_Index;                                        // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Text_Color;                                        // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number_Of_Pieces_in_Geo_Collection;                // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AngularVelocityVector;                             // 0x0500(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DebugTextDuration;                                 // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryCollection*                    Rest_Collection_In;                                // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EObjectStateTypeEnum                          SetStateType;                                      // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectStateTypeEnum                          StateType;                                         // 0x0529(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52A[0x6];                                      // 0x052A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        Target;                                            // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_Clustering;                                 // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Crumbling_Event_Includes_Children;                 // 0x0539(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A[0x6];                                      // 0x053A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryCollectionComponent*           GC_Test;                                           // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        BreakLevel__0_1_;                                  // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableTextDebug;                                   // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          Stream;                                            // 0x0554(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	int32                                         Initial_Seed;                                      // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DynamicActivationRadius;                           // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUDS_and_UDW_State                     State;                                             // 0x0568(0x0178)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          EnableStateChange;                                 // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1[0x3];                                      // 0x06E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HitDirectionVelocityMultiplier_min;                // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitDirectionVelocityMultiplier_max;                // 0x06E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngularVelocityMultiplier_Min;                     // 0x06EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngularVelocityMultiplier_Max;                     // 0x06F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BreakLevelPercent_Min;                             // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeToForceStartRemoval;                           // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0708(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalHealth;                                       // 0x070C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitDirection;                                      // 0x0710(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Level_0_Indices;                                   // 0x0728(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Level_1_Indices;                                   // 0x0738(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Level_2_Indices;                                   // 0x0748(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                NewVar;                                            // 0x0758(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxOnBreakAngularVelocity;                         // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         mass_multiplier;                                   // 0x0778(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Approximate_Hit_Location;                          // 0x0780(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        minimum_damage_threshold_needed_to_apply_velocity; // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Minimum_Damage_for_max_size_of_impulse;            // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Hit_Impulse_Strength;                              // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        percentage_impulse_strength_based_on_damage;       // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPStartDestruction(class UGeometryCollection* destructionAsset, const struct FVector& HitDirection_0, float Damage_0, float TotalHealth_0);
	void Break();
	void BreakAllActiveClusters(class UGeometryCollectionComponent* GeoCollection, const struct FLinearColor& DebugTextColor);
	void BreakClusterFromClusterIndex(class UGeometryCollectionComponent* GeoCollection, int32 ItemIndexOfCluster, const struct FLinearColor& DebugTextColor);
	void BreakClusterFromClusterIndexArray(class UGeometryCollectionComponent* GeoCollection, TArray<int32>& ItemIndexArrayOfCluster, const struct FLinearColor& DebugTextColor);
	void BreakClusterFromRandomClusterIndexArray(class UGeometryCollectionComponent* GeoCollection, TArray<int32>& ItemIndexArrayOfCluster, const struct FLinearColor& DebugTextColor, double BreakLevelPercent__0_1_);
	void BreakSecondLayer();
	void ExecuteUbergraph_PrimalDestructibleFoliage(int32 EntryPoint);
	void GetDamageThresholdInfo(class UGeometryCollectionComponent* GeoCollection, const struct FLinearColor& DebugTextColor, int32* Damage_Threshold_Array_Length);
	void GetLevelFromClusterIndex(class UGeometryCollectionComponent* GeoCollection, int32 ItemIndexOfCluster, const struct FLinearColor& DebugTextColor, int32* Level);
	void GetRangeOfLevelsFromClusterIndexes(class UGeometryCollectionComponent* GeoCollection, int32 StartItemIndexOfCluster, int32 EndItemIndexOfCluster, const struct FLinearColor& DebugTextColor, TArray<int32>* Level0, TArray<int32>* Level1, TArray<int32>* Level2);
	void Group_Cluster_Index_by_Level(class UGeometryCollectionComponent* GeoCollection, int32 NumberOfPiecesInGeoColl, const struct FLinearColor& DebugTextColor, TArray<int32>* Level0, TArray<int32>* Level1, TArray<int32>* Level2);
	void InitializeVariablesFromGameplayData();
	void OnBreak(const struct FChaosBreakEvent& BreakEvent);
	void ReceiveBeginPlay();
	void StaticBPPreDestructionHandleAttachedComponentClass(TSubclassOf<class UActorComponent> AttachedComponentClass, class UInstancedStaticMeshComponent* ForMeshComp, const struct FVector& InstancePosition, const struct FRotator& InstanceRotation, int32 InstanceIndex, const struct FVector& HitDirection_0, float Damage_0, float TotalHealth_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalDestructibleFoliage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalDestructibleFoliage_C")
	}
	static class APrimalDestructibleFoliage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrimalDestructibleFoliage_C>();
	}
};
DUMPER7_ASSERTS_APrimalDestructibleFoliage_C;

}

