#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalPlayerDataBP_Base

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalPlayerDataBP_Base.PrimalPlayerDataBP_Base_C
// 0x0058 (0x07C8 - 0x0770)
class UPrimalPlayerDataBP_Base_C : public UPrimalPlayerData
{
public:
	int32                                         NumAscensions;                                     // 0x0770(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                AscensionData;                                     // 0x0778(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NativeAccessSpecifierPublic)
	TArray<class FName>                           BossDinoNameTagAscensionDataMap;                   // 0x0788(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SavedPlayerDataVersion;                            // 0x0798(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentPlayerDataVersion;                          // 0x079C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HexagonCount;                                      // 0x07A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumChibiLevelUpsData;                              // 0x07A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           GeneralizedUnlockedAchievementTags;                // 0x07A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NativeAccessSpecifierPublic)
	uint8                                         SigilCountProgressionForExplorerNotes_Crimson;     // 0x07B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SigilCountProgressionForExplorerNotes_Abb;         // 0x07B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7BA[0x2];                                      // 0x07BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Sigil_Count_Needed_For_Progressing_Explorer_Notes; // 0x07BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Sigil_Unlocked_Explorer_Note_Index_Start;          // 0x07C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Sigil_Unlocked_Explorer_Note_Index_End;            // 0x07C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPCreatedNewPlayerData();
	void BPForceDefeatedBoss(int32 DifficultyIndex, class FName BossName, class AShooterPlayerController* PlayerController);
	void BPPostLoadFromFile();
	void DefeatedBoss(class APrimalDinoCharacter* BossChar, int32 DifficultyIndex, class FName TagOverride, class AShooterPlayerController* ForPC);
	void EndActivityOnBoss(class FName Boss, class AShooterPlayerController* SPC);
	int32 GetPlayerHexagonCount();
	void GrantGeneralizedAchievementTag(class FName ObtainedAchievementTag, class AShooterPlayerController* ForPC);
	bool HasGeneralizedAchievementTag(class FName Tag);
	void Interface_PlayerData_Progress_Abb_Sigil_Count(uint8 Newly_Added_Sigil_Count, class AShooterPlayerController* Player_Controller, bool* success);
	void Interface_PlayerData_Progress_Crimson_Sigil_Count(uint8 Newly_Added_Sigil_Count, class AShooterPlayerController* Player_Controller, bool* success);
	void SetChibiLevels(int32 NewLevels, class AShooterPlayerController* ForPC);
	bool SetPlayerHexagonCount(int32 NewHexagonCount);
	void Shared_Adding_Sigil_Count_Function(uint8 newly_added_sigils, class AShooterPlayerController* Controller, uint8 sigil_count, bool is_crimson, bool is_abb, uint8* Count_After);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalPlayerDataBP_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalPlayerDataBP_Base_C")
	}
	static class UPrimalPlayerDataBP_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalPlayerDataBP_Base_C>();
	}
};
DUMPER7_ASSERTS_UPrimalPlayerDataBP_Base_C;

}

