#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalProgressionTree

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum PrimalProgressionTree.EProgressionTreePinDirection
// NumValues: 0x0005
enum class EProgressionTreePinDirection : uint8
{
	Up                                       = 0,
	Down                                     = 1,
	Left                                     = 2,
	Right                                    = 3,
	EProgressionTreePinDirection_MAX         = 4,
};

// ScriptStruct PrimalProgressionTree.PrimalProgressionPrereqGroup
// 0x0010 (0x0010 - 0x0000)
struct FPrimalProgressionPrereqGroup final
{
public:
	TArray<class FName>                           Prerequisites;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPrimalProgressionPrereqGroup;

// ScriptStruct PrimalProgressionTree.PrimalProgressionNode
// 0x0038 (0x0038 - 0x0000)
struct FPrimalProgressionNode final
{
public:
	class FName                                   NodeID;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPrimalProgressionPrereqGroup>  PrerequisiteGroups;                                // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ChildNodes;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector2D                              NodePosition;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPrimalProgressionNode;

// ScriptStruct PrimalProgressionTree.PrimalProgressionPath
// 0x0010 (0x0010 - 0x0000)
struct FPrimalProgressionPath final
{
public:
	TArray<class FName>                           NodeIDs;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPrimalProgressionPath;

// ScriptStruct PrimalProgressionTree.RowDefinition
// 0x0008 (0x0008 - 0x0000)
struct FRowDefinition final
{
public:
	int32                                         RowIndex;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointsNeededFromPreviousRow;                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRowDefinition;

// ScriptStruct PrimalProgressionTree.SkillTierConfig
// 0x000C (0x000C - 0x0000)
struct FSkillTierConfig final
{
public:
	int32                                         MaxTier;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BaseCost;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CostIncreasePerTier;                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSkillTierConfig;

}

