#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItemResource_Element

#include "Basic.hpp"

#include "PrimalItemResourceGeneric_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItemResource_Element.PrimalItemResource_Element_C
// 0x0020 (0x0B80 - 0x0B60)
class UPrimalItemResource_Element_C : public UPrimalItemResourceGeneric_C
{
public:
	uint8                                         Pad_B53[0x1];                                      // 0x0B53(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ShapeshifterSmallsCustomTag;                       // 0x0B54(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5C[0x4];                                      // 0x0B5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APrimalCharacter*                       PreviousShapeshifterClientValue;                   // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APrimalCharacter*                       ServerShapeshifterToFeed;                          // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   ShapeshifterBiglyCustomTag;                        // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool BPCanUse(bool bIgnoreCooldown);
	void BPPreUseItem();
	void BPServerHandleItemNetExecCommand(class AShooterPlayerController* ForPC, class FName CommandName, const struct FBPNetExecParams& ExecParams);
	bool BPSupportUseOntoItem(class UPrimalItem* DestinationItem);
	void BPUsedOntoItem(class UPrimalItem* DestinationItem, int32 AdditionalData);
	void FindShapeshifter(class APrimalDinoCharacter** Shapeshifter, bool* RetMounted);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItemResource_Element_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItemResource_Element_C")
	}
	static class UPrimalItemResource_Element_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItemResource_Element_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItemResource_Element_C;

}

