#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItem_WeaponTorch

#include "Basic.hpp"

#include "PrimalItemWeaponGenericAmmoless_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItem_WeaponTorch.PrimalItem_WeaponTorch_C
// 0x0030 (0x0B90 - 0x0B60)
class UPrimalItem_WeaponTorch_C final : public UPrimalItemWeaponGenericAmmoless_C
{
public:
	uint8                                         Pad_B53[0x5];                                      // 0x0B53(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DurabilityLossPerSecond;                           // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TorchOnBeltWidgetTextColor;                        // 0x0B68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 TorchOnBeltWidgetText;                             // 0x0B78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ApplyingSkinOntoItem(class UPrimalItem* ToOwnerItem, bool bIsFirstTime);
	class FString BPGetCustomInventoryWidgetText();
	struct FColor BPGetCustomInventoryWidgetTextColor();
	void BPNotifyItemRefreshed();
	void BPPreUseItem();
	bool BPPreventNewColorization();
	bool BPPreventUseOntoItem(class UPrimalItem* DestinationItem);
	bool BPPreventWeaponEquip();
	void BPUsedOntoItem(class UPrimalItem* DestinationItem, int32 AdditionalData);
	void ExecuteUbergraph_PrimalItem_WeaponTorch(int32 EntryPoint);
	void GetFlameColorIndex(int32* Index_0);
	void PutTorchOnBelt(class AShooterCharacter* ForCharacter);
	void RemovedSkinFromItem(class UPrimalItem* FromOwnerItem, bool bIsFirstTime);
	void RemoveTorchFromBelt(class AShooterCharacter* ForCharacter);
	void SelectedCustomContextMenuItem(const class FName& ContextItem, class AShooterPlayerController* ForPC);
	void SkinEquippedBlueprintTick(class UPrimalItem* OwnerItem, float DeltaSeconds);
	void UpdateBeltTorchMeshColors();

	bool BPShouldHideTopLevelCustomContextMenuOption(const class FName& ContextItem) const;
	void CanTorchBeOnBelt(bool* bCanBeOnBelt) const;
	void GetBeltTorchBuffInstanceForCharacter(class AShooterCharacter* ShooterCharacter, class APrimalBuff** BeltTorchBuff) const;
	bool IsCustomContextMenuItemEnabled(const class FName& ContextItem) const;
	void IsTorchOnBelt(bool* bIsOnBelt) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItem_WeaponTorch_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItem_WeaponTorch_C")
	}
	static class UPrimalItem_WeaponTorch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItem_WeaponTorch_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItem_WeaponTorch_C;

}

