#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItem_ChargeBattery

#include "Basic.hpp"

#include "PrimalItem_Base_Battery_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItem_ChargeBattery.PrimalItem_ChargeBattery_C
// 0x0020 (0x0B80 - 0x0B60)
class UPrimalItem_ChargeBattery_C : public UPrimalItem_Base_Battery_C
{
public:
	uint8                                         Pad_B53[0x1];                                      // 0x0B53(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Icon_Parameter_Name;                               // 0x0B54(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5C[0x4];                                      // 0x0B5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        minDurability;                                     // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     batteryIcons;                                      // 0x0B68(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanBeChargedByLightPets;                           // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddDurabilitySafe(double amountToAdd, double* AmountAdded);
	class FString BPGetCustomInventoryWidgetText();
	float BPGetItemDurabilityPercentage();
	class UTexture2D* BPGetItemIcon(class AShooterPlayerController* ForPC);
	void BPUsedOntoItem(class UPrimalItem* DestinationItem, int32 AdditionalData);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItem_ChargeBattery_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItem_ChargeBattery_C")
	}
	static class UPrimalItem_ChargeBattery_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItem_ChargeBattery_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItem_ChargeBattery_C;

}

