#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItemArmor_BasePants

#include "Basic.hpp"

#include "PrimalItemArmorGeneric_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItemArmor_BasePants.PrimalItemArmor_BasePants_C
// 0x0030 (0x0B90 - 0x0B60)
#pragma pack(push, 0x1)
class alignas(0x10) UPrimalItemArmor_BasePants_C : public UPrimalItemArmorGeneric_C
{
public:
	class USoundBase*                             SoundOverrideProneStart;                           // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOverrideProneEnd;                             // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOverrideProneStep;                            // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOverrideCrouchStart;                          // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOverrideCrouchEnd;                            // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	class USoundBase* OverrideCrouchingSound(class USoundBase* InSound, bool bIsProne, int32 soundState);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItemArmor_BasePants_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItemArmor_BasePants_C")
	}
	static class UPrimalItemArmor_BasePants_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItemArmor_BasePants_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UPrimalItemArmor_BasePants_C;

}

