#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItem_WeaponEmptyCryopod

#include "Basic.hpp"

#include "ShooterGame_structs.hpp"
#include "Engine_structs.hpp"
#include "PrimalItemWeaponGenericAmmolessConsumeSelf_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItem_WeaponEmptyCryopod.PrimalItem_WeaponEmptyCryopod_C
// 0x0060 (0x0BC0 - 0x0B60)
class UPrimalItem_WeaponEmptyCryopod_C final : public UPrimalItemWeaponGenericAmmolessConsumeSelf_C
{
public:
	uint8                                         Pad_B53[0x5];                                      // 0x0B53(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void()>              NewEventDispatcher;                                // 0x0B60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        DecayingDurability;                                // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugInvalidRedirects;                             // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B79[0x7];                                      // 0x0B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CryoFridgeDistanceCheck;                           // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EnemyDistanceCheckRadius;                          // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EnemyStructureDistanceCheckRadius;                 // 0x0B90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TreasureTag;                                       // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, TObjectPtr)
	TArray<TSoftClassPtr<class UClass>>           EnemyStructureActorClassesToIgnore;                // 0x0BA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   DisplayCaseCustomDataName;                         // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, TObjectPtr)
	bool                                          bAllowDeployFromControlledDino;                    // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceDeployNoTeam;                                // 0x0BB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceSkipControllerChecks;                        // 0x0BBA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPAddedToInventory(class UPrimalInventoryComponent* theInventory, bool bEquipItem);
	float BPGetCustomAutoDecreaseDurabilityPerInterval();
	class FString BPGetCustomDurabilityText();
	class UMaterialInterface* BPGetCustomIconMaterialParent();
	class FString BPGetCustomInventoryWidgetText();
	struct FColor BPGetCustomInventoryWidgetTextColor();
	class FString BPGetItemDescription(const class FString& InDescription, bool bGetLongDescription, class AShooterPlayerController* ForPC);
	class FString BPGetItemName(const class FString& ItemNameIn, class AShooterPlayerController* ForPC);
	void BPInitIconMaterial();
	void BPItemBelowDurabilityThreshold();
	void BPItemBroken();
	void BPPostInitializeItem(class UWorld* OptionalInitWorld);
	bool BPPreventUpload();
	void BPTributeItemDownloaded(class UObject* ContextObject);
	void BPTributeItemUploaded(class UObject* ContextObject);
	void BrokenDeploy();
	void CanDeploy(class UClass* Class_0, const struct FVector& Location, class AActor* SpawningActor, class AActor* IgnoreActor, bool* Can, struct FVector* NewLocation, class FString* FailureReason);
	void CanFit(const struct FVector& Location, double VerticalOffset, double Angle, double HorizontalOffset, double Radius, double HalfHeight, class AActor* SpawningActor, class AActor* IgnoreActor, class UClass* Class_0, bool* Can, struct FVector* NewLocation);
	void ExecuteUbergraph_PrimalItem_WeaponEmptyCryopod(int32 EntryPoint);
	void ExOnDeploy(class APrimalDinoCharacter* Dino);
	void Get_Stat_Value_for_Display(double MaxValue, EPrimalCharacterStatusValue Stat, double Value, class FText* Result);
	void GetContainedDinoClass(class UClass** ResolvedClass, bool* HasData, struct FCustomItemData* RawCustomItemData);
	float GetCryopodDeploymentRange();
	void GetCuddleData(class APrimalDinoCharacter* ForDino, double* NewTime, uint8* CuddleType, class UClass** CuddleItemClass, bool* CuddleRefreshed);
	void GetCurrentValueIndexForStat(EPrimalCharacterStatusValue Stat, int32* Index_0);
	void GetDeployingChar(class APrimalCharacter** primalChar);
	void GetDeployingPC(class AShooterPlayerController** ShooterPC);
	void GetMaxValueIndexForStat(EPrimalCharacterStatusValue Stat, int32* Index_0);
	void GetRecoveryRateIndexForStat(EPrimalCharacterStatusValue Stat, int32* Index_0);
	void GetStatCurrentValue(EPrimalCharacterStatusValue Stat, TArray<double>& FloatVars, double* StatValue);
	void GetStatDisplayName(EPrimalCharacterStatusValue Stat, class FText* DisplayName);
	void GetStatMaxValue(EPrimalCharacterStatusValue Stat, TArray<double>& FloatVars, double* StatValue);
	void GetStatRecoveryRateValue(EPrimalCharacterStatusValue Stat, TArray<double>& FloatVars, double* StatValue);
	void GetStatusValueWithRegenFromDinoInCryopod(EPrimalCharacterStatusValue StatusValue, TArray<double>& OptionalFloats, TArray<double>& OptionalDoubles, bool IncludeTimeInActivatedCryoHospitalBeforeUpdate, class UObject* WorldContext, double* Value, double* NormalRegen, double* CryoHospitalRegen, bool* DidRegen, bool* SuccessFindingValue, bool* HealthReachedMax);
	void GetTimeSpentInCryoHospital(bool IncludeTimeWhileInActivatedCryoHospitalBeforeUpdate, class UObject* WorldContext, TArray<double>& OptionalCIDDoubles, double* Time);
	void PreventColorizationString(class APrimalDinoCharacter* Dino, class FString* PreventRegions);
	void ShouldUseCryoSicknessEx(class APrimalDinoCharacter* TheDino, bool* bShouldUse);
	void TryDeploy(const struct FVector& Location, const struct FRotator& Rotation, class AActor* SpawningActor, class AActor* IgnoreActor, bool* Deployed, struct FVector* NewLocation, class FString* FailureReason);

	void GetCooldownBuffIfLoaded(class UClass** OutputClass) const;
	void IsCryoFridge(bool* IsFridge, class APrimalStructureItemContainer** AsContainer) const;
	void IsDisplayCase(bool* IsIceBox, class APrimalStructureItemContainer** AsContainer) const;
	void IsIceBox(bool* IsIceBox_0, class APrimalStructureItemContainer** AsContainer) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItem_WeaponEmptyCryopod_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItem_WeaponEmptyCryopod_C")
	}
	static class UPrimalItem_WeaponEmptyCryopod_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItem_WeaponEmptyCryopod_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItem_WeaponEmptyCryopod_C;

}

