#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItemCostumeGeneric_DinoColorization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PrimalItemCostumeGeneric_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItemCostumeGeneric_DinoColorization.PrimalItemCostumeGeneric_DinoColorization_C
// 0x0040 (0x0BA0 - 0x0B60)
class UPrimalItemCostumeGeneric_DinoColorization_C : public UPrimalItemCostumeGeneric_C
{
public:
	uint8                                         Pad_B53[0x5];                                      // 0x0B53(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HadSaddle;                                         // 0x0B60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B61[0x7];                                      // 0x0B61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ColorPropertyString;                               // 0x0B68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, TObjectPtr)
	class FString                                 UsingColorPropertyString;                          // 0x0B78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, TObjectPtr)
	class FString                                 UsingColorizedColorPropertyString;                 // 0x0B88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, TObjectPtr)

public:
	void BPPostConstructAttachment(int32 AttachmentIndex, class UActorComponent* AttachedComponent);
	void EquippedBlueprintTick(float DeltaSeconds);
	void ExecuteUbergraph_PrimalItemCostumeGeneric_DinoColorization(int32 EntryPoint);
	void TryForceSaddleColors();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItemCostumeGeneric_DinoColorization_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItemCostumeGeneric_DinoColorization_C")
	}
	static class UPrimalItemCostumeGeneric_DinoColorization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItemCostumeGeneric_DinoColorization_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItemCostumeGeneric_DinoColorization_C;

}

