#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItem_Pliers

#include "Basic.hpp"

#include "PrimalItem_GenericMisc_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItem_Pliers.PrimalItem_Pliers_C
// 0x0030 (0x0B90 - 0x0B60)
class UPrimalItem_Pliers_C final : public UPrimalItem_GenericMisc_C
{
public:
	uint8                                         Pad_B53[0x5];                                      // 0x0B53(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DurabilityLossForMaxRepair;                        // 0x0B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         AllowRepairingForInventoryClasses;                 // 0x0B60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bFoundClass;                                       // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B71[0x7];                                      // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RepairToPercent;                                   // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RepairSpeedMult;                                   // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool BPSupportUseOntoItem(class UPrimalItem* DestinationItem);
	void BPUsedOntoItem(class UPrimalItem* DestinationItem, int32 AdditionalData);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItem_Pliers_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItem_Pliers_C")
	}
	static class UPrimalItem_Pliers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItem_Pliers_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItem_Pliers_C;

}

