#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItem_WeaponMinigun

#include "Basic.hpp"

#include "ShooterGame_structs.hpp"


namespace SDK::Params
{

// Function PrimalItem_WeaponMinigun.PrimalItem_WeaponMinigun_C.BPTributeItemDownloaded
// 0x0140 (0x0140 - 0x0000)
struct PrimalItem_WeaponMinigun_C_BPTributeItemDownloaded final
{
public:
	class UObject*                                ContextObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   WeapMinigunClass;                                  // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsShooter_Weapon;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsChildOf_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0058(0x0010)(ReferenceParm)
	TArray<class UClass*>                         K2Node_MakeArray_Array_2;                          // 0x0068(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array_3;                          // 0x0078(0x0010)(ReferenceParm)
	TArray<float>                                 K2Node_MakeArray_Array_4;                          // 0x0088(0x0010)(ReferenceParm)
	struct FCustomItemData                        K2Node_MakeStruct_CustomItemData;                  // 0x0098(0x00A8)()
};
DUMPER7_ASSERTS_PrimalItem_WeaponMinigun_C_BPTributeItemDownloaded;

}

