#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItemConsumableRespecSoup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PrimalItemConsumableEatable_BuffingSoup_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItemConsumableRespecSoup.PrimalItemConsumableRespecSoup_C
// 0x0010 (0x0B70 - 0x0B60)
class UPrimalItemConsumableRespecSoup_C final : public UPrimalItemConsumableEatable_BuffingSoup_C
{
public:
	uint8                                         Pad_B53[0x5];                                      // 0x0B53(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPrimalItem*                            SelfObj;                                           // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          UseRespecCooldown;                                 // 0x0B68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B69[0x3];                                      // 0x0B69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CooldownTimeInSeconds;                             // 0x0B6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlueprintUsed();
	bool BPCanUse(bool bIgnoreCooldown);
	class FString BPGetCustomInventoryWidgetText();
	void ExecuteUbergraph_PrimalItemConsumableRespecSoup(int32 EntryPoint);
	void GetLastRespecTime(double* LastRespecUtcTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItemConsumableRespecSoup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItemConsumableRespecSoup_C")
	}
	static class UPrimalItemConsumableRespecSoup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItemConsumableRespecSoup_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItemConsumableRespecSoup_C;

}

