#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimalItemArmor_Base_Tek

#include "Basic.hpp"

#include "PrimalItemArmorGeneric_classes.hpp"
#include "Engine_structs.hpp"
#include "MapSpecificTekArmorBuffs_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PrimalItemArmor_Base_Tek.PrimalItemArmor_Base_Tek_C
// 0x0060 (0x0BC0 - 0x0B60)
class UPrimalItemArmor_Base_Tek_C : public UPrimalItemArmorGeneric_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPrimalItem*                            SelfObj;                                           // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   MyTekArmorBuff;                                    // 0x0B70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         MaxAmmo;                                           // 0x0B98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInfiniteAmmo;                                     // 0x0B9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9D[0x3];                                      // 0x0B9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMapSpecificTekArmorBuffs>      MapSpecificTekArmorBuffs;                          // 0x0BA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 CachedResolvedTekArmorBuff;                        // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bTekBuffDirty;                                     // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyingSkinOntoItem(class UPrimalItem* ToOwnerItem, bool bIsFirstTime);
	void BlueprintEquipped(bool bIsFromSaveGame);
	void BlueprintOwnerPosssessed(class AController* PossessedByController);
	void BlueprintUnequipped();
	class FString BPGetCustomInventoryWidgetText();
	int32 BPGetMaxAmmo();
	void Can_Element_Decrease(int32 AmountToDecreaseBy, bool PreventCheckingInventory, bool* CanDecrease);
	void ExecuteUbergraph_PrimalItemArmor_Base_Tek(int32 EntryPoint);
	void FillEmptyArmorElementWhenAvailable();
	void GetInternalMapRestrictedTekArmorBuff(class AShooterCharacter* OwningPlayer, class UClass** TekArmorBuff);
	void GetResolvedTekArmorBuff(class UClass** ResolvedTekArmorBuff);
	void IncreaseElement(double Percent);
	void InitBuff();
	void IsInfiniteAmmo(bool* IsInfinite);
	void RemovedSkinFromItem(class UPrimalItem* FromOwnerItem, bool bIsFirstTime);
	void SetElementToMax();
	void TekArmorSkinApplied();
	void TekArmorSkinRemoved();
	void TryToDecreaseElement(int32 AmountToDecreaseBy);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PrimalItemArmor_Base_Tek_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrimalItemArmor_Base_Tek_C")
	}
	static class UPrimalItemArmor_Base_Tek_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimalItemArmor_Base_Tek_C>();
	}
};
DUMPER7_ASSERTS_UPrimalItemArmor_Base_Tek_C;

}

