#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProxyTable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ProxyTable.ProxyTableFunctionLibrary.EvaluateProxyAsset
// 0x0020 (0x0020 - 0x0000)
struct ProxyTableFunctionLibrary_EvaluateProxyAsset final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UProxyAsset*                      Proxy;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ObjectClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ProxyTableFunctionLibrary_EvaluateProxyAsset;

// Function ProxyTable.ProxyTableFunctionLibrary.EvaluateProxyTable
// 0x0020 (0x0020 - 0x0000)
struct ProxyTableFunctionLibrary_EvaluateProxyTable final
{
public:
	const class UObject*                          ContextObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UProxyTable*                      ProxyTable;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Key;                                               // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ProxyTableFunctionLibrary_EvaluateProxyTable;

// Function ProxyTable.ProxyTableFunctionLibrary.MakeLookupProxy
// 0x0018 (0x0018 - 0x0000)
struct ProxyTableFunctionLibrary_MakeLookupProxy final
{
public:
	class UProxyAsset*                            Proxy;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ProxyTableFunctionLibrary_MakeLookupProxy;

// Function ProxyTable.ProxyTableFunctionLibrary.MakeLookupProxyWithOverrideTable
// 0x0020 (0x0020 - 0x0000)
struct ProxyTableFunctionLibrary_MakeLookupProxyWithOverrideTable final
{
public:
	class UProxyAsset*                            Proxy;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProxyTable*                            ProxyTable;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ProxyTableFunctionLibrary_MakeLookupProxyWithOverrideTable;

}

