#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProxyTable

#include "Basic.hpp"

#include "Chooser_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct ProxyTable.ChooserParameterProxyTableBase
// 0x0000 (0x0008 - 0x0008)
struct FChooserParameterProxyTableBase : public FChooserParameterBase
{
};
DUMPER7_ASSERTS_FChooserParameterProxyTableBase;

// ScriptStruct ProxyTable.ProxyTableContextProperty
// 0x0028 (0x0030 - 0x0008)
struct FProxyTableContextProperty final : public FChooserParameterProxyTableBase
{
public:
	struct FChooserPropertyBinding                Binding;                                           // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProxyTableContextProperty;

// ScriptStruct ProxyTable.LookupProxy
// 0x0018 (0x0020 - 0x0008)
struct FLookupProxy final : public FObjectChooserBase
{
public:
	class UProxyAsset*                            Proxy;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FInstancedStruct                       ProxyTable;                                        // 0x0010(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLookupProxy;

// ScriptStruct ProxyTable.LookupProxyWithOverrideTable
// 0x0010 (0x0018 - 0x0008)
struct FLookupProxyWithOverrideTable final : public FObjectChooserBase
{
public:
	class UProxyAsset*                            Proxy;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UProxyTable*                            OverrideProxyTable;                                // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FLookupProxyWithOverrideTable;

// ScriptStruct ProxyTable.ProxyStructOutput
// 0x0038 (0x0038 - 0x0000)
struct FProxyStructOutput final
{
public:
	struct FChooserStructPropertyBinding          Binding;                                           // 0x0000(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       Value;                                             // 0x0028(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProxyStructOutput;

// ScriptStruct ProxyTable.ProxyEntry
// 0x0030 (0x0030 - 0x0000)
struct FProxyEntry final
{
public:
	class UProxyAsset*                            Proxy;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class FName                                   Key;                                               // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ValueStruct;                                       // 0x0010(0x0010)(Edit, NoClear, NativeAccessSpecifierPublic)
	TArray<struct FProxyStructOutput>             OutputStructData;                                  // 0x0020(0x0010)(Edit, ZeroConstructor, NoClear, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProxyEntry;

// ScriptStruct ProxyTable.RuntimeProxyValue
// 0x0028 (0x0028 - 0x0000)
struct FRuntimeProxyValue final
{
public:
	class UProxyAsset*                            ProxyAsset;                                        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FInstancedStruct                       Value;                                             // 0x0008(0x0010)(NativeAccessSpecifierPublic)
	TArray<struct FProxyStructOutput>             OutputStructData;                                  // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRuntimeProxyValue;

}

