#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RandomWaitWander_TK

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RandomWaitWander_TK.RandomWaitWander_TK_C
// 0x0020 (0x00C8 - 0x00A8)
class URandomWaitWander_TK_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        MinWait;                                           // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxWait;                                           // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDontWaitOnFlyingNPC;                              // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bScaleWithPlayerHeat;                              // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RandomWaitWander_TK(int32 EntryPoint);
	void ReceiveExecute(class AActor* OwnerActor);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RandomWaitWander_TK_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RandomWaitWander_TK_C")
	}
	static class URandomWaitWander_TK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URandomWaitWander_TK_C>();
	}
};
DUMPER7_ASSERTS_URandomWaitWander_TK_C;

}

