#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_CC_Settings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_CC_Settings.S_CC_Settings
// 0x00E8 (0x00E8 - 0x0000)
struct FS_CC_Settings final
{
public:
	double                                        Fat_Belly_19_1C8A717C4214A88DFF4C3A97E29D93D5;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fat_Butt_21_D0A372A24D6A89B2E66AF1AC014F2352;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fat_Chest_22_56991F1D433AC23929251088909EC6D5;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Back_Back_25_8A57D7C64955D624BE2D83A253581FA5;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Back_Neck_26_B7E2FA2F43DA54FC8B19A1A2F68333F6;     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Back_Trapezies_28_CEB4AEBC45F31268C3170EBBD00DC2D2; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Arm_Bicep_30_AC2BB293428ACCD42712CD939BE6B798;     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Arm_Deltoid_31_0F618E7A41CE45C0CBA3CD8D27A4C2FE;   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Arm_Forearm_32_5782D886432E2F41987C51B65BB8B80E;   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Arm_Tricep_33_E832ADD2411A396B1293B7897F5876CA;    // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Chest_Abs_34_D10B89E74D8E9DBDB753689665680328;     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Chest_Obliques_35_8167436E41B71B1EFDBE6DAC72A8E96A; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Chest_Pectorals_36_0783D21948193AEE1CB357AA3C2C9B69; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Legs_Adductors_37_5000345C4DC553C7154AB29FB61EE0D4; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Legs_Calves_38_B4A1E93547D9ACFC1F1F9A8C38AFB17A;   // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Legs_Glutes_39_0D0254874ECE0A3B50B8ED989F9CEF07;   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Legs_Hamstring_41_D38A1F0D4500F7D6515478B3316BCFD5; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Legs_Lats_46_545C9EB942201C5E29F388A53F898362;     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Legs_Quads_47_52D0FDF346AB6618DAEE2299400B6CB5;    // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ArmorTier_Set_50_D2486C6841F3F77F4A1B32BA0E74A6FB; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ArmorTier_Arms_52_495E1530451E06A503F43484DD491175; // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ArmorTier_Boots_54_73B88B02418F411C37BCA9A5899C3452; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ArmorTier_Chest_60_1950BA37488B9714F56E1BBB262795EB; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ArmorTier_Helmet_56_04686FD24F30F5E7E54A1BB1AD3410F6; // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ArmorTier_Leggings_58_4CB17C944AB88C18379DC089519139EF; // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Skin_Tone_63_968F15304C3B65A1D048D39ABB6E538C;     // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Skin_2DSliderCoord_66_CB7ED6EC4FD8FD788BA6C1A2FB65CBA6; // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FS_CC_Settings;

}

