#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScriptableToolsFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ScriptableToolsFramework_structs.hpp"
#include "InteractiveToolsFramework_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function ScriptableToolsFramework.ScriptableInteractiveTool.AddLineSet
// 0x0008 (0x0008 - 0x0000)
struct ScriptableInteractiveTool_AddLineSet final
{
public:
	class UScriptableToolLineSet*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_AddLineSet;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.AddLogMessage
// 0x0018 (0x0018 - 0x0000)
struct ScriptableInteractiveTool_AddLogMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	bool                                          bHighlighted;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_AddLogMessage;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.AddPointSet
// 0x0008 (0x0008 - 0x0000)
struct ScriptableInteractiveTool_AddPointSet final
{
public:
	class UScriptableToolPointSet*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_AddPointSet;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.AddPropertySetOfType
// 0x0028 (0x0028 - 0x0000)
struct ScriptableInteractiveTool_AddPropertySetOfType final
{
public:
	TSubclassOf<class UScriptableInteractiveToolPropertySet> PropertySetType;                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Identifier;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EToolsFrameworkOutcomePins                    Outcome;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptableInteractiveToolPropertySet*  ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_AddPropertySetOfType;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.AddTriangleSet
// 0x0008 (0x0008 - 0x0000)
struct ScriptableInteractiveTool_AddTriangleSet final
{
public:
	class UScriptableToolTriangleSet*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_AddTriangleSet;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.ClearUserMessages
// 0x0002 (0x0002 - 0x0000)
struct ScriptableInteractiveTool_ClearUserMessages final
{
public:
	bool                                          bHelpMessage;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarningMessage;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_ClearUserMessages;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.CreateTRSGizmo
// 0x0090 (0x0090 - 0x0000)
struct ScriptableInteractiveTool_CreateTRSGizmo final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             InitialTransform;                                  // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScriptableToolGizmoOptions            GizmoOptions;                                      // 0x0070(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EToolsFrameworkOutcomePins                    Outcome;                                           // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_CreateTRSGizmo;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.DestroyTRSGizmo
// 0x0018 (0x0018 - 0x0000)
struct ScriptableInteractiveTool_DestroyTRSGizmo final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EToolsFrameworkOutcomePins                    Outcome;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_DestroyTRSGizmo;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.DisplayUserHelpMessage
// 0x0010 (0x0010 - 0x0000)
struct ScriptableInteractiveTool_DisplayUserHelpMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_DisplayUserHelpMessage;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.DisplayUserWarningMessage
// 0x0010 (0x0010 - 0x0000)
struct ScriptableInteractiveTool_DisplayUserWarningMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_DisplayUserWarningMessage;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.ForcePropertySetUpdateByName
// 0x0010 (0x0010 - 0x0000)
struct ScriptableInteractiveTool_ForcePropertySetUpdateByName final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_ForcePropertySetUpdateByName;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.GetGizmoTransform
// 0x0070 (0x0070 - 0x0000)
struct ScriptableInteractiveTool_GetGizmoTransform final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_GetGizmoTransform;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.GetToolWorld
// 0x0008 (0x0008 - 0x0000)
struct ScriptableInteractiveTool_GetToolWorld final
{
public:
	class UWorld*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_GetToolWorld;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.OnGizmoTransformChanged
// 0x0070 (0x0070 - 0x0000)
struct ScriptableInteractiveTool_OnGizmoTransformChanged final
{
public:
	class FString                                 GizmoIdentifier;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             NewTransform;                                      // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_OnGizmoTransformChanged;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.OnGizmoTransformStateChange
// 0x0080 (0x0080 - 0x0000)
struct ScriptableInteractiveTool_OnGizmoTransformStateChange final
{
public:
	class FString                                 GizmoIdentifier;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             CurrentTransform;                                  // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScriptableToolGizmoStateChangeType           ChangeType;                                        // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_OnGizmoTransformStateChange;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.OnScriptDrawHUD
// 0x0008 (0x0008 - 0x0000)
struct ScriptableInteractiveTool_OnScriptDrawHUD final
{
public:
	class UScriptableTool_HUDAPI*                 DrawHUDAPI;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_OnScriptDrawHUD;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.OnScriptRender
// 0x0008 (0x0008 - 0x0000)
struct ScriptableInteractiveTool_OnScriptRender final
{
public:
	class UScriptableTool_RenderAPI*              RenderAPI;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_OnScriptRender;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.OnScriptShutdown
// 0x0001 (0x0001 - 0x0000)
struct ScriptableInteractiveTool_OnScriptShutdown final
{
public:
	EToolShutdownType                             ShutdownType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_OnScriptShutdown;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.OnScriptTick
// 0x0004 (0x0004 - 0x0000)
struct ScriptableInteractiveTool_OnScriptTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_OnScriptTick;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.RemovePropertySetByName
// 0x0018 (0x0018 - 0x0000)
struct ScriptableInteractiveTool_RemovePropertySetByName final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EToolsFrameworkOutcomePins                    Outcome;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_RemovePropertySetByName;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.RequestToolShutdown
// 0x0018 (0x0018 - 0x0000)
struct ScriptableInteractiveTool_RequestToolShutdown final
{
public:
	bool                                          bAccept;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowUserPopupMessage;                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   UserMessage;                                       // 0x0008(0x0010)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_RequestToolShutdown;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.RestorePropertySetSettings
// 0x0020 (0x0020 - 0x0000)
struct ScriptableInteractiveTool_RestorePropertySetSettings final
{
public:
	class UScriptableInteractiveToolPropertySet*  PropertySet;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveKey;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableInteractiveToolPropertySet*  ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_RestorePropertySetSettings;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.SavePropertySetSettings
// 0x0020 (0x0020 - 0x0000)
struct ScriptableInteractiveTool_SavePropertySetSettings final
{
public:
	class UScriptableInteractiveToolPropertySet*  PropertySet;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveKey;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableInteractiveToolPropertySet*  ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_SavePropertySetSettings;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.SetGizmoTransform
// 0x0080 (0x0080 - 0x0000)
struct ScriptableInteractiveTool_SetGizmoTransform final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             NewTransform;                                      // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUndoable;                                         // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_SetGizmoTransform;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.SetGizmoVisible
// 0x0018 (0x0018 - 0x0000)
struct ScriptableInteractiveTool_SetGizmoVisible final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisible;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_SetGizmoVisible;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.SetOverlayWidget
// 0x0010 (0x0010 - 0x0000)
struct ScriptableInteractiveTool_SetOverlayWidget final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMakeDraggable;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_SetOverlayWidget;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.SetPropertySetVisibleByName
// 0x0018 (0x0018 - 0x0000)
struct ScriptableInteractiveTool_SetPropertySetVisibleByName final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisible;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_SetPropertySetVisibleByName;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.WatchBoolProperty
// 0x0030 (0x0030 - 0x0000)
struct ScriptableInteractiveTool_WatchBoolProperty final
{
public:
	class UScriptableInteractiveToolPropertySet*  PropertySet;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, bool bNewValue)> OnModified; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableInteractiveToolPropertySet*  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_WatchBoolProperty;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.WatchEnumProperty
// 0x0030 (0x0030 - 0x0000)
struct ScriptableInteractiveTool_WatchEnumProperty final
{
public:
	class UScriptableInteractiveToolPropertySet*  PropertySet;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, uint8 NewValue)> OnModified; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableInteractiveToolPropertySet*  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_WatchEnumProperty;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.WatchFloatProperty
// 0x0030 (0x0030 - 0x0000)
struct ScriptableInteractiveTool_WatchFloatProperty final
{
public:
	class UScriptableInteractiveToolPropertySet*  PropertySet;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, double NewValue)> OnModified; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableInteractiveToolPropertySet*  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_WatchFloatProperty;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.WatchIntProperty
// 0x0030 (0x0030 - 0x0000)
struct ScriptableInteractiveTool_WatchIntProperty final
{
public:
	class UScriptableInteractiveToolPropertySet*  PropertySet;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, int32 NewValue)> OnModified; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableInteractiveToolPropertySet*  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_WatchIntProperty;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.WatchNameProperty
// 0x0030 (0x0030 - 0x0000)
struct ScriptableInteractiveTool_WatchNameProperty final
{
public:
	class UScriptableInteractiveToolPropertySet*  PropertySet;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, class FName NewValue)> OnModified; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableInteractiveToolPropertySet*  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_WatchNameProperty;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.WatchObjectProperty
// 0x0030 (0x0030 - 0x0000)
struct ScriptableInteractiveTool_WatchObjectProperty final
{
public:
	class UScriptableInteractiveToolPropertySet*  PropertySet;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, class UObject* NewValue)> OnModified; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableInteractiveToolPropertySet*  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_WatchObjectProperty;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.WatchProperty
// 0x0030 (0x0030 - 0x0000)
struct ScriptableInteractiveTool_WatchProperty final
{
public:
	class UScriptableInteractiveToolPropertySet*  PropertySet;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName)> OnModified; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableInteractiveToolPropertySet*  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_WatchProperty;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.WatchStringProperty
// 0x0030 (0x0030 - 0x0000)
struct ScriptableInteractiveTool_WatchStringProperty final
{
public:
	class UScriptableInteractiveToolPropertySet*  PropertySet;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, const class FString& NewValue)> OnModified; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableInteractiveToolPropertySet*  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_WatchStringProperty;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.GetDefaultLineSet
// 0x0008 (0x0008 - 0x0000)
struct ScriptableInteractiveTool_GetDefaultLineSet final
{
public:
	class UScriptableToolLineSet*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_GetDefaultLineSet;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.GetDefaultPointSet
// 0x0008 (0x0008 - 0x0000)
struct ScriptableInteractiveTool_GetDefaultPointSet final
{
public:
	class UScriptableToolPointSet*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_GetDefaultPointSet;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.GetDefaultTriangleSet
// 0x0008 (0x0008 - 0x0000)
struct ScriptableInteractiveTool_GetDefaultTriangleSet final
{
public:
	class UScriptableToolTriangleSet*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_GetDefaultTriangleSet;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.GetToolTargets
// 0x0010 (0x0010 - 0x0000)
struct ScriptableInteractiveTool_GetToolTargets final
{
public:
	TArray<class UToolTarget*>                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_GetToolTargets;

// Function ScriptableToolsFramework.ScriptableInteractiveTool.OnScriptCanAccept
// 0x0001 (0x0001 - 0x0000)
struct ScriptableInteractiveTool_OnScriptCanAccept final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveTool_OnScriptCanAccept;

// Function ScriptableToolsFramework.ScriptableClickDragTool.GetActiveModifiers
// 0x0003 (0x0003 - 0x0000)
struct ScriptableClickDragTool_GetActiveModifiers final
{
public:
	struct FScriptableToolModifierStates          ReturnValue;                                       // 0x0000(0x0003)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableClickDragTool_GetActiveModifiers;

// Function ScriptableToolsFramework.ScriptableClickDragTool.OnDragBegin
// 0x0050 (0x0050 - 0x0000)
struct ScriptableClickDragTool_OnDragBegin final
{
public:
	struct FInputDeviceRay                        StartPosition;                                     // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableClickDragTool_OnDragBegin;

// Function ScriptableToolsFramework.ScriptableClickDragTool.OnDragEnd
// 0x0050 (0x0050 - 0x0000)
struct ScriptableClickDragTool_OnDragEnd final
{
public:
	struct FInputDeviceRay                        EndPosition;                                       // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableClickDragTool_OnDragEnd;

// Function ScriptableToolsFramework.ScriptableClickDragTool.OnDragUpdatePosition
// 0x0050 (0x0050 - 0x0000)
struct ScriptableClickDragTool_OnDragUpdatePosition final
{
public:
	struct FInputDeviceRay                        NewPosition;                                       // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableClickDragTool_OnDragUpdatePosition;

// Function ScriptableToolsFramework.ScriptableClickDragTool.OnHoverBegin
// 0x0050 (0x0050 - 0x0000)
struct ScriptableClickDragTool_OnHoverBegin final
{
public:
	struct FInputDeviceRay                        HoverPos;                                          // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableClickDragTool_OnHoverBegin;

// Function ScriptableToolsFramework.ScriptableClickDragTool.OnHoverEnd
// 0x0003 (0x0003 - 0x0000)
struct ScriptableClickDragTool_OnHoverEnd final
{
public:
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0000(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableClickDragTool_OnHoverEnd;

// Function ScriptableToolsFramework.ScriptableClickDragTool.OnHoverHitTest
// 0x0090 (0x0090 - 0x0000)
struct ScriptableClickDragTool_OnHoverHitTest final
{
public:
	struct FInputDeviceRay                        HoverPos;                                          // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputRayHit                           ReturnValue;                                       // 0x0050(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableClickDragTool_OnHoverHitTest;

// Function ScriptableToolsFramework.ScriptableClickDragTool.OnHoverUpdate
// 0x0050 (0x0050 - 0x0000)
struct ScriptableClickDragTool_OnHoverUpdate final
{
public:
	struct FInputDeviceRay                        HoverPos;                                          // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x004B(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableClickDragTool_OnHoverUpdate;

// Function ScriptableToolsFramework.ScriptableClickDragTool.TestIfCanBeginClickDrag
// 0x0090 (0x0090 - 0x0000)
struct ScriptableClickDragTool_TestIfCanBeginClickDrag final
{
public:
	struct FInputDeviceRay                        ClickPos;                                          // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputRayHit                           ReturnValue;                                       // 0x0050(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableClickDragTool_TestIfCanBeginClickDrag;

// Function ScriptableToolsFramework.ScriptableClickDragTool.InActiveClickDrag
// 0x0001 (0x0001 - 0x0000)
struct ScriptableClickDragTool_InActiveClickDrag final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableClickDragTool_InActiveClickDrag;

// Function ScriptableToolsFramework.ScriptableClickDragTool.InActiveHover
// 0x0001 (0x0001 - 0x0000)
struct ScriptableClickDragTool_InActiveHover final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableClickDragTool_InActiveHover;

// Function ScriptableToolsFramework.ScriptableClickDragTool.IsAltDown
// 0x0001 (0x0001 - 0x0000)
struct ScriptableClickDragTool_IsAltDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableClickDragTool_IsAltDown;

// Function ScriptableToolsFramework.ScriptableClickDragTool.IsCtrlDown
// 0x0001 (0x0001 - 0x0000)
struct ScriptableClickDragTool_IsCtrlDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableClickDragTool_IsCtrlDown;

// Function ScriptableToolsFramework.ScriptableClickDragTool.IsShiftDown
// 0x0001 (0x0001 - 0x0000)
struct ScriptableClickDragTool_IsShiftDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableClickDragTool_IsShiftDown;

// Function ScriptableToolsFramework.ScriptableTool_RenderAPI.DrawLine
// 0x0058 (0x0058 - 0x0000)
struct ScriptableTool_RenderAPI_DrawLine final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                End;                                               // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0030(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthBias;                                         // 0x0044(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDepthTested;                                      // 0x0048(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptableTool_RenderAPI*              ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableTool_RenderAPI_DrawLine;

// Function ScriptableToolsFramework.ScriptableTool_RenderAPI.DrawRectWidthHeightXY
// 0x00A0 (0x00A0 - 0x0000)
struct ScriptableTool_RenderAPI_DrawRectWidthHeightXY final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Width;                                             // 0x0060(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Height;                                            // 0x0068(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0070(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineThickness;                                     // 0x0080(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthBias;                                         // 0x0084(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDepthTested;                                      // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCentered;                                         // 0x0089(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptableTool_RenderAPI*              ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableTool_RenderAPI_DrawRectWidthHeightXY;

// Function ScriptableToolsFramework.ScriptableTool_HUDAPI.DrawTextArrayAtLocation
// 0x0048 (0x0048 - 0x0000)
struct ScriptableTool_HUDAPI_DrawTextArrayAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Strings;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0028(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCentered;                                         // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShiftRowsY;                                        // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableTool_HUDAPI*                 ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableTool_HUDAPI_DrawTextArrayAtLocation;

// Function ScriptableToolsFramework.ScriptableTool_HUDAPI.DrawTextAtLocation
// 0x0048 (0x0048 - 0x0000)
struct ScriptableTool_HUDAPI_DrawTextAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 String;                                            // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0028(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCentered;                                         // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShiftRowsY;                                        // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableTool_HUDAPI*                 ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableTool_HUDAPI_DrawTextAtLocation;

// Function ScriptableToolsFramework.ScriptableTool_HUDAPI.GetCanvasLocation
// 0x0030 (0x0030 - 0x0000)
struct ScriptableTool_HUDAPI_GetCanvasLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CanvasLocation;                                    // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptableTool_HUDAPI*                 ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableTool_HUDAPI_GetCanvasLocation;

// Function ScriptableToolsFramework.ScriptableInteractiveToolPropertySet.GetOwningTool
// 0x0010 (0x0010 - 0x0000)
struct ScriptableInteractiveToolPropertySet_GetOwningTool final
{
public:
	EToolsFrameworkOutcomePins                    Outcome;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptableInteractiveTool*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableInteractiveToolPropertySet_GetOwningTool;

// Function ScriptableToolsFramework.ScriptableToolsUtilityLibrary.MakeInputRayHit
// 0x0050 (0x0050 - 0x0000)
struct ScriptableToolsUtilityLibrary_MakeInputRayHit final
{
public:
	double                                        HitDepth;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OptionalHitObject;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputRayHit                           ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableToolsUtilityLibrary_MakeInputRayHit;

// Function ScriptableToolsFramework.ScriptableToolsUtilityLibrary.MakeInputRayHit_MaxDepth
// 0x0040 (0x0040 - 0x0000)
struct ScriptableToolsUtilityLibrary_MakeInputRayHit_MaxDepth final
{
public:
	struct FInputRayHit                           ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableToolsUtilityLibrary_MakeInputRayHit_MaxDepth;

// Function ScriptableToolsFramework.ScriptableToolsUtilityLibrary.MakeInputRayHit_Miss
// 0x0040 (0x0040 - 0x0000)
struct ScriptableToolsUtilityLibrary_MakeInputRayHit_Miss final
{
public:
	struct FInputRayHit                           ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableToolsUtilityLibrary_MakeInputRayHit_Miss;

// Function ScriptableToolsFramework.ScriptableSingleClickTool.GetActiveModifiers
// 0x0003 (0x0003 - 0x0000)
struct ScriptableSingleClickTool_GetActiveModifiers final
{
public:
	struct FScriptableToolModifierStates          ReturnValue;                                       // 0x0000(0x0003)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableSingleClickTool_GetActiveModifiers;

// Function ScriptableToolsFramework.ScriptableSingleClickTool.OnHitByClick
// 0x0050 (0x0050 - 0x0000)
struct ScriptableSingleClickTool_OnHitByClick final
{
public:
	struct FInputDeviceRay                        ClickPos;                                          // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableSingleClickTool_OnHitByClick;

// Function ScriptableToolsFramework.ScriptableSingleClickTool.OnHoverBegin
// 0x0050 (0x0050 - 0x0000)
struct ScriptableSingleClickTool_OnHoverBegin final
{
public:
	struct FInputDeviceRay                        HoverPos;                                          // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableSingleClickTool_OnHoverBegin;

// Function ScriptableToolsFramework.ScriptableSingleClickTool.OnHoverEnd
// 0x0003 (0x0003 - 0x0000)
struct ScriptableSingleClickTool_OnHoverEnd final
{
public:
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0000(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableSingleClickTool_OnHoverEnd;

// Function ScriptableToolsFramework.ScriptableSingleClickTool.OnHoverHitTest
// 0x0090 (0x0090 - 0x0000)
struct ScriptableSingleClickTool_OnHoverHitTest final
{
public:
	struct FInputDeviceRay                        HoverPos;                                          // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputRayHit                           ReturnValue;                                       // 0x0050(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableSingleClickTool_OnHoverHitTest;

// Function ScriptableToolsFramework.ScriptableSingleClickTool.OnHoverUpdate
// 0x0050 (0x0050 - 0x0000)
struct ScriptableSingleClickTool_OnHoverUpdate final
{
public:
	struct FInputDeviceRay                        HoverPos;                                          // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x004B(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ScriptableSingleClickTool_OnHoverUpdate;

// Function ScriptableToolsFramework.ScriptableSingleClickTool.TestIfHitByClick
// 0x0090 (0x0090 - 0x0000)
struct ScriptableSingleClickTool_TestIfHitByClick final
{
public:
	struct FInputDeviceRay                        ClickPos;                                          // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptableToolModifierStates          Modifiers;                                         // 0x0048(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputRayHit                           ReturnValue;                                       // 0x0050(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableSingleClickTool_TestIfHitByClick;

// Function ScriptableToolsFramework.ScriptableSingleClickTool.InActiveHover
// 0x0001 (0x0001 - 0x0000)
struct ScriptableSingleClickTool_InActiveHover final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableSingleClickTool_InActiveHover;

// Function ScriptableToolsFramework.ScriptableSingleClickTool.IsAltDown
// 0x0001 (0x0001 - 0x0000)
struct ScriptableSingleClickTool_IsAltDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableSingleClickTool_IsAltDown;

// Function ScriptableToolsFramework.ScriptableSingleClickTool.IsCtrlDown
// 0x0001 (0x0001 - 0x0000)
struct ScriptableSingleClickTool_IsCtrlDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableSingleClickTool_IsCtrlDown;

// Function ScriptableToolsFramework.ScriptableSingleClickTool.IsShiftDown
// 0x0001 (0x0001 - 0x0000)
struct ScriptableSingleClickTool_IsShiftDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScriptableSingleClickTool_IsShiftDown;

// Function ScriptableToolsFramework.ScriptableModularBehaviorTool.AddClickDragBehavior
// 0x0068 (0x0068 - 0x0000)
struct ScriptableModularBehaviorTool_AddClickDragBehavior final
{
public:
	TDelegate<void(const struct FInputDeviceRay& PressPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> CanBeginClickDragSequence; // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FInputDeviceRay& PressPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickPress; // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FInputDeviceRay& DragPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickDrag; // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FInputDeviceRay& ReleasePos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickRelease; // 0x0030(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnTerminateDragSequence; // 0x0040(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
