#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScriptableToolsFramework

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "ScriptableToolsFramework_structs.hpp"
#include "InputCore_structs.hpp"
#include "InteractiveToolsFramework_structs.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ScriptableToolsFramework.ScriptableInteractiveTool
// 0x0250 (0x02E8 - 0x0098)
class UScriptableInteractiveTool : public UInteractiveTool
{
public:
	class FText                                   ToolName;                                          // 0x0098(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ToolLongName;                                      // 0x00A8(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ToolCategory;                                      // 0x00B8(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ToolTooltip;                                       // 0x00C8(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 CustomIconPath;                                    // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowToolInEditor;                                 // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScriptableToolShutdownType                   ToolShutdownType;                                  // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScriptableToolStartupRequirements            ToolStartupRequirements;                           // 0x00EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCustomScriptableToolBuilder> CustomToolBuilderClass;                          // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UToolTargetScriptableToolBuilder> ToolTargetToolBuilderClass;                  // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UWorld>                  TargetWorld;                                       // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScriptableTool_RenderAPI*              RenderHelper;                                      // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UScriptableTool_HUDAPI*                 DrawHUDHelper;                                     // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_118[0xD0];                                     // 0x0118(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UCombinedTransformGizmo*> Gizmos;                                      // 0x01E8(0x0050)(Transient, DuplicateTransient, NonTransactional, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class UToolTarget*>                    Targets;                                           // 0x0238(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UScriptableToolLineSet*                 DefaultLineSet;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class UScriptableToolLineSet*>         LineSets;                                          // 0x0250(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UScriptableToolPointSet*                DefaultPointSet;                                   // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class UScriptableToolPointSet*>        PointSets;                                         // 0x0268(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UScriptableToolTriangleSet*             DefaultTriangleSet;                                // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class UScriptableToolTriangleSet*>     TriangleSets;                                      // 0x0280(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UPreviewGeometry*                       ToolDrawableGeometry;                              // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	struct FScriptableToolGroupSet                GroupTags;                                         // 0x0298(0x0050)(Edit, Transient, NativeAccessSpecifierPublic)

public:
	class UScriptableToolLineSet* AddLineSet();
	void AddLogMessage(const class FText& Message, bool bHighlighted);
	class UScriptableToolPointSet* AddPointSet();
	class UScriptableInteractiveToolPropertySet* AddPropertySetOfType(TSubclassOf<class UScriptableInteractiveToolPropertySet> PropertySetType, const class FString& Identifier, EToolsFrameworkOutcomePins* Outcome);
	class UScriptableToolTriangleSet* AddTriangleSet();
	void ClearOverlayWidget();
	void ClearUserMessages(bool bHelpMessage, bool bWarningMessage);
	void CreateTRSGizmo(const class FString& Identifier, const struct FTransform& InitialTransform, const struct FScriptableToolGizmoOptions& GizmoOptions, EToolsFrameworkOutcomePins* Outcome);
	void DestroyTRSGizmo(const class FString& Identifier, EToolsFrameworkOutcomePins* Outcome);
	void DisplayUserHelpMessage(const class FText& Message);
	void DisplayUserWarningMessage(const class FText& Message);
	void ForcePropertySetUpdateByName(const class FString& Identifier);
	struct FTransform GetGizmoTransform(const class FString& Identifier);
	class UWorld* GetToolWorld();
	void OnGizmoTransformChanged(const class FString& GizmoIdentifier, const struct FTransform& NewTransform);
	void OnGizmoTransformStateChange(const class FString& GizmoIdentifier, const struct FTransform& CurrentTransform, EScriptableToolGizmoStateChangeType ChangeType);
	void OnScriptDrawHUD(class UScriptableTool_HUDAPI* DrawHUDAPI);
	void OnScriptRender(class UScriptableTool_RenderAPI* RenderAPI);
	void OnScriptSetup();
	void OnScriptShutdown(EToolShutdownType ShutdownType);
	void OnScriptTick(float DeltaTime);
	void RemovePropertySetByName(const class FString& Identifier, EToolsFrameworkOutcomePins* Outcome);
	void RequestToolShutdown(bool bAccept, bool bShowUserPopupMessage, const class FText& UserMessage);
	class UScriptableInteractiveToolPropertySet* RestorePropertySetSettings(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& SaveKey);
	class UScriptableInteractiveToolPropertySet* SavePropertySetSettings(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& SaveKey);
	void SetGizmoTransform(const class FString& Identifier, const struct FTransform& NewTransform, bool bUndoable);
	void SetGizmoVisible(const class FString& Identifier, bool bVisible);
	void SetOverlayWidget(class UUserWidget* Widget, bool bMakeDraggable);
	void SetPropertySetVisibleByName(const class FString& Identifier, bool bVisible);
	class UScriptableInteractiveToolPropertySet* WatchBoolProperty(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, const TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, bool bNewValue)>& OnModified);
	class UScriptableInteractiveToolPropertySet* WatchEnumProperty(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, const TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, uint8 NewValue)>& OnModified);
	class UScriptableInteractiveToolPropertySet* WatchFloatProperty(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, const TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, double NewValue)>& OnModified);
	class UScriptableInteractiveToolPropertySet* WatchIntProperty(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, const TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, int32 NewValue)>& OnModified);
	class UScriptableInteractiveToolPropertySet* WatchNameProperty(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, const TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, class FName NewValue)>& OnModified);
	class UScriptableInteractiveToolPropertySet* WatchObjectProperty(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, const TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, class UObject* NewValue)>& OnModified);
	class UScriptableInteractiveToolPropertySet* WatchProperty(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, const TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName)>& OnModified);
	class UScriptableInteractiveToolPropertySet* WatchStringProperty(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, const TDelegate<void(class UScriptableInteractiveToolPropertySet* PropertySet, const class FString& PropertyName, const class FString& NewValue)>& OnModified);

	class UScriptableToolLineSet* GetDefaultLineSet() const;
	class UScriptableToolPointSet* GetDefaultPointSet() const;
	class UScriptableToolTriangleSet* GetDefaultTriangleSet() const;
	TArray<class UToolTarget*> GetToolTargets() const;
	bool OnScriptCanAccept() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableInteractiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableInteractiveTool")
	}
	static class UScriptableInteractiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableInteractiveTool>();
	}
};
DUMPER7_ASSERTS_UScriptableInteractiveTool;

// Class ScriptableToolsFramework.ScriptableToolBehavior
// 0x0000 (0x0028 - 0x0028)
class UScriptableToolBehavior : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolBehavior")
	}
	static class UScriptableToolBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolBehavior>();
	}
};
DUMPER7_ASSERTS_UScriptableToolBehavior;

// Class ScriptableToolsFramework.ScriptableToolClickDragBehavior
// 0x0080 (0x00A8 - 0x0028)
class UScriptableToolClickDragBehavior final : public UScriptableToolBehavior
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptableModularBehaviorTool*         BehaviorHost;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class UClickDragInputBehavior*                Behavior;                                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TDelegate<void(const struct FInputDeviceState& InputDeviceState)> ModifierCheckFunc;             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& PressPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> TestCanBeginClickDragSequenceFunc; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& PressPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickPressFunc; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& DragPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickDragFunc; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& ReleasePos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickReleaseFunc; // 0x0080(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnTerminateDragSequenceFunc; // 0x0090(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EScriptableToolMouseButton                    MouseButton;                                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolClickDragBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolClickDragBehavior")
	}
	static class UScriptableToolClickDragBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolClickDragBehavior>();
	}
};
DUMPER7_ASSERTS_UScriptableToolClickDragBehavior;

// Class ScriptableToolsFramework.ScriptableClickDragTool
// 0x0038 (0x0320 - 0x02E8)
class UScriptableClickDragTool final : public UScriptableInteractiveTool
{
public:
	uint8                                         Pad_2E8[0x10];                                     // 0x02E8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bWantMouseHover;                                   // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateModifiersDuringDrag;                        // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClickDragInputBehavior*                ClickDragBehavior;                                 // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMouseHoverBehavior*                    MouseHoverBehavior;                                // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FScriptableToolModifierStates GetActiveModifiers();
	void OnDragBegin(const struct FInputDeviceRay& StartPosition, const struct FScriptableToolModifierStates& Modifiers);
	void OnDragEnd(const struct FInputDeviceRay& EndPosition, const struct FScriptableToolModifierStates& Modifiers);
	void OnDragSequenceCancelled();
	void OnDragUpdatePosition(const struct FInputDeviceRay& NewPosition, const struct FScriptableToolModifierStates& Modifiers);
	void OnHoverBegin(const struct FInputDeviceRay& HoverPos, const struct FScriptableToolModifierStates& Modifiers);
	void OnHoverEnd(const struct FScriptableToolModifierStates& Modifiers);
	struct FInputRayHit OnHoverHitTest(const struct FInputDeviceRay& HoverPos, const struct FScriptableToolModifierStates& Modifiers);
	bool OnHoverUpdate(const struct FInputDeviceRay& HoverPos, const struct FScriptableToolModifierStates& Modifiers);
	struct FInputRayHit TestIfCanBeginClickDrag(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers);

	bool InActiveClickDrag() const;
	bool InActiveHover() const;
	bool IsAltDown() const;
	bool IsCtrlDown() const;
	bool IsShiftDown() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableClickDragTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableClickDragTool")
	}
	static class UScriptableClickDragTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableClickDragTool>();
	}
};
DUMPER7_ASSERTS_UScriptableClickDragTool;

// Class ScriptableToolsFramework.ScriptableTool_RenderAPI
// 0x0008 (0x0030 - 0x0028)
class UScriptableTool_RenderAPI final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UScriptableTool_RenderAPI* DrawLine(const struct FVector& Start, const struct FVector& End, const struct FLinearColor& Color, float Thickness, float DepthBias, bool bDepthTested);
	class UScriptableTool_RenderAPI* DrawRectWidthHeightXY(const struct FTransform& Transform, double Width, double Height, const struct FLinearColor& Color, float LineThickness, float DepthBias, bool bDepthTested, bool bCentered);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableTool_RenderAPI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableTool_RenderAPI")
	}
	static class UScriptableTool_RenderAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableTool_RenderAPI>();
	}
};
DUMPER7_ASSERTS_UScriptableTool_RenderAPI;

// Class ScriptableToolsFramework.CustomScriptableToolBuilderBaseInterface
// 0x0000 (0x0000 - 0x0000)
class ICustomScriptableToolBuilderBaseInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomScriptableToolBuilderBaseInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomScriptableToolBuilderBaseInterface")
	}
	static class ICustomScriptableToolBuilderBaseInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICustomScriptableToolBuilderBaseInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICustomScriptableToolBuilderBaseInterface;

// Class ScriptableToolsFramework.ScriptableTool_HUDAPI
// 0x0010 (0x0038 - 0x0028)
class UScriptableTool_HUDAPI final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UScriptableTool_HUDAPI* DrawTextArrayAtLocation(const struct FVector& Location, const TArray<class FString>& Strings, const struct FLinearColor& Color, bool bCentered, float ShiftRowsY);
	class UScriptableTool_HUDAPI* DrawTextAtLocation(const struct FVector& Location, const class FString& String, const struct FLinearColor& Color, bool bCentered, float ShiftRowsY);
	class UScriptableTool_HUDAPI* GetCanvasLocation(const struct FVector& Location, struct FVector2D* CanvasLocation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableTool_HUDAPI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableTool_HUDAPI")
	}
	static class UScriptableTool_HUDAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableTool_HUDAPI>();
	}
};
DUMPER7_ASSERTS_UScriptableTool_HUDAPI;

// Class ScriptableToolsFramework.ScriptableInteractiveToolPropertySet
// 0x0008 (0x00B0 - 0x00A8)
class UScriptableInteractiveToolPropertySet final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UScriptableInteractiveTool* GetOwningTool(EToolsFrameworkOutcomePins* Outcome);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableInteractiveToolPropertySet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableInteractiveToolPropertySet")
	}
	static class UScriptableInteractiveToolPropertySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableInteractiveToolPropertySet>();
	}
};
DUMPER7_ASSERTS_UScriptableInteractiveToolPropertySet;

// Class ScriptableToolsFramework.ScriptableToolsUtilityLibrary
// 0x0000 (0x0028 - 0x0028)
class UScriptableToolsUtilityLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FInputRayHit MakeInputRayHit(double HitDepth, class UObject* OptionalHitObject);
	static struct FInputRayHit MakeInputRayHit_MaxDepth();
	static struct FInputRayHit MakeInputRayHit_Miss();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolsUtilityLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolsUtilityLibrary")
	}
	static class UScriptableToolsUtilityLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolsUtilityLibrary>();
	}
};
DUMPER7_ASSERTS_UScriptableToolsUtilityLibrary;

// Class ScriptableToolsFramework.ScriptableModularBehaviorTool
// 0x0088 (0x0370 - 0x02E8)
class UScriptableModularBehaviorTool final : public UScriptableInteractiveTool
{
public:
	TArray<class UScriptableToolSingleClickBehavior*> SingleClickBehaviors;                          // 0x02E8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UScriptableToolDoubleClickBehavior*> DoubleClickBehaviors;                          // 0x02F8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UScriptableToolClickDragBehavior*> ClickDragBehaviors;                              // 0x0308(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UScriptableToolSingleClickOrDragBehavior*> SingleClickOrDragBehaviors;              // 0x0318(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UScriptableToolMouseWheelBehavior*> MouseWheelBehaviors;                            // 0x0328(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UScriptableToolClickSequenceBehavior*> MultiClickSequenceBehaviors;                 // 0x0338(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UScriptableToolMouseHoverBehavior*> MouseHoverBehaviors;                            // 0x0348(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UScriptableToolKeyInputBehavior*> KeyInputBehaviors;                                // 0x0358(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddClickDragBehavior(const TDelegate<void(const struct FInputDeviceRay& PressPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> CanBeginClickDragSequence, const TDelegate<void(const struct FInputDeviceRay& PressPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickPress, const TDelegate<void(const struct FInputDeviceRay& DragPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickDrag, const TDelegate<void(const struct FInputDeviceRay& ReleasePos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickRelease, const TDelegate<void(const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnTerminateDragSequence, const TDelegate<void(const struct FInputDeviceState& InputDeviceState)> CaptureCheck, int32 CapturePriority, EScriptableToolMouseButton MouseButton, bool bUpdateModifiersDuringDrag);
	void AddDoubleClickBehavior(const TDelegate<void(const struct FInputDeviceRay& ClickPos, EScriptableToolMouseButton MouseButton)> IfHitByClick, const TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnHitByClick, const TDelegate<void(const struct FInputDeviceState& InputDeviceState)> CaptureCheck, int32 CapturePriority, EScriptableToolMouseButton MouseButton, bool bHitTestOnRelease);
	void AddMouseHoverBehavior(TDelegate<void(const struct FInputDeviceRay& CurrentPos, const struct FScriptableToolModifierStates& Modifiers)> BeginHoverSequenceHitTest, TDelegate<void(const struct FInputDeviceRay& CurrentPos, const struct FScriptableToolModifierStates& Modifiers)> OnBeginHover, TDelegate<void(const struct FInputDeviceRay& CurrentPos, const struct FScriptableToolModifierStates& Modifiers)> OnUpdateHover, TDelegate<void()> OnEndHover, const TDelegate<void(const struct FInputDeviceState& InputDeviceState)> HoverCaptureCheck, int32 CapturePriority);
	void AddMouseWheelBehavior(TDelegate<void(const struct FInputDeviceRay& CurrentPos)> TestShouldRespondToMouseWheel, TDelegate<void(const struct FInputDeviceRay& CurrentPos, const struct FScriptableToolModifierStates& Modifiers)> OnMouseWheelScrollUp, TDelegate<void(const struct FInputDeviceRay& CurrentPos, const struct FScriptableToolModifierStates& Modifiers)> OnMouseWheelScrollDown, TDelegate<void(const struct FInputDeviceState& InputDeviceState)> CaptureCheck, int32 CapturePriority);
	void AddMultiClickSequenceBehavior(TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnBeginSequencePreview, TDelegate<void(const struct FInputDeviceRay& ClickPos, EScriptableToolMouseButton MouseButton)> CanBeginClickSequence, TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnBeginClickSequence, TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnNextSequencePreview, TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnNextSequenceClick, TDelegate<void(const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnTerminateClickSequence, TDelegate<void()> RequestAbortClickSequence, TDelegate<void(const struct FInputDeviceState& InputDeviceState)> CaptureCheck, const TDelegate<void(const struct FInputDeviceState& InputDeviceState)> HoverCaptureCheck, int32 CapturePriority, EScriptableToolMouseButton MouseButton);
	void AddMultiKeyInputBehavior(TDelegate<void(const struct FKey& Key, const struct FScriptableToolModifierStates& Modifiers)> OnKeyPressed, TDelegate<void(const struct FKey& Key, const struct FScriptableToolModifierStates& Modifiers)> OnKeyReleased, const TArray<struct FKey>& Keys, bool bRequireAllKeys, const TDelegate<void(const struct FInputDeviceState& InputDeviceState)> CaptureCheck, int32 CapturePriority);
	void AddSingleClickBehavior(const TDelegate<void(const struct FInputDeviceRay& ClickPos, EScriptableToolMouseButton MouseButton)> IfHitByClick, const TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnHitByClick, const TDelegate<void(const struct FInputDeviceState& InputDeviceState)> CaptureCheck, int32 CapturePriority, EScriptableToolMouseButton MouseButton, bool bHitTestOnRelease);
	void AddSingleClickOrDragBehavior(TDelegate<void(const struct FInputDeviceRay& ClickPos, EScriptableToolMouseButton MouseButton)> IfHitByClick, TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnHitByClick, TDelegate<void(const struct FInputDeviceRay& PressPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> CanBeginClickDragSequence, TDelegate<void(const struct FInputDeviceRay& PressPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickPress, TDelegate<void(const struct FInputDeviceRay& DragPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickDrag, TDelegate<void(const struct FInputDeviceRay& ReleasePos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnClickRelease, TDelegate<void(const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnTerminateDragSequence, TDelegate<void(const struct FInputDeviceState& InputDeviceState)> CaptureCheck, int32 CapturePriority, EScriptableToolMouseButton MouseButton, bool bBeginDragIfClickTargetNotHit, float ClickDistanceThreshold);
	void AddSingleKeyInputBehavior(TDelegate<void(const struct FKey& Key, const struct FScriptableToolModifierStates& Modifiers)> OnKeyPressed, TDelegate<void(const struct FKey& Key, const struct FScriptableToolModifierStates& Modifiers)> OnKeyReleased, const struct FKey& Key, const TDelegate<void(const struct FInputDeviceState& InputDeviceState)> CaptureCheck, int32 CapturePriority);
	struct FScriptableToolModifierStates GetActiveModifiers();

	bool IsAltDown() const;
	bool IsCtrlDown() const;
	bool IsShiftDown() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableModularBehaviorTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableModularBehaviorTool")
	}
	static class UScriptableModularBehaviorTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableModularBehaviorTool>();
	}
};
DUMPER7_ASSERTS_UScriptableModularBehaviorTool;

// Class ScriptableToolsFramework.ScriptableToolTargetRequirements
// 0x0040 (0x0068 - 0x0028)
class UScriptableToolTargetRequirements final : public UObject
{
public:
	int32                                         MinMatchingTargets;                                // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxMatchingTargets;                                // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x38];                                      // 0x0030(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UScriptableToolTargetRequirements* BuildToolTargetRequirements(const TArray<class UClass*>& RequirementInterfaces);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolTargetRequirements")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolTargetRequirements")
	}
	static class UScriptableToolTargetRequirements* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolTargetRequirements>();
	}
};
DUMPER7_ASSERTS_UScriptableToolTargetRequirements;

// Class ScriptableToolsFramework.ScriptableSingleClickTool
// 0x0030 (0x0318 - 0x02E8)
class UScriptableSingleClickTool final : public UScriptableInteractiveTool
{
public:
	uint8                                         Pad_2E8[0x10];                                     // 0x02E8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bWantMouseHover;                                   // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickInputBehavior*              SingleClickBehavior;                               // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UMouseHoverBehavior*                    MouseHoverBehavior;                                // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	uint8                                         Pad_310[0x8];                                      // 0x0310(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FScriptableToolModifierStates GetActiveModifiers();
	void OnHitByClick(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers);
	void OnHoverBegin(const struct FInputDeviceRay& HoverPos, const struct FScriptableToolModifierStates& Modifiers);
	void OnHoverEnd(const struct FScriptableToolModifierStates& Modifiers);
	struct FInputRayHit OnHoverHitTest(const struct FInputDeviceRay& HoverPos, const struct FScriptableToolModifierStates& Modifiers);
	bool OnHoverUpdate(const struct FInputDeviceRay& HoverPos, const struct FScriptableToolModifierStates& Modifiers);
	struct FInputRayHit TestIfHitByClick(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers);

	bool InActiveHover() const;
	bool IsAltDown() const;
	bool IsCtrlDown() const;
	bool IsShiftDown() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableSingleClickTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableSingleClickTool")
	}
	static class UScriptableSingleClickTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableSingleClickTool>();
	}
};
DUMPER7_ASSERTS_UScriptableSingleClickTool;

// Class ScriptableToolsFramework.BaseScriptableToolBuilder
// 0x0008 (0x0030 - 0x0028)
class UBaseScriptableToolBuilder : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseScriptableToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseScriptableToolBuilder")
	}
	static class UBaseScriptableToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseScriptableToolBuilder>();
	}
};
DUMPER7_ASSERTS_UBaseScriptableToolBuilder;

// Class ScriptableToolsFramework.CustomScriptableToolBuilderComponentBase
// 0x0000 (0x0028 - 0x0028)
class UCustomScriptableToolBuilderComponentBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomScriptableToolBuilderComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomScriptableToolBuilderComponentBase")
	}
	static class UCustomScriptableToolBuilderComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomScriptableToolBuilderComponentBase>();
	}
};
DUMPER7_ASSERTS_UCustomScriptableToolBuilderComponentBase;

// Class ScriptableToolsFramework.CustomScriptableToolBuilderContainer
// 0x0008 (0x0038 - 0x0030)
class UCustomScriptableToolBuilderContainer final : public UBaseScriptableToolBuilder
{
public:
	class UCustomScriptableToolBuilderComponentBase* BuilderInstance;                                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomScriptableToolBuilderContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomScriptableToolBuilderContainer")
	}
	static class UCustomScriptableToolBuilderContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomScriptableToolBuilderContainer>();
	}
};
DUMPER7_ASSERTS_UCustomScriptableToolBuilderContainer;

// Class ScriptableToolsFramework.CustomScriptableToolBuilder
// 0x0008 (0x0030 - 0x0028)
class UCustomScriptableToolBuilder final : public UCustomScriptableToolBuilderComponentBase
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool OnCanBuildTool(const TArray<class AActor*>& SelectedActors, const TArray<class UActorComponent*>& SelectedComponents) const;
	void OnSetupTool(class UScriptableInteractiveTool* Tool, const TArray<class AActor*>& SelectedActors, const TArray<class UActorComponent*>& SelectedComponents) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomScriptableToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomScriptableToolBuilder")
	}
	static class UCustomScriptableToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomScriptableToolBuilder>();
	}
};
DUMPER7_ASSERTS_UCustomScriptableToolBuilder;

// Class ScriptableToolsFramework.ToolTargetScriptableToolBuilder
// 0x0010 (0x0038 - 0x0028)
class UToolTargetScriptableToolBuilder final : public UCustomScriptableToolBuilderComponentBase
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptableToolTargetRequirements*      Requirements;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	class UScriptableToolTargetRequirements* GetToolTargetRequirements() const;
	void OnSetupTool(class UScriptableInteractiveTool* Tool) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ToolTargetScriptableToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ToolTargetScriptableToolBuilder")
	}
	static class UToolTargetScriptableToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolTargetScriptableToolBuilder>();
	}
};
DUMPER7_ASSERTS_UToolTargetScriptableToolBuilder;

// Class ScriptableToolsFramework.ScriptableToolContextObject
// 0x0000 (0x0028 - 0x0028)
class UScriptableToolContextObject : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolContextObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolContextObject")
	}
	static class UScriptableToolContextObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolContextObject>();
	}
};
DUMPER7_ASSERTS_UScriptableToolContextObject;

// Class ScriptableToolsFramework.ScriptableToolViewportWidgetAPI
// 0x0098 (0x00C0 - 0x0028)
class UScriptableToolViewportWidgetAPI final : public UScriptableToolContextObject
{
public:
	uint8                                         Pad_28[0x98];                                      // 0x0028(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolViewportWidgetAPI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolViewportWidgetAPI")
	}
	static class UScriptableToolViewportWidgetAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolViewportWidgetAPI>();
	}
};
DUMPER7_ASSERTS_UScriptableToolViewportWidgetAPI;

// Class ScriptableToolsFramework.ScriptableToolSingleClickBehavior
// 0x0050 (0x0078 - 0x0028)
class UScriptableToolSingleClickBehavior : public UScriptableToolBehavior
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptableModularBehaviorTool*         BehaviorHost;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class USingleClickInputBehavior*              Behavior;                                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TDelegate<void(const struct FInputDeviceState& InputDeviceState)> ModifierCheckFunc;             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& ClickPos, EScriptableToolMouseButton MouseButton)> TestIfHitByClickFunc; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnHitByClickFunc; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EScriptableToolMouseButton                    MouseButton;                                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolSingleClickBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolSingleClickBehavior")
	}
	static class UScriptableToolSingleClickBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolSingleClickBehavior>();
	}
};
DUMPER7_ASSERTS_UScriptableToolSingleClickBehavior;

// Class ScriptableToolsFramework.ScriptableToolDoubleClickBehavior
// 0x0000 (0x0078 - 0x0078)
class UScriptableToolDoubleClickBehavior final : public UScriptableToolSingleClickBehavior
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolDoubleClickBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolDoubleClickBehavior")
	}
	static class UScriptableToolDoubleClickBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolDoubleClickBehavior>();
	}
};
DUMPER7_ASSERTS_UScriptableToolDoubleClickBehavior;

// Class ScriptableToolsFramework.ScriptableToolGroupTag
// 0x0010 (0x0038 - 0x0028)
class UScriptableToolGroupTag final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolGroupTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolGroupTag")
	}
	static class UScriptableToolGroupTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolGroupTag>();
	}
};
DUMPER7_ASSERTS_UScriptableToolGroupTag;

// Class ScriptableToolsFramework.ScriptableToolKeyInputBehavior
// 0x0058 (0x0080 - 0x0028)
class UScriptableToolKeyInputBehavior final : public UScriptableToolBehavior
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptableModularBehaviorTool*         BehaviorHost;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class UKeyInputBehavior*                      Behavior;                                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TDelegate<void(const struct FInputDeviceState& InputDeviceState)> ModifierCheckFunc;             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FKey& Key, const struct FScriptableToolModifierStates& Modifiers)> OnKeyPressedFunc; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FKey& Key, const struct FScriptableToolModifierStates& Modifiers)> OnKeyReleasedFunc; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FKey>                           ListenKeys;                                        // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolKeyInputBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolKeyInputBehavior")
	}
	static class UScriptableToolKeyInputBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolKeyInputBehavior>();
	}
};
DUMPER7_ASSERTS_UScriptableToolKeyInputBehavior;

// Class ScriptableToolsFramework.ScriptableToolLine
// 0x0048 (0x0070 - 0x0028)
class UScriptableToolLine final : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsDirty;                                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LineID;                                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetLineColor(const struct FColor& Color);
	void SetLineDepthBias(float DepthBias);
	void SetLineEnd(const struct FVector& End);
	void SetLineEndPoints(const struct FVector& Start, const struct FVector& End);
	void SetLineStart(const struct FVector& Start);
	void SetLineThickness(float Thickness);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolLine")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolLine")
	}
	static class UScriptableToolLine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolLine>();
	}
};
DUMPER7_ASSERTS_UScriptableToolLine;

// Class ScriptableToolsFramework.ScriptableToolLineSet
// 0x0020 (0x0048 - 0x0028)
class UScriptableToolLineSet final : public UObject
{
public:
	class UPreviewGeometry*                       ToolDrawableGeometry;                              // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class ULineSetComponent*                      LineSet;                                           // 0x0030(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NonTransactional, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TArray<class UScriptableToolLine*>            LineComponents;                                    // 0x0038(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	class UScriptableToolLine* AddLine();
	void RemoveAllLines();
	void RemoveLine(class UScriptableToolLine* Line);
	void SetAllLinesColor(const struct FColor& Color);
	void SetAllLinesThickness(float Thickness);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolLineSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolLineSet")
	}
	static class UScriptableToolLineSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolLineSet>();
	}
};
DUMPER7_ASSERTS_UScriptableToolLineSet;

// Class ScriptableToolsFramework.ScriptableToolMouseHoverBehavior
// 0x0068 (0x0090 - 0x0028)
class UScriptableToolMouseHoverBehavior final : public UScriptableToolBehavior
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptableModularBehaviorTool*         BehaviorHost;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class UMouseHoverBehavior*                    Behavior;                                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TDelegate<void(const struct FInputDeviceState& InputDeviceState)> HoverModifierCheckFunc;        // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& CurrentPos, const struct FScriptableToolModifierStates& Modifiers)> BeginHoverSequenceHitTestFunc; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& CurrentPos, const struct FScriptableToolModifierStates& Modifiers)> OnBeginHoverFunc; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& CurrentPos, const struct FScriptableToolModifierStates& Modifiers)> OnUpdateHoverFunc; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void()>                             OnEndHoverFunc;                                    // 0x0080(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolMouseHoverBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolMouseHoverBehavior")
	}
	static class UScriptableToolMouseHoverBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolMouseHoverBehavior>();
	}
};
DUMPER7_ASSERTS_UScriptableToolMouseHoverBehavior;

// Class ScriptableToolsFramework.ScriptableToolMouseWheelBehavior
// 0x0058 (0x0080 - 0x0028)
class UScriptableToolMouseWheelBehavior final : public UScriptableToolBehavior
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptableModularBehaviorTool*         BehaviorHost;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class UMouseWheelInputBehavior*               Behavior;                                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TDelegate<void(const struct FInputDeviceState& InputDeviceState)> ModifierCheckFunc;             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& CurrentPos)> TestShouldRespondToMouseWheelFunc;     // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& CurrentPos, const struct FScriptableToolModifierStates& Modifiers)> OnMouseWheelScrollUpFunc; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& CurrentPos, const struct FScriptableToolModifierStates& Modifiers)> OnMouseWheelScrollDownFunc; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScriptableToolMouseWheelBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScriptableToolMouseWheelBehavior")
	}
	static class UScriptableToolMouseWheelBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScriptableToolMouseWheelBehavior>();
	}
};
DUMPER7_ASSERTS_UScriptableToolMouseWheelBehavior;

// Class ScriptableToolsFramework.ScriptableToolClickSequenceBehavior
// 0x00B0 (0x00D8 - 0x0028)
class UScriptableToolClickSequenceBehavior final : public UScriptableToolBehavior
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptableModularBehaviorTool*         BehaviorHost;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class UMultiClickSequenceInputBehavior*       Behavior;                                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TDelegate<void(const struct FInputDeviceState& InputDeviceState)> ModifierCheckFunc;             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceState& InputDeviceState)> HoverModifierCheckFunc;        // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnBeginSequencePreviewFunc; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& ClickPos, EScriptableToolMouseButton MouseButton)> CanBeginClickSequenceFunc; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnBeginClickSequenceFunc; // 0x0080(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnNextSequencePreviewFunc; // 0x0090(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FInputDeviceRay& ClickPos, const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnNextSequenceClickFunc; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void(const struct FScriptableToolModifierStates& Modifiers, EScriptableToolMouseButton MouseButton)> OnTerminateClickSequenceFunc; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TDelegate<void()>                             RequestAbortClickSequenceFunc;                     // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EScriptableToolMouseButton                    MouseButton;                                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
