#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Selector_ASA_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Selector_ASA_Widget.Selector_ASA_Widget_C
// 0x0068 (0x03E0 - 0x0378)
class USelector_ASA_Widget_C : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanel*                      Grid;                                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     IconsForOptions;                                   // 0x0388(0x0010)(Edit, BlueprintVisible)
	int32                                         SelectedOption;                                    // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 OptionClass;                                       // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxItemsColumn;                                    // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRow;                                        // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentColumn;                                     // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         OptionsNames;                                      // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          PreventNamesOnSelections;                          // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        IconsForOptionsAssets;                             // 0x03D0(0x0010)(Edit, BlueprintVisible)

public:
	void BPExecutedCommandForPrimalUI(class FName CommandName, const struct FBPNetExecParams& ExecParams);
	void ClearWidgetsAndRefresh();
	void Construct();
	void ExecuteUbergraph_Selector_ASA_Widget(int32 EntryPoint);
	void GetOptions(TArray<class UTexture2D*>* Icons, TArray<class FString>* Names);
	void PreConstruct(bool IsDesignTime);
	void RefreshOptions();
	void SetValueChangedToParent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Selector_ASA_Widget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Selector_ASA_Widget_C")
	}
	static class USelector_ASA_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USelector_ASA_Widget_C>();
	}
};
DUMPER7_ASSERTS_USelector_ASA_Widget_C;

}

