#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sentry

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "Sentry_structs.hpp"


namespace SDK
{

// Class Sentry.SentryAttachment
// 0x0010 (0x0038 - 0x0028)
class USentryAttachment final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitializeWithData(const TArray<uint8>& Data, const class FString& Filename, const class FString& ContentType);
	void InitializeWithPath(const class FString& Path, const class FString& Filename, const class FString& ContentType);

	class FString GetContentType() const;
	TArray<uint8> GetData() const;
	class FString GetFilename() const;
	class FString GetPath() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SentryAttachment")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SentryAttachment")
	}
	static class USentryAttachment* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentryAttachment>();
	}
};
DUMPER7_ASSERTS_USentryAttachment;

// Class Sentry.SentryBreadcrumb
// 0x0010 (0x0038 - 0x0028)
class USentryBreadcrumb final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCategory(const class FString& Category);
	void SetData(const TMap<class FString, class FString>& Data);
	void SetLevel(ESentryLevel Level);
	void SetMessage(const class FString& Message);
	void SetType(const class FString& Type);

	class FString GetCategory() const;
	TMap<class FString, class FString> GetData() const;
	ESentryLevel GetLevel() const;
	class FString GetMessage() const;
	class FString GetType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SentryBreadcrumb")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SentryBreadcrumb")
	}
	static class USentryBreadcrumb* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentryBreadcrumb>();
	}
};
DUMPER7_ASSERTS_USentryBreadcrumb;

// Class Sentry.SentryEvent
// 0x0010 (0x0038 - 0x0028)
class USentryEvent final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLevel(ESentryLevel Level);
	void SetMessage(const class FString& Message);

	ESentryLevel GetLevel() const;
	class FString GetMessage() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SentryEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SentryEvent")
	}
	static class USentryEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentryEvent>();
	}
};
DUMPER7_ASSERTS_USentryEvent;

// Class Sentry.SentryId
// 0x0010 (0x0038 - 0x0028)
class USentryId final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString ToString() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SentryId")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SentryId")
	}
	static class USentryId* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentryId>();
	}
};
DUMPER7_ASSERTS_USentryId;

// Class Sentry.SentryLibrary
// 0x0000 (0x0028 - 0x0028)
class USentryLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FString ByteArrayToString(const TArray<uint8>& Array);
	static class USentryAttachment* CreateSentryAttachmentWithData(const TArray<uint8>& Data, const class FString& Filename, const class FString& ContentType);
	static class USentryAttachment* CreateSentryAttachmentWithPath(const class FString& Path, const class FString& Filename, const class FString& ContentType);
	static class USentryBreadcrumb* CreateSentryBreadcrumb(const class FString& Message, const class FString& Type, const class FString& Category, const TMap<class FString, class FString>& Data, ESentryLevel Level);
	static class USentryEvent* CreateSentryEvent(const class FString& Message, ESentryLevel Level);
	static class USentryUser* CreateSentryUser(const class FString& email, const class FString& ID, const class FString& username, const class FString& IpAddress, const TMap<class FString, class FString>& Data);
	static class USentryUserFeedback* CreateSentryUserFeedback(class USentryId* EventId, const class FString& Name_0, const class FString& email, const class FString& Comments);
	static class FString SaveStringToFile(const class FString& InString, const class FString& Filename);
	static TArray<uint8> StringToBytesArray(const class FString& InString);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SentryLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SentryLibrary")
	}
	static class USentryLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentryLibrary>();
	}
};
DUMPER7_ASSERTS_USentryLibrary;

// Class Sentry.SentryScope
// 0x0010 (0x0038 - 0x0028)
class USentryScope final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddAttachment(class USentryAttachment* Attachment);
	void AddBreadcrumb(class USentryBreadcrumb* Breadcrumb);
	void Clear();
	void ClearAttachments();
	void ClearBreadcrumbs();
	void RemoveContext(const class FString& Key);
	void RemoveExtra(const class FString& Key);
	void RemoveTag(const class FString& Key);
	void SetContext(const class FString& Key, const TMap<class FString, class FString>& Values);
	void SetDist(const class FString& Dist);
	void SetEnvironment(const class FString& environment);
	void SetExtras(const TMap<class FString, class FString>& Extras);
	void SetExtraValue(const class FString& Key, const class FString& Value);
	void SetFingerprint(const TArray<class FString>& fingerprint);
	void SetLevel(ESentryLevel Level);
	void SetTags(const TMap<class FString, class FString>& Tags);
	void SetTagValue(const class FString& Key, const class FString& Value);

	class FString GetDist() const;
	class FString GetEnvironment() const;
	TMap<class FString, class FString> GetExtras() const;
	class FString GetExtraValue(const class FString& Key) const;
	TArray<class FString> GetFingerprint() const;
	ESentryLevel GetLevel() const;
	TMap<class FString, class FString> GetTags() const;
	class FString GetTagValue(const class FString& Key) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SentryScope")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SentryScope")
	}
	static class USentryScope* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentryScope>();
	}
};
DUMPER7_ASSERTS_USentryScope;

// Class Sentry.SentrySettings
// 0x0088 (0x00B0 - 0x0028)
class USentrySettings final : public UObject
{
public:
	class FString                                 DsnUrl;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Release;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 environment;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InitAutomatically;                                 // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableVerboseLogging;                              // 0x0059(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAutomaticBreadcrumbs                  AutomaticBreadcrumbs;                              // 0x005A(0x0005)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FTagsPromotion                         TagsPromotion;                                     // 0x005F(0x0006)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          EnableAutoCrashCapturing;                          // 0x0065(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UploadSymbolsAutomatically;                        // 0x0066(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProjectName;                                       // 0x0068(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OrgName;                                           // 0x0078(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AuthToken;                                         // 0x0088(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeSources;                                    // 0x0098(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CrashReporterUrl;                                  // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SentrySettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SentrySettings")
	}
	static class USentrySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentrySettings>();
	}
};
DUMPER7_ASSERTS_USentrySettings;

// Class Sentry.SentrySubsystem
// 0x0038 (0x0068 - 0x0030)
class USentrySubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x38];                                      // 0x0030(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddBreadcrumb(class USentryBreadcrumb* Breadcrumb);
	void AddBreadcrumbWithParams(const class FString& Message, const class FString& Category, const class FString& Type, const TMap<class FString, class FString>& Data, ESentryLevel Level);
	class USentryId* CaptureEvent(class USentryEvent* Event);
	class USentryId* CaptureEventWithScope(class USentryEvent* Event, const TDelegate<void(class USentryScope* Scope)>& OnConfigureScope);
	class USentryId* CaptureMessage(const class FString& Message, ESentryLevel Level);
	class USentryId* CaptureMessageWithScope(const class FString& Message, const TDelegate<void(class USentryScope* Scope)>& OnConfigureScope, ESentryLevel Level);
	void CaptureUserFeedback(class USentryUserFeedback* UserFeedback);
	void CaptureUserFeedbackWithParams(class USentryId* EventId, const class FString& email, const class FString& Comments, const class FString& Name_0);
	void ClearBreadcrumbs();
	void Close();
	void ConfigureScope(const TDelegate<void(class USentryScope* Scope)>& OnConfigureScope);
	void Initialize();
	void InitializeWithSettings(const TDelegate<void(class USentrySettings* Settings)>& OnConfigureSettings);
	void RemoveTag(const class FString& Key);
	void RemoveUser();
	void SetContext(const class FString& Key, const TMap<class FString, class FString>& Values);
	void SetLevel(ESentryLevel Level);
	void SetTag(const class FString& Key, const class FString& Value);
	void SetUser(class USentryUser* User);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SentrySubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SentrySubsystem")
	}
	static class USentrySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentrySubsystem>();
	}
};
DUMPER7_ASSERTS_USentrySubsystem;

// Class Sentry.SentryUser
// 0x0010 (0x0038 - 0x0028)
class USentryUser final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetData(const TMap<class FString, class FString>& Data);
	void SetEmail(const class FString& email);
	void SetId(const class FString& ID);
	void SetIpAddress(const class FString& IpAddress);
	void SetUsername(const class FString& username);

	TMap<class FString, class FString> GetData() const;
	class FString GetEmail() const;
	class FString GetId() const;
	class FString GetIpAddress() const;
	class FString GetUsername() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SentryUser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SentryUser")
	}
	static class USentryUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentryUser>();
	}
};
DUMPER7_ASSERTS_USentryUser;

// Class Sentry.SentryUserFeedback
// 0x0010 (0x0038 - 0x0028)
class USentryUserFeedback final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize(class USentryId* EventId);
	void SetComment(const class FString& Comments);
	void SetEmail(const class FString& email);
	void SetName(const class FString& Name_0);

	class FString GetComment() const;
	class FString GetEmail() const;
	class FString GetName() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SentryUserFeedback")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SentryUserFeedback")
	}
	static class USentryUserFeedback* GetDefaultObj()
	{
		return GetDefaultObjImpl<USentryUserFeedback>();
	}
};
DUMPER7_ASSERTS_USentryUserFeedback;

}

