#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Female_Hair_Afro_Short_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_Female_Hair_Afro_Short_AnimBP.SK_Female_Hair_Afro_Short_AnimBP_C
// 0x0190 (0x0550 - 0x03C0)
class USK_Female_Hair_Afro_Short_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03C0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03C8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03D0(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x03F0(0x0158)(ContainsInstancedReference)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SK_Female_Hair_Afro_Short_AnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SK_Female_Hair_Afro_Short_AnimBP_C")
	}
	static class USK_Female_Hair_Afro_Short_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Female_Hair_Afro_Short_AnimBP_C>();
	}
};
DUMPER7_ASSERTS_USK_Female_Hair_Afro_Short_AnimBP_C;

}

