#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Female_Hair_Afro_Long_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SK_Female_Hair_Afro_Long_AnimBP.SK_Female_Hair_Afro_Long_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SK_Female_Hair_Afro_Long_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_SK_Female_Hair_Afro_Long_AnimBP_C_AnimGraph;

// Function SK_Female_Hair_Afro_Long_AnimBP.SK_Female_Hair_Afro_Long_AnimBP_C.BlueprintThreadSafeUpdateAnimation
// 0x0008 (0x0008 - 0x0000)
struct SK_Female_Hair_Afro_Long_AnimBP_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SK_Female_Hair_Afro_Long_AnimBP_C_BlueprintThreadSafeUpdateAnimation;

// Function SK_Female_Hair_Afro_Long_AnimBP.SK_Female_Hair_Afro_Long_AnimBP_C.ExecuteUbergraph_SK_Female_Hair_Afro_Long_AnimBP
// 0x0020 (0x0020 - 0x0000)
struct SK_Female_Hair_Afro_Long_AnimBP_C_ExecuteUbergraph_SK_Female_Hair_Afro_Long_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APrimalCharacter*                       K2Node_DynamicCast_AsPrimal_Character;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SK_Female_Hair_Afro_Long_AnimBP_C_ExecuteUbergraph_SK_Female_Hair_Afro_Long_AnimBP;

// Function SK_Female_Hair_Afro_Long_AnimBP.SK_Female_Hair_Afro_Long_AnimBP_C.NoiseGen
// 0x0070 (0x0070 - 0x0000)
struct SK_Female_Hair_Afro_Long_AnimBP_C_NoiseGen final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleFloat_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_MakePerlinNoiseVectorAndRemap_ReturnValue; // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleFloat_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_MakePerlinNoiseVectorAndRemap_X_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_MakePerlinNoiseVectorAndRemap_Y_ImplicitCast; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_MakePerlinNoiseVectorAndRemap_Z_ImplicitCast; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_DoubleFloat_B_ImplicitCast;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SK_Female_Hair_Afro_Long_AnimBP_C_NoiseGen;

}

