#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Male_Hair_Mohawk_CtrlRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass SK_Male_Hair_Mohawk_CtrlRig.SK_Male_Hair_Mohawk_CtrlRig_C
// 0x00B0 (0x0B80 - 0x0AD0)
class USK_Male_Hair_Mohawk_CtrlRig_C final : public UControlRig
{
public:
	TArray<struct FVector>                        BoneArraySpringSolver_CurrentSpringPositionWorld;  // 0x0AD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        BoneArraySpringSolver_CurrentSpringPositionGlobal; // 0x0AE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        BoneArraySpringSolver_LastFrameSpringPositionGlobal; // 0x0AF0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        BoneArraySpringSolver_CurrentVelocity;             // 0x0B00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        BoneArraySpringSolver_CurrentVelocityGlobal;       // 0x0B10(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BoneArraySpringSolver_SpringStrength_0;            // 0x0B20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_SpringDamping_0;             // 0x0B24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                BoneArraySpringSolver_Alphas;                      // 0x0B28(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Swimming;                                          // 0x0B38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B39[0x7];                                      // 0x0B39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                SwimStrength;                                      // 0x0B40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                SwimDamping;                                       // 0x0B50(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 BoneArraySpringSolver_2_SpringStrength;            // 0x0B60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 BoneArraySpringSolver_2_SpringDamping;             // 0x0B70(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SK_Male_Hair_Mohawk_CtrlRig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SK_Male_Hair_Mohawk_CtrlRig_C")
	}
	static class USK_Male_Hair_Mohawk_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Male_Hair_Mohawk_CtrlRig_C>();
	}
};
DUMPER7_ASSERTS_USK_Male_Hair_Mohawk_CtrlRig_C;

// RigVMMemoryStorageGeneratorClass SK_Male_Hair_Mohawk_CtrlRig.RigVMMemory_Literal
// 0x0338 (0x0360 - 0x0028)
class SK_Male_Hair_Mohawk_CtrlRig::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_Items__Const;       // 0x0028(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___BoneArraySpringSolver_2_1_MaximumSpringLength__Const; // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___BoneArraySpringSolver_2_1_ConstrainLength__Const; // 0x003C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___BoneArraySpringSolver_2_1_ConstrainLengthMin__Const; // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___BoneArraySpringSolver_2_1_ConstrainLengthMax__Const; // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___BoneArraySpringSolver_2_1_BonesLookAtParentAlpha__Const; // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___BoneArraySpringSolver_2_1_SimSpaceBone__Const; // 0x0058(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalVariableDefault__BoneArraySpringSolver_PrevPos__Const; // 0x0068(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__BoneArraySpringSolver_BonePosition__Const; // 0x0080(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_Space__Const; // 0x0098(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_bInitial__Const; // 0x0099(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_IsNearlyZero_Tolerance__Const; // 0x009C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Multiply_7_B__Const; // 0x00A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_1_B__Const; // 0x00A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_SourceMinimum__Const; // 0x00C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_SourceMaximum__Const; // 0x00C8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_TargetMinimum__Const; // 0x00D0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_TargetMaximum__Const; // 0x00D8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          SpringSolver_0___SpringSolver_Remap_1_bClamp__Const; // 0x00E0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Divide_2_B__Const;   // 0x00E8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_MathVectorClampLength_MinimumLength__Const; // 0x00F0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Divide_A__Const;     // 0x00F4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          ToBoneSpace___ToBoneSpace_GetTransform_Space__Const; // 0x00F8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToBoneSpace___ToBoneSpace_GetTransform_bInitial__Const; // 0x00F9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolverGlobal_0_WorldVelocityInfluence__Const; // 0x0100(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          ToBoneSpace_2_1___ToBoneSpace_GetTransform_Space__Const; // 0x0118(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToBoneSpace_2_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x0119(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_Divide_1_A__Const; // 0x011C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_Multiply_B__Const; // 0x0120(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_B__Const; // 0x0128(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMinimum__Const; // 0x0130(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMaximum__Const; // 0x0138(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMinimum__Const; // 0x0140(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMaximum__Const; // 0x0148(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_bClamp__Const; // 0x0150(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_B__Const; // 0x0158(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_MinimumLength__Const; // 0x0160(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Divide_A__Const; // 0x0164(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          FromBoneSpace_1___FromBoneSpace_GetTransform_Space__Const; // 0x0168(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FromBoneSpace_1___FromBoneSpace_GetTransform_bInitial__Const; // 0x0169(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          ToBoneSpace_1___ToBoneSpace_GetTransform_Space__Const; // 0x016A(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToBoneSpace_1___ToBoneSpace_GetTransform_bInitial__Const; // 0x016B(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoneArraySpringSolver_2_1___BoneArraySpringSolver_Set_Transform_1_Value__Const; // 0x0170(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          FromBoneSpace___FromBoneSpace_GetTransform_Space__Const; // 0x01D0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FromBoneSpace___FromBoneSpace_GetTransform_bInitial__Const; // 0x01D1(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2_1___BoneArraySpringSolver_Set_Transform_1_bPropagateToChildren__Const; // 0x01D2(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D3[0x1];                                      // 0x01D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___BoneArraySpringSolver_2_MaximumSpringLength__Const; // 0x01D4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___BoneArraySpringSolver_2_ConstrainLengthMin__Const; // 0x01D8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___BoneArraySpringSolver_2_ConstrainLengthMax__Const; // 0x01E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__BoneArraySpringSolver_PrevPos__Const_0; // 0x01E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__BoneArraySpringSolver_BonePosition__Const_0; // 0x0200(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_Space__Const; // 0x0218(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2___BoneArraySpringSolver_GetTransform_bInitial__Const; // 0x0219(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_IsNearlyZero_Tolerance__Const; // 0x021C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Multiply_7_B__Const_0; // 0x0220(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_1_B__Const_0; // 0x0228(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_SourceMinimum__Const_0; // 0x0240(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_SourceMaximum__Const_0; // 0x0248(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_TargetMinimum__Const_0; // 0x0250(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_TargetMaximum__Const_0; // 0x0258(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          SpringSolver_0___SpringSolver_Remap_1_bClamp__Const_0; // 0x0260(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Divide_2_B__Const_0; // 0x0268(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_MathVectorClampLength_MinimumLength__Const_0; // 0x0270(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Divide_A__Const_0;   // 0x0274(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          ToBoneSpace___ToBoneSpace_GetTransform_Space__Const_0; // 0x0278(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToBoneSpace___ToBoneSpace_GetTransform_bInitial__Const_0; // 0x0279(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2___BoneArraySpringSolver_SpringSolverGlobal_0_WorldVelocityInfluence__Const; // 0x0280(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          ToBoneSpace_2_1___ToBoneSpace_GetTransform_Space__Const_0; // 0x0298(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToBoneSpace_2_1___ToBoneSpace_GetTransform_bInitial__Const_0; // 0x0299(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Divide_1_A__Const; // 0x029C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2___BoneArraySpringSolver_Multiply_B__Const; // 0x02A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_B__Const_0; // 0x02A8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMinimum__Const_0; // 0x02B0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_SourceMaximum__Const_0; // 0x02B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMinimum__Const_0; // 0x02C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_TargetMaximum__Const_0; // 0x02C8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_bClamp__Const_0; // 0x02D0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_B__Const_0; // 0x02D8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_MinimumLength__Const_0; // 0x02E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Divide_A__Const_0; // 0x02E4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          FromBoneSpace_1___FromBoneSpace_GetTransform_Space__Const_0; // 0x02E8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FromBoneSpace_1___FromBoneSpace_GetTransform_bInitial__Const_0; // 0x02E9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          ToBoneSpace_1___ToBoneSpace_GetTransform_Space__Const_0; // 0x02EA(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToBoneSpace_1___ToBoneSpace_GetTransform_bInitial__Const_0; // 0x02EB(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_Value__Const; // 0x02F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          FromBoneSpace___FromBoneSpace_GetTransform_Space__Const_0; // 0x0350(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FromBoneSpace___FromBoneSpace_GetTransform_bInitial__Const_0; // 0x0351(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2___BoneArraySpringSolver_Set_Transform_1_bPropagateToChildren__Const; // 0x0352(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass SK_Male_Hair_Mohawk_CtrlRig.RigVMMemory_Literal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Literal")
	}
	static class SK_Male_Hair_Mohawk_CtrlRig::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<SK_Male_Hair_Mohawk_CtrlRig::URigVMMemory_Literal>();
	}
};
DUMPER7_ASSERTS_SK_Male_Hair_Mohawk_CtrlRig__URigVMMemory_Literal;

// RigVMMemoryStorageGeneratorClass SK_Male_Hair_Mohawk_CtrlRig.RigVMMemory_Work
// 0x1C88 (0x1CB0 - 0x0028)
class SK_Male_Hair_Mohawk_CtrlRig::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_Items__IO;          // 0x0028(0x0010)(Edit, EditConst, NonTransactional)
	TArray<float>                                 RigVMModel___BoneArraySpringSolver_2_1_SpringStrength; // 0x0038(0x0010)(Edit, EditConst, NonTransactional)
	TArray<float>                                 RigVMModel___BoneArraySpringSolver_2_1_SpringDamping; // 0x0048(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_Transform; // 0x0060(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x00C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_CachedIndex; // 0x00D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                LocalVariable__BoneArraySpringSolver_BonePosition; // 0x00E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2_1___BoneArraySpringSolver_IsNearlyZero_Result; // 0x00F8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_Element; // 0x0100(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x0118(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_To_World_1_World; // 0x0120(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x0138(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x013C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_To_World_2_World; // 0x0140(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x0158(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolver_0_Strength; // 0x0170(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolver_0_Damping; // 0x0178(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolver_0_Out; // 0x0180(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolver_0_Velocity; // 0x0198(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_7_Element; // 0x01B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Entry_Maximum_Length; // 0x01C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolver_0___SpringSolver_Return_Velocity;     // 0x01D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Entry_VelocityIn;    // 0x01E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_MathVectorClampLength_Result; // 0x0200(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_1_2_Result; // 0x0218(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_9_1_Result;      // 0x0230(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Scale_3_Result;      // 0x0248(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_1_Result; // 0x0260(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Add_1_Add_1_Result;  // 0x0278(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Scale_Result;        // 0x0290(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_Result;     // 0x02A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Multiply_7_Result;   // 0x02C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Scale_Factor;        // 0x02C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Multiply_6_Result;   // 0x02D0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_GetDeltaTime_3_Result; // 0x02D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolver_0___SpringSolver_Multiply_6_A;        // 0x02E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Power_1_Result;      // 0x02E8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Remap_1_Result;      // 0x02F0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Divide_2_Result;     // 0x02F8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolver_0___SpringSolver_Divide_2_A;          // 0x0300(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Scale_3_Factor;      // 0x0308(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolver_0___SpringSolver_Subtract_1_Result;   // 0x0310(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_Divide_Result;       // 0x0328(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolver_0___SpringSolver_RigVMFunction_GetDeltaTime_Result; // 0x032C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BoneArraySpringSolver_2_1___BoneArraySpringSolver_IsNearlyZero_1_Result; // 0x0330(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_3_1_Element; // 0x0338(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_ToBoneSpace_RootSpaceResult; // 0x0350(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ToBoneSpace___ToBoneSpace_Inverse_Result;          // 0x0370(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace___ToBoneSpace_GetTransform_Transform;  // 0x03D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ToBoneSpace___ToBoneSpace_GetTransform_CachedIndex; // 0x0430(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_4_Element; // 0x0440(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolverGlobal_0_Strength; // 0x0458(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolverGlobal_0_Damping; // 0x0460(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolverGlobal_0_Out; // 0x0468(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Scale_1_1_Result; // 0x0480(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_ToBoneSpace_2_1_RootSpaceResult; // 0x0498(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Subtract_1_Result; // 0x04B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_From_World_Global; // 0x04C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_Element; // 0x04E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_5_Element; // 0x04F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace_2_1___ToBoneSpace_Inverse_Result;      // 0x0510(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace_2_1___ToBoneSpace_GetTransform_Transform; // 0x0570(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ToBoneSpace_2_1___ToBoneSpace_GetTransform_CachedIndex; // 0x05D0(0x0010)(Edit, EditConst, NonTransactional)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_Multiply_Result; // 0x05E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_Divide_1_Result; // 0x05E4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_RigVMFunction_GetDeltaTime_1_Result; // 0x05E8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_8_Element; // 0x05F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_SpringSolverGlobal_0_VelocityGlobal; // 0x0608(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Entry_Maximum_Length; // 0x0620(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624[0x4];                                      // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Entry_VelocityIn; // 0x0628(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Return_VelocityGlobal; // 0x0640(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_MathVectorClampLength_Result; // 0x0658(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_2_Result; // 0x0670(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_9_1_Result; // 0x0688(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Result; // 0x06A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_1_Result; // 0x06B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Add_1_Add_1_Result; // 0x06D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Multiply_Result; // 0x06E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Scale_Result; // 0x0700(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_Result; // 0x0718(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_7_Result; // 0x0730(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Scale_Factor; // 0x0738(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_Result; // 0x0740(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_GetDeltaTime_3_Result; // 0x0748(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74C[0x4];                                      // 0x074C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Multiply_6_A; // 0x0750(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Power_1_Result; // 0x0758(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Remap_1_Result; // 0x0760(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_Result; // 0x0768(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SpringSolverGlobal_0___SpringSolverGlobal_Divide_2_A; // 0x0770(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Scale_3_Factor; // 0x0778(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpringSolverGlobal_0___SpringSolverGlobal_Subtract_1_Result; // 0x0780(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_Divide_Result; // 0x0798(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpringSolverGlobal_0___SpringSolverGlobal_RigVMFunction_GetDeltaTime_Result; // 0x079C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_2_Transform; // 0x07A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_HierarchyGetParent_Parent; // 0x0800(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80C[0x4];                                      // 0x080C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_HierarchyGetParent_CachedChild; // 0x0810(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_HierarchyGetParent_CachedParent; // 0x0820(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_2_CachedIndex; // 0x0830(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Subtract_Result; // 0x0840(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_FromBoneSpace_1_BoneSpacePosition; // 0x0858(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             FromBoneSpace_1___FromBoneSpace_GetTransform_Transform; // 0x0870(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              FromBoneSpace_1___FromBoneSpace_GetTransform_CachedIndex; // 0x08D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Subtract_B; // 0x08E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_If_Result; // 0x08F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_ToBoneSpace_1_RootSpaceResult; // 0x0910(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Add_Result; // 0x0928(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Scale_Result; // 0x0940(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Unit_Result; // 0x0958(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_Multiply_2_Result; // 0x0970(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_Clamp_Result; // 0x0974(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_Divide_Result; // 0x0978(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_RigVMFunction_MathVectorLength_1_Result; // 0x097C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_RigVMFunction_MathVectorLength_Result; // 0x0980(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_984[0x4];                                      // 0x0984(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Subtract_2_Result; // 0x0988(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_2_1_1_Transform; // 0x09A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_2_1_1_CachedIndex; // 0x0A00(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Subtract_2_A; // 0x0A10(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A28[0x8];                                      // 0x0A28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_2_1_Transform; // 0x0A30(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_HierarchyGetParent_1_Parent; // 0x0A90(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9C[0x4];                                      // 0x0A9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_HierarchyGetParent_1_CachedChild; // 0x0AA0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_HierarchyGetParent_1_CachedParent; // 0x0AB0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              BoneArraySpringSolver_2_1___BoneArraySpringSolver_GetTransform_2_1_CachedIndex; // 0x0AC0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_Subtract_2_B; // 0x0AD0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_Clamp_Minimum; // 0x0AE8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoneArraySpringSolver_2_1___BoneArraySpringSolver_Clamp_Maximum; // 0x0AEC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace_1___ToBoneSpace_Inverse_Result;        // 0x0AF0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ToBoneSpace_1___ToBoneSpace_GetTransform_Transform; // 0x0B50(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ToBoneSpace_1___ToBoneSpace_GetTransform_CachedIndex; // 0x0BB0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_From_World_2_2_Global; // 0x0BC0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoneArraySpringSolver_2_1___BoneArraySpringSolver_DISPATCH_RigVMDispatch_ArrayGetAtIndex_6_1_Element; // 0x0BD8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
