#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlateRHIRenderer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateRHIRenderer_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class SlateRHIRenderer.SlateFXSubsystem
// 0x00A0 (0x00D0 - 0x0030)
class USlateFXSubsystem final : public UEngineSubsystem
{
public:
	TMap<ESlatePostRT, class USlateRHIPostBufferProcessor*> SlatePostBufferProcessors;               // 0x0030(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_80[0x50];                                      // 0x0080(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class USlateRHIPostBufferProcessor* GetSlatePostProcessor(ESlatePostRT InPostBufferBit);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SlateFXSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SlateFXSubsystem")
	}
	static class USlateFXSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateFXSubsystem>();
	}
};
DUMPER7_ASSERTS_USlateFXSubsystem;

// Class SlateRHIRenderer.SlateRHIPostBufferProcessor
// 0x0000 (0x0028 - 0x0028)
class USlateRHIPostBufferProcessor : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SlateRHIPostBufferProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SlateRHIPostBufferProcessor")
	}
	static class USlateRHIPostBufferProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateRHIPostBufferProcessor>();
	}
};
DUMPER7_ASSERTS_USlateRHIPostBufferProcessor;

// Class SlateRHIRenderer.SlatePostBufferBlur
// 0x0018 (0x0040 - 0x0028)
class USlatePostBufferBlur final : public USlateRHIPostBufferProcessor
{
public:
	float                                         GaussianBlurStrength;                              // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x14];                                      // 0x002C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SlatePostBufferBlur")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SlatePostBufferBlur")
	}
	static class USlatePostBufferBlur* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlatePostBufferBlur>();
	}
};
DUMPER7_ASSERTS_USlatePostBufferBlur;

// Class SlateRHIRenderer.SlateRHIRendererSettings
// 0x0050 (0x0088 - 0x0038)
class USlateRHIRendererSettings final : public UDeveloperSettings
{
public:
	TMap<ESlatePostRT, struct FSlatePostSettings> SlatePostSettings;                                 // 0x0038(0x0050)(Edit, EditFixedSize, Config, NativeAccessSpecifierPrivate)

public:
	struct FSlatePostSettings GetMutableSlatePostSetting(ESlatePostRT InPostBufferBit);

	const struct FSlatePostSettings GetSlatePostSetting(ESlatePostRT InPostBufferBit) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SlateRHIRendererSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SlateRHIRendererSettings")
	}
	static class USlateRHIRendererSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateRHIRendererSettings>();
	}
};
DUMPER7_ASSERTS_USlateRHIRendererSettings;

}

