#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlateRHIRenderer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SlateRHIRenderer_structs.hpp"


namespace SDK::Params
{

// Function SlateRHIRenderer.SlateFXSubsystem.GetSlatePostProcessor
// 0x0010 (0x0010 - 0x0000)
struct SlateFXSubsystem_GetSlatePostProcessor final
{
public:
	ESlatePostRT                                  InPostBufferBit;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USlateRHIPostBufferProcessor*           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SlateFXSubsystem_GetSlatePostProcessor;

// Function SlateRHIRenderer.SlateRHIRendererSettings.GetMutableSlatePostSetting
// 0x0038 (0x0038 - 0x0000)
struct SlateRHIRendererSettings_GetMutableSlatePostSetting final
{
public:
	ESlatePostRT                                  InPostBufferBit;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlatePostSettings                     ReturnValue;                                       // 0x0008(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SlateRHIRendererSettings_GetMutableSlatePostSetting;

// Function SlateRHIRenderer.SlateRHIRendererSettings.GetSlatePostSetting
// 0x0038 (0x0038 - 0x0000)
struct SlateRHIRendererSettings_GetSlatePostSetting final
{
public:
	ESlatePostRT                                  InPostBufferBit;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlatePostSettings                     ReturnValue;                                       // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SlateRHIRendererSettings_GetSlatePostSetting;

}

