#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlateCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SlateCore.EFontRasterizationMode
// NumValues: 0x0005
enum class EFontRasterizationMode : uint8
{
	Bitmap                                   = 0,
	Msdf                                     = 1,
	Sdf                                      = 2,
	SdfApproximation                         = 3,
	EFontRasterizationMode_MAX               = 4,
};

// Enum SlateCore.EUINavigationRule
// NumValues: 0x0008
enum class EUINavigationRule : uint8
{
	Escape                                   = 0,
	Explicit                                 = 1,
	Wrap                                     = 2,
	Stop                                     = 3,
	Custom                                   = 4,
	CustomBoundary                           = 5,
	Invalid                                  = 6,
	EUINavigationRule_MAX                    = 7,
};

// Enum SlateCore.EColorVisionDeficiency
// NumValues: 0x0005
enum class EColorVisionDeficiency : uint8
{
	NormalVision                             = 0,
	Deuteranope                              = 1,
	Protanope                                = 2,
	Tritanope                                = 3,
	EColorVisionDeficiency_MAX               = 4,
};

// Enum SlateCore.EButtonClickMethod
// NumValues: 0x0005
enum class EButtonClickMethod : uint8
{
	DownAndUp                                = 0,
	MouseDown                                = 1,
	MouseUp                                  = 2,
	PreciseClick                             = 3,
	EButtonClickMethod_MAX                   = 4,
};

// Enum SlateCore.EButtonTouchMethod
// NumValues: 0x0004
enum class EButtonTouchMethod : uint8
{
	DownAndUp                                = 0,
	Down                                     = 1,
	PreciseTap                               = 2,
	EButtonTouchMethod_MAX                   = 3,
};

// Enum SlateCore.EButtonPressMethod
// NumValues: 0x0004
enum class EButtonPressMethod : uint8
{
	DownAndUp                                = 0,
	ButtonPress                              = 1,
	ButtonRelease                            = 2,
	EButtonPressMethod_MAX                   = 3,
};

// Enum SlateCore.EUINavigation
// NumValues: 0x0009
enum class EUINavigation : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	Up                                       = 2,
	Down                                     = 3,
	Next                                     = 4,
	Previous                                 = 5,
	Num                                      = 6,
	Invalid                                  = 7,
	EUINavigation_MAX                        = 8,
};

// Enum SlateCore.EUINavigationAction
// NumValues: 0x0005
enum class EUINavigationAction : uint8
{
	Accept                                   = 0,
	Back                                     = 1,
	Num                                      = 2,
	Invalid                                  = 3,
	EUINavigationAction_MAX                  = 4,
};

// Enum SlateCore.ENavigationSource
// NumValues: 0x0003
enum class ENavigationSource : uint8
{
	FocusedWidget                            = 0,
	WidgetUnderCursor                        = 1,
	ENavigationSource_MAX                    = 2,
};

// Enum SlateCore.ENavigationGenesis
// NumValues: 0x0004
enum class ENavigationGenesis : uint8
{
	Keyboard                                 = 0,
	Controller                               = 1,
	User                                     = 2,
	ENavigationGenesis_MAX                   = 3,
};

// Enum SlateCore.EHorizontalAlignment
// NumValues: 0x0005
enum class EHorizontalAlignment : uint8
{
	HAlign_Fill                              = 0,
	HAlign_Left                              = 1,
	HAlign_Center                            = 2,
	HAlign_Right                             = 3,
	HAlign_MAX                               = 4,
};

// Enum SlateCore.EVerticalAlignment
// NumValues: 0x0005
enum class EVerticalAlignment : uint8
{
	VAlign_Fill                              = 0,
	VAlign_Top                               = 1,
	VAlign_Center                            = 2,
	VAlign_Bottom                            = 3,
	VAlign_MAX                               = 4,
};

// Enum SlateCore.EMenuPlacement
// NumValues: 0x000E
enum class EMenuPlacement : uint8
{
	MenuPlacement_BelowAnchor                = 0,
	MenuPlacement_CenteredBelowAnchor        = 1,
	MenuPlacement_BelowRightAnchor           = 2,
	MenuPlacement_ComboBox                   = 3,
	MenuPlacement_ComboBoxRight              = 4,
	MenuPlacement_MenuRight                  = 5,
	MenuPlacement_AboveAnchor                = 6,
	MenuPlacement_CenteredAboveAnchor        = 7,
	MenuPlacement_AboveRightAnchor           = 8,
	MenuPlacement_MenuLeft                   = 9,
	MenuPlacement_Center                     = 10,
	MenuPlacement_RightLeftCenter            = 11,
	MenuPlacement_MatchBottomLeft            = 12,
	MenuPlacement_MAX                        = 13,
};

// Enum SlateCore.EOrientation
// NumValues: 0x0003
enum class EOrientation : uint8
{
	Orient_Horizontal                        = 0,
	Orient_Vertical                          = 1,
	Orient_MAX                               = 2,
};

// Enum SlateCore.EScrollDirection
// NumValues: 0x0003
enum class EScrollDirection : uint8
{
	Scroll_Down                              = 0,
	Scroll_Up                                = 1,
	Scroll_MAX                               = 2,
};

// Enum SlateCore.ETextCommit
// NumValues: 0x0005
enum class ETextCommit : uint8
{
	Default                                  = 0,
	OnEnter                                  = 1,
	OnUserMovedFocus                         = 2,
	OnCleared                                = 3,
	ETextCommit_MAX                          = 4,
};

// Enum SlateCore.ESelectInfo
// NumValues: 0x0005
enum class ESelectInfo : uint8
{
	OnKeyPress                               = 0,
	OnNavigation                             = 1,
	OnMouseClick                             = 2,
	Direct                                   = 3,
	ESelectInfo_MAX                          = 4,
};

// Enum SlateCore.ESlatePostRT
// NumValues: 0x0009
enum class ESlatePostRT : uint8
{
	None                                     = 0,
	ESlatePostRT_0                           = 1,
	ESlatePostRT_1                           = 2,
	ESlatePostRT_2                           = 4,
	ESlatePostRT_3                           = 8,
	ESlatePostRT_4                           = 16,
	All                                      = 31,
	Num                                      = 5,
	ESlatePostRT_MAX                         = 32,
};

// Enum SlateCore.EWidgetPixelSnapping
// NumValues: 0x0004
enum class EWidgetPixelSnapping : uint8
{
	Inherit                                  = 0,
	Disabled                                 = 1,
	SnapToPixel                              = 2,
	EWidgetPixelSnapping_MAX                 = 3,
};

// Enum SlateCore.ESlateDebuggingInputEvent
// NumValues: 0x001B
enum class ESlateDebuggingInputEvent : uint8
{
	MouseMove                                = 0,
	MouseEnter                               = 1,
	MouseLeave                               = 2,
	PreviewMouseButtonDown                   = 3,
	MouseButtonDown                          = 4,
	MouseButtonUp                            = 5,
	MouseButtonDoubleClick                   = 6,
	MouseWheel                               = 7,
	TouchStart                               = 8,
	TouchEnd                                 = 9,
	TouchForceChanged                        = 10,
	TouchFirstMove                           = 11,
	TouchMoved                               = 12,
	DragDetected                             = 13,
	DragEnter                                = 14,
	DragLeave                                = 15,
	DragOver                                 = 16,
	DragDrop                                 = 17,
	DropMessage                              = 18,
	PreviewKeyDown                           = 19,
	KeyDown                                  = 20,
	KeyUp                                    = 21,
	KeyChar                                  = 22,
	AnalogInput                              = 23,
	TouchGesture                             = 24,
	MotionDetected                           = 25,
	MAX                                      = 26,
};

// Enum SlateCore.ESlateDebuggingStateChangeEvent
// NumValues: 0x0003
enum class ESlateDebuggingStateChangeEvent : uint8
{
	MouseCaptureGained                       = 0,
	MouseCaptureLost                         = 1,
	ESlateDebuggingStateChangeEvent_MAX      = 2,
};

// Enum SlateCore.ESlateDebuggingNavigationMethod
// NumValues: 0x0007
enum class ESlateDebuggingNavigationMethod : uint8
{
	Unknown                                  = 0,
	Explicit                                 = 1,
	CustomDelegateBound                      = 2,
	CustomDelegateUnbound                    = 3,
	NextOrPrevious                           = 4,
	HitTestGrid                              = 5,
	ESlateDebuggingNavigationMethod_MAX      = 6,
};

// Enum SlateCore.ESlateDebuggingFocusEvent
// NumValues: 0x0004
enum class ESlateDebuggingFocusEvent : uint8
{
	FocusChanging                            = 0,
	FocusLost                                = 1,
	FocusReceived                            = 2,
	MAX                                      = 3,
};

// Enum SlateCore.EFontHinting
// NumValues: 0x0006
enum class EFontHinting : uint8
{
	Default                                  = 0,
	Auto                                     = 1,
	AutoLight                                = 2,
	Monochrome                               = 3,
	None                                     = 4,
	EFontHinting_MAX                         = 5,
};

// Enum SlateCore.EFontLoadingPolicy
// NumValues: 0x0004
enum class EFontLoadingPolicy : uint8
{
	LazyLoad                                 = 0,
	Stream                                   = 1,
	Inline                                   = 2,
	EFontLoadingPolicy_MAX                   = 3,
};

// Enum SlateCore.EFontLayoutMethod
// NumValues: 0x0003
enum class EFontLayoutMethod : uint8
{
	Metrics                                  = 0,
	BoundingBox                              = 1,
	EFontLayoutMethod_MAX                    = 2,
};

// Enum SlateCore.ETextShapingMethod
// NumValues: 0x0004
enum class ETextShapingMethod : uint8
{
	Auto                                     = 0,
	KerningOnly                              = 1,
	FullShaping                              = 2,
	ETextShapingMethod_MAX                   = 3,
};

// Enum SlateCore.EFocusCause
// NumValues: 0x0007
enum class EFocusCause : uint8
{
	Mouse                                    = 0,
	Navigation                               = 1,
	SetDirectly                              = 2,
	Cleared                                  = 3,
	OtherWidgetLostFocus                     = 4,
	WindowActivate                           = 5,
	EFocusCause_MAX                          = 6,
};

// Enum SlateCore.EWidgetClipping
// NumValues: 0x0007
enum class EWidgetClipping : uint8
{
	Inherit                                  = 0,
	ClipToBounds                             = 1,
	ClipToBoundsWithoutIntersecting          = 2,
	ClipToBoundsAlways                       = 3,
	OnDemand                                 = 4,
	ClipNever                                = 5,
	EWidgetClipping_MAX                      = 6,
};

// Enum SlateCore.EFlowDirectionPreference
// NumValues: 0x0005
enum class EFlowDirectionPreference : uint8
{
	Inherit                                  = 0,
	Culture                                  = 1,
	LeftToRight                              = 2,
	RightToLeft                              = 3,
	EFlowDirectionPreference_MAX             = 4,
};

// Enum SlateCore.ESlateBrushDrawType
// NumValues: 0x0006
enum class ESlateBrushDrawType : uint8
{
	NoDrawType                               = 0,
	Box                                      = 1,
	Border                                   = 2,
	Image                                    = 3,
	RoundedBox                               = 4,
	ESlateBrushDrawType_MAX                  = 5,
};

// Enum SlateCore.ESlateBrushTileType
// NumValues: 0x0005
enum class ESlateBrushTileType : uint8
{
	NoTile                                   = 0,
	Horizontal                               = 1,
	Vertical                                 = 2,
	Both                                     = 3,
	ESlateBrushTileType_MAX                  = 4,
};

// Enum SlateCore.ESlateBrushMirrorType
// NumValues: 0x0005
enum class ESlateBrushMirrorType : uint8
{
	NoMirror                                 = 0,
	Horizontal                               = 1,
	Vertical                                 = 2,
	Both                                     = 3,
	ESlateBrushMirrorType_MAX                = 4,
};

// Enum SlateCore.ESlateBrushImageType
// NumValues: 0x0005
enum class ESlateBrushImageType : uint8
{
	NoImage                                  = 0,
	FullColor                                = 1,
	Linear                                   = 2,
	Vector                                   = 3,
	ESlateBrushImageType_MAX                 = 4,
};

// Enum SlateCore.ESlateBrushRoundingType
// NumValues: 0x0003
enum class ESlateBrushRoundingType : uint8
{
	FixedRadius                              = 0,
	HalfHeightRadius                         = 1,
	ESlateBrushRoundingType_MAX              = 2,
};

// Enum SlateCore.ESlateColorStylingMode
// NumValues: 0x0006
enum class ESlateColorStylingMode : uint8
{
	UseColor_Specified                       = 0,
	UseColor_ColorTable                      = 1,
	UseColor_Foreground                      = 2,
	UseColor_Foreground_Subdued              = 3,
	UseColor_UseStyle                        = 4,
	UseColor_MAX                             = 5,
};

// Enum SlateCore.EConsumeMouseWheel
// NumValues: 0x0004
enum class EConsumeMouseWheel : uint8
{
	WhenScrollingPossible                    = 0,
	Always                                   = 1,
	Never                                    = 2,
	EConsumeMouseWheel_MAX                   = 3,
};

// Enum SlateCore.ESlateParentWindowSearchMethod
// NumValues: 0x0003
enum class ESlateParentWindowSearchMethod : uint8
{
	ActiveWindow                             = 0,
	MainWindow                               = 1,
	ESlateParentWindowSearchMethod_MAX       = 2,
};

// Enum SlateCore.ESlateCheckBoxType
// NumValues: 0x0003
enum class ESlateCheckBoxType : uint8
{
	CheckBox                                 = 0,
	ToggleButton                             = 1,
	ESlateCheckBoxType_MAX                   = 2,
};

// Enum SlateCore.ECheckBoxState
// NumValues: 0x0004
enum class ECheckBoxState : uint8
{
	Unchecked                                = 0,
	Checked                                  = 1,
	Undetermined                             = 2,
	ECheckBoxState_MAX                       = 3,
};

// Enum SlateCore.ETextOverflowPolicy
// NumValues: 0x0005
enum class ETextOverflowPolicy : uint8
{
	Clip                                     = 0,
	Ellipsis                                 = 1,
	MultilineEllipsis                        = 2,
	MiddleEllipsis                           = 3,
	ETextOverflowPolicy_MAX                  = 4,
};

// Enum SlateCore.ETextTransformPolicy
// NumValues: 0x0004
enum class ETextTransformPolicy : uint8
{
	None                                     = 0,
	ToLower                                  = 1,
	ToUpper                                  = 2,
	ETextTransformPolicy_MAX                 = 3,
};

// Enum SlateCore.EStyleColor
// NumValues: 0x003E
enum class EStyleColor : uint8
{
	Black                                    = 0,
	Background                               = 1,
	Title                                    = 2,
	WindowBorder                             = 3,
	Foldout                                  = 4,
	Input                                    = 5,
	InputOutline                             = 6,
	Recessed                                 = 7,
	Panel                                    = 8,
	Header                                   = 9,
	Dropdown                                 = 10,
	DropdownOutline                          = 11,
	Hover                                    = 12,
	Hover2                                   = 13,
	White                                    = 14,
	White25                                  = 15,
	Highlight                                = 16,
	Primary                                  = 17,
	PrimaryHover                             = 18,
	PrimaryPress                             = 19,
	Secondary                                = 20,
	Foreground                               = 21,
	ForegroundHover                          = 22,
	ForegroundInverted                       = 23,
	ForegroundHeader                         = 24,
	Select                                   = 25,
	SelectInactive                           = 26,
	SelectParent                             = 27,
	SelectHover                              = 28,
	Notifications                            = 29,
	AccentBlue                               = 30,
	AccentPurple                             = 31,
	AccentPink                               = 32,
	AccentRed                                = 33,
	AccentOrange                             = 34,
	AccentYellow                             = 35,
	AccentGreen                              = 36,
	AccentBrown                              = 37,
	AccentBlack                              = 38,
	AccentGray                               = 39,
	AccentWhite                              = 40,
	AccentFolder                             = 41,
	Warning                                  = 42,
	Error                                    = 43,
	Success                                  = 44,
	User1                                    = 45,
	User2                                    = 46,
	User3                                    = 47,
	User4                                    = 48,
	User5                                    = 49,
	User6                                    = 50,
	User7                                    = 51,
	User8                                    = 52,
	User9                                    = 53,
	User10                                   = 54,
	User11                                   = 55,
	User12                                   = 56,
	User13                                   = 57,
	User14                                   = 58,
	User15                                   = 59,
	User16                                   = 60,
	MAX                                      = 61,
};

// ScriptStruct SlateCore.InputEvent
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FInputEvent
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FInputEvent;

// ScriptStruct SlateCore.NavigationEvent
// 0x0008 (0x0028 - 0x0020)
struct FNavigationEvent final : public FInputEvent
{
public:
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNavigationEvent;

// ScriptStruct SlateCore.Geometry
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x04) FGeometry final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeometry;

// ScriptStruct SlateCore.FontData
// 0x0028 (0x0028 - 0x0000)
struct FFontData final
{
public:
	class FString                                 FontFilename;                                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10[0x4];                                       // 0x0010(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	EFontHinting                                  Hinting;                                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFontLoadingPolicy                            LoadingPolicy;                                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubFaceIndex;                                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                FontFaceAsset;                                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FFontData;

// ScriptStruct SlateCore.TypefaceEntry
// 0x0030 (0x0030 - 0x0000)
struct FTypefaceEntry final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFontData                              Font;                                              // 0x0008(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypefaceEntry;

// ScriptStruct SlateCore.Typeface
// 0x0010 (0x0010 - 0x0000)
struct FTypeface final
{
public:
	TArray<struct FTypefaceEntry>                 Fonts;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypeface;

// ScriptStruct SlateCore.CompositeFallbackFont
// 0x0018 (0x0018 - 0x0000)
struct FCompositeFallbackFont
{
public:
	struct FTypeface                              Typeface;                                          // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	float                                         ScalingFactor;                                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCompositeFallbackFont;

// ScriptStruct SlateCore.CompositeSubFont
// 0x0020 (0x0038 - 0x0018)
struct FCompositeSubFont final : public FCompositeFallbackFont
{
public:
	TArray<struct FInt32Range>                    CharacterRanges;                                   // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Cultures;                                          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCompositeSubFont;

// ScriptStruct SlateCore.CompositeFont
// 0x0040 (0x0040 - 0x0000)
struct FCompositeFont final
{
public:
	struct FTypeface                              DefaultTypeface;                                   // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	struct FCompositeFallbackFont                 FallbackTypeface;                                  // 0x0010(0x0018)(NativeAccessSpecifierPublic)
	TArray<struct FCompositeSubFont>              SubTypefaces;                                      // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnableAscentDescentOverride;                      // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCompositeFont;

// ScriptStruct SlateCore.FontOutlineSettings
// 0x0020 (0x0020 - 0x0000)
struct FFontOutlineSettings final
{
public:
	int32                                         OutlineSize;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMiteredCorners;                                   // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSeparateFillAlpha;                                // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyOutlineToDropShadows;                        // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                OutlineMaterial;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FLinearColor                           OutlineColor;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFontOutlineSettings;

// ScriptStruct SlateCore.SlateFontInfo
// 0x0060 (0x0060 - 0x0000)
struct FSlateFontInfo final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UObject*                                FontMaterial;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FFontOutlineSettings                   OutlineSettings;                                   // 0x0010(0x0020)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TypefaceFontName;                                  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Size;                                              // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LetterSpacing;                                     // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkewAmount;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x1];                                       // 0x0054(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bForceMonospaced;                                  // 0x0055(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMaterialIsStencil;                                // 0x0056(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MonospacedWidth;                                   // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSlateFontInfo;

// ScriptStruct SlateCore.PointerEvent
// 0x0058 (0x0078 - 0x0020)
struct FPointerEvent final : public FInputEvent
{
public:
	uint8                                         Pad_20[0x58];                                      // 0x0020(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPointerEvent;

// ScriptStruct SlateCore.SlateColor
// 0x0014 (0x0014 - 0x0000)
struct FSlateColor final
{
public:
	struct FLinearColor                           SpecifiedColor;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateColorStylingMode                        ColorUseRule;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSlateColor;

// ScriptStruct SlateCore.SlateBrushOutlineSettings
// 0x0040 (0x0040 - 0x0000)
struct FSlateBrushOutlineSettings final
{
public:
	struct FVector4                               CornerRadii;                                       // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            Color;                                             // 0x0020(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushRoundingType                       RoundingType;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBrushTransparency;                             // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSlateBrushOutlineSettings;

// ScriptStruct SlateCore.DeprecateSlateVector2D
// 0x0000 (0x0008 - 0x0008)
struct FDeprecateSlateVector2D final : public FVector2f
{
};
DUMPER7_ASSERTS_FDeprecateSlateVector2D;

// ScriptStruct SlateCore.Margin
// 0x0010 (0x0010 - 0x0000)
struct FMargin final
{
public:
	float                                         Left;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Top;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Right;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bottom;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMargin;

// ScriptStruct SlateCore.SlateBrush
// 0x00B0 (0x00B0 - 0x0000)
struct FSlateBrush final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            TintColor;                                         // 0x0008(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	ESlateBrushDrawType                           DrawAs;                                            // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushTileType                           Tiling;                                            // 0x001D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushMirrorType                         Mirroring;                                         // 0x001E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushImageType                          ImageType;                                         // 0x001F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDeprecateSlateVector2D                ImageSize;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Margin;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                ResourceObject;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	struct FSlateBrushOutlineSettings             OutlineSettings;                                   // 0x0040(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FBox2f                                 UVRegion;                                          // 0x0080(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         bIsDynamicallyLoaded : 1;                          // 0x0094(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHasUObject : 1;                                   // 0x0094(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_95[0x13];                                      // 0x0095(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResourceName;                                      // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FSlateBrush;

// ScriptStruct SlateCore.SlateWidgetStyle
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSlateWidgetStyle
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSlateWidgetStyle;

// ScriptStruct SlateCore.TextBlockStyle
// 0x02D8 (0x02E0 - 0x0008)
struct FTextBlockStyle final : public FSlateWidgetStyle
{
public:
	struct FSlateFontInfo                         Font;                                              // 0x0008(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            ColorAndOpacity;                                   // 0x0068(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDeprecateSlateVector2D                ShadowOffset;                                      // 0x007C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColorAndOpacity;                             // 0x0084(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            SelectedBackgroundColor;                           // 0x0094(0x0014)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            HighlightColor;                                    // 0x00A8(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            HighlightShape;                                    // 0x00C0(0x00B0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateBrush                            StrikeBrush;                                       // 0x0170(0x00B0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UnderlineBrush;                                    // 0x0220(0x00B0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          TransformPolicy;                                   // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextOverflowPolicy                           OverflowPolicy;                                    // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D2[0xE];                                      // 0x02D2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTextBlockStyle;

// ScriptStruct SlateCore.ScrollBarStyle
// 0x0648 (0x0650 - 0x0008)
struct FScrollBarStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            HorizontalBackgroundImage;                         // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalBackgroundImage;                           // 0x00C0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalTopSlotImage;                              // 0x0170(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HorizontalTopSlotImage;                            // 0x0220(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalBottomSlotImage;                           // 0x02D0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HorizontalBottomSlotImage;                         // 0x0380(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            NormalThumbImage;                                  // 0x0430(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HoveredThumbImage;                                 // 0x04E0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DraggedThumbImage;                                 // 0x0590(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x0640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_644[0xC];                                      // 0x0644(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FScrollBarStyle;

// ScriptStruct SlateCore.EditableTextBoxStyle
// 0x0C78 (0x0C80 - 0x0008)
struct FEditableTextBoxStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BackgroundImageNormal;                             // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageHovered;                            // 0x00C0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageFocused;                            // 0x0170(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageReadOnly;                           // 0x0220(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        TextStyle;                                         // 0x02E0(0x02E0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            ForegroundColor;                                   // 0x05C0(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            BackgroundColor;                                   // 0x05D4(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            ReadOnlyForegroundColor;                           // 0x05E8(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            FocusedForegroundColor;                            // 0x05FC(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                HScrollBarPadding;                                 // 0x0610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                VScrollBarPadding;                                 // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FScrollBarStyle                        ScrollBarStyle;                                    // 0x0630(0x0650)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEditableTextBoxStyle;

// ScriptStruct SlateCore.SlateSound
// 0x0018 (0x0018 - 0x0000)
struct FSlateSound final
{
public:
	class UObject*                                ResourceObject;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSlateSound;

// ScriptStruct SlateCore.CheckBoxStyle
// 0x0948 (0x0950 - 0x0008)
struct FCheckBoxStyle final : public FSlateWidgetStyle
{
public:
	ESlateCheckBoxType                            CheckBoxType;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            UncheckedImage;                                    // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UncheckedHoveredImage;                             // 0x00C0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UncheckedPressedImage;                             // 0x0170(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CheckedImage;                                      // 0x0220(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CheckedHoveredImage;                               // 0x02D0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CheckedPressedImage;                               // 0x0380(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UndeterminedImage;                                 // 0x0430(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UndeterminedHoveredImage;                          // 0x04E0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UndeterminedPressedImage;                          // 0x0590(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x0640(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImage;                                   // 0x0650(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundHoveredImage;                            // 0x0700(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundPressedImage;                            // 0x07B0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            ForegroundColor;                                   // 0x0860(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            HoveredForeground;                                 // 0x0874(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            PressedForeground;                                 // 0x0888(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            CheckedForeground;                                 // 0x089C(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            CheckedHoveredForeground;                          // 0x08B0(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            CheckedPressedForeground;                          // 0x08C4(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            UndeterminedForeground;                            // 0x08D8(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            BorderBackgroundColor;                             // 0x08EC(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateSound                            CheckedSlateSound;                                 // 0x0900(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            UncheckedSlateSound;                               // 0x0918(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            HoveredSlateSound;                                 // 0x0930(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_948[0x8];                                      // 0x0948(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCheckBoxStyle;

// ScriptStruct SlateCore.TableRowStyle
// 0x0B48 (0x0B50 - 0x0008)
struct FTableRowStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SelectorFocusedBrush;                              // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActiveHoveredBrush;                                // 0x00C0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActiveBrush;                                       // 0x0170(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            InactiveHoveredBrush;                              // 0x0220(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            InactiveBrush;                                     // 0x02D0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bUseParentRowBrush;                                // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_381[0xF];                                      // 0x0381(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ParentRowBackgroundBrush;                          // 0x0390(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ParentRowBackgroundHoveredBrush;                   // 0x0440(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            EvenRowBackgroundHoveredBrush;                     // 0x04F0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            EvenRowBackgroundBrush;                            // 0x05A0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OddRowBackgroundHoveredBrush;                      // 0x0650(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OddRowBackgroundBrush;                             // 0x0700(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            TextColor;                                         // 0x07B0(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            SelectedTextColor;                                 // 0x07C4(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D8[0x8];                                      // 0x07D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            DropIndicator_Above;                               // 0x07E0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DropIndicator_Onto;                                // 0x0890(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DropIndicator_Below;                               // 0x0940(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActiveHighlightedBrush;                            // 0x09F0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            InactiveHighlightedBrush;                          // 0x0AA0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTableRowStyle;

// ScriptStruct SlateCore.TableColumnHeaderStyle
// 0x0638 (0x0640 - 0x0008)
struct FTableColumnHeaderStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SortPrimaryAscendingImage;                         // 0x0010(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SortPrimaryDescendingImage;                        // 0x00C0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SortSecondaryAscendingImage;                       // 0x0170(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SortSecondaryDescendingImage;                      // 0x0220(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            NormalBrush;                                       // 0x02D0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HoveredBrush;                                      // 0x0380(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MenuDropdownImage;                                 // 0x0430(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MenuDropdownNormalBorderBrush;                     // 0x04E0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MenuDropdownHoveredBorderBrush;                    // 0x0590(0x00B0)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTableColumnHeaderStyle;

// ScriptStruct SlateCore.SplitterStyle
// 0x0168 (0x0170 - 0x0008)
struct FSplitterStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            HandleNormalBrush;                                 // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HandleHighlightBrush;                              // 0x00C0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSplitterStyle;

// ScriptStruct SlateCore.HeaderRowStyle
// 0x0F98 (0x0FA0 - 0x0008)
struct FHeaderRowStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTableColumnHeaderStyle                ColumnStyle;                                       // 0x0010(0x0640)(Edit, NativeAccessSpecifierPublic)
	struct FTableColumnHeaderStyle                LastColumnStyle;                                   // 0x0650(0x0640)(Edit, NativeAccessSpecifierPublic)
	struct FSplitterStyle                         ColumnSplitterStyle;                               // 0x0C90(0x0170)(Edit, NativeAccessSpecifierPublic)
	float                                         SplitterHandleSize;                                // 0x0E00(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E04[0xC];                                      // 0x0E04(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BackgroundBrush;                                   // 0x0E10(0x00B0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ForegroundColor;                                   // 0x0EC0(0x0014)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_ED4[0xC];                                      // 0x0ED4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            HorizontalSeparatorBrush;                          // 0x0EE0(0x00B0)(Edit, NativeAccessSpecifierPublic)
	float                                         HorizontalSeparatorThickness;                      // 0x0F90(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F94[0xC];                                      // 0x0F94(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHeaderRowStyle;

// ScriptStruct SlateCore.ButtonStyle
// 0x0368 (0x0370 - 0x0008)
struct FButtonStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Normal;                                            // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Hovered;                                           // 0x00C0(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Pressed;                                           // 0x0170(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Disabled;                                          // 0x0220(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            NormalForeground;                                  // 0x02D0(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            HoveredForeground;                                 // 0x02E4(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
