#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Slider_ASA_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Slider_ASA_Widget.Slider_ASA_Widget_C
// 0x0030 (0x03A8 - 0x0378)
class USlider_ASA_Widget_C final : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               OverlayCapsLimit;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySlider;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                SliderFloatValue;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         LastValue;                                         // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetupValue(double float_0, bool PreventRecallParent);
	void SetupSetPercent(float InputPin, bool PreventRecallParent);
	class UWidget* GetOverrideHighligteableWidgetBP();
	void ExecuteUbergraph_Slider_ASA_Widget(int32 EntryPoint);
	void BPExecutedCommandForPrimalUI(class FName CommandName, const struct FBPNetExecParams& ExecParams);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Slider_ASA_Widget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Slider_ASA_Widget_C")
	}
	static class USlider_ASA_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlider_ASA_Widget_C>();
	}
};
DUMPER7_ASSERTS_USlider_ASA_Widget_C;

}

