#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmartObjectsModule

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "PropertyBindingUtils_structs.hpp"
#include "WorldConditions_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SmartObjectsModule.ESmartObjectChangeReason
// NumValues: 0x000E
enum class ESmartObjectChangeReason : uint8
{
	None                                     = 0,
	OnEvent                                  = 1,
	OnTagAdded                               = 2,
	OnTagRemoved                             = 3,
	OnClaimed                                = 4,
	OnOccupied                               = 5,
	OnReleased                               = 6,
	OnSlotEnabled                            = 7,
	OnSlotDisabled                           = 8,
	OnObjectEnabled                          = 9,
	OnObjectDisabled                         = 10,
	OnComponentBound                         = 11,
	OnComponentUnbound                       = 12,
	ESmartObjectChangeReason_MAX             = 13,
};

// Enum SmartObjectsModule.ESmartObjectEntrancePriority
// NumValues: 0x000B
enum class ESmartObjectEntrancePriority : uint8
{
	Lowest                                   = 0,
	Lower                                    = 1,
	Low                                      = 2,
	BelowNormal                              = 3,
	Normal                                   = 4,
	AboveNormal                              = 5,
	High                                     = 6,
	Higher                                   = 7,
	Highest                                  = 8,
	MIN                                      = 0,
	MAX                                      = 8,
};

// Enum SmartObjectsModule.ESmartObjectSlotShape
// NumValues: 0x0003
enum class ESmartObjectSlotShape : uint8
{
	Circle                                   = 0,
	Rectangle                                = 1,
	ESmartObjectSlotShape_MAX                = 2,
};

// Enum SmartObjectsModule.ESmartObjectSlotState
// NumValues: 0x0006
enum class ESmartObjectSlotState : uint8
{
	Invalid                                  = 0,
	Free                                     = 1,
	Claimed                                  = 2,
	Occupied                                 = 3,
	Disabled                                 = 4,
	ESmartObjectSlotState_MAX                = 5,
};

// Enum SmartObjectsModule.ETrySpawnActorIfDehydrated
// NumValues: 0x0003
enum class ETrySpawnActorIfDehydrated : uint8
{
	No                                       = 0,
	Yes                                      = 1,
	ETrySpawnActorIfDehydrated_MAX           = 2,
};

// Enum SmartObjectsModule.FSmartObjectSlotEntrySelectionMethod
// NumValues: 0x0003
enum class EFSmartObjectSlotEntrySelectionMethod : uint8
{
	First                                    = 0,
	NearestToSearchLocation                  = 1,
	FSmartObjectSlotEntrySelectionMethod_MAX = 2,
};

// Enum SmartObjectsModule.ESmartObjectCollectionRegistrationResult
// NumValues: 0x0005
enum class ESmartObjectCollectionRegistrationResult : uint8
{
	Failed_InvalidCollection                 = 0,
	Failed_AlreadyRegistered                 = 1,
	Failed_NotFromPersistentLevel            = 2,
	Succeeded                                = 3,
	ESmartObjectCollectionRegistrationResult_MAX = 4,
};

// Enum SmartObjectsModule.ESmartObjectTagMergingPolicy
// NumValues: 0x0003
enum class ESmartObjectTagMergingPolicy : uint8
{
	Combine                                  = 0,
	Override                                 = 1,
	ESmartObjectTagMergingPolicy_MAX         = 2,
};

// Enum SmartObjectsModule.ESmartObjectTagFilteringPolicy
// NumValues: 0x0004
enum class ESmartObjectTagFilteringPolicy : uint8
{
	NoFilter                                 = 0,
	Combine                                  = 1,
	Override                                 = 2,
	ESmartObjectTagFilteringPolicy_MAX       = 3,
};

// Enum SmartObjectsModule.ESmartObjectSlotNavigationLocationType
// NumValues: 0x0003
enum class ESmartObjectSlotNavigationLocationType : uint8
{
	Entry                                    = 0,
	Exit                                     = 1,
	ESmartObjectSlotNavigationLocationType_MAX = 2,
};

// Enum SmartObjectsModule.ESmartObjectClaimPriority
// NumValues: 0x0008
enum class ESmartObjectClaimPriority : uint8
{
	None                                     = 0,
	Low                                      = 1,
	BelowNormal                              = 2,
	Normal                                   = 3,
	AboveNormal                              = 4,
	High                                     = 5,
	MIN                                      = 0,
	MAX                                      = 5,
};

// Enum SmartObjectsModule.ESmartObjectTraceType
// NumValues: 0x0004
enum class ESmartObjectTraceType : uint8
{
	ByChannel                                = 0,
	ByProfile                                = 1,
	ByObjectTypes                            = 2,
	ESmartObjectTraceType_MAX                = 3,
};

// ScriptStruct SmartObjectsModule.SmartObjectUserCapsuleParams
// 0x000C (0x000C - 0x0000)
struct FSmartObjectUserCapsuleParams final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepHeight;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectUserCapsuleParams;

// ScriptStruct SmartObjectsModule.SmartObjectDefinitionData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSmartObjectDefinitionData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectDefinitionData;

// ScriptStruct SmartObjectsModule.SmartObjectSlotAnnotation
// 0x0000 (0x0008 - 0x0008)
struct FSmartObjectSlotAnnotation : public FSmartObjectDefinitionData
{
};
DUMPER7_ASSERTS_FSmartObjectSlotAnnotation;

// ScriptStruct SmartObjectsModule.SmartObjectAnnotation_SlotUserCollision
// 0x0010 (0x0018 - 0x0008)
struct FSmartObjectAnnotation_SlotUserCollision final : public FSmartObjectSlotAnnotation
{
public:
	bool                                          bUseUserCapsuleSize;                               // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectUserCapsuleParams          Capsule;                                           // 0x000C(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectAnnotation_SlotUserCollision;

// ScriptStruct SmartObjectsModule.SmartObjectHandle
// 0x0008 (0x0008 - 0x0000)
struct FSmartObjectHandle final
{
public:
	uint64                                        ID;                                                // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FSmartObjectHandle;

// ScriptStruct SmartObjectsModule.SmartObjectSlotHandle
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FSmartObjectSlotHandle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectSlotHandle;

// ScriptStruct SmartObjectsModule.SmartObjectEventData
// 0x0038 (0x0038 - 0x0000)
struct FSmartObjectEventData final
{
public:
	struct FSmartObjectHandle                     SmartObjectHandle;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotHandle                 SlotHandle;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESmartObjectChangeReason                      Reason;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag;                                               // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x14];                                      // 0x0024(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectEventData;

// ScriptStruct SmartObjectsModule.SmartObjectDefinitionDataHandle
// 0x0004 (0x0004 - 0x0000)
struct FSmartObjectDefinitionDataHandle final
{
public:
	uint16                                        SlotIndex;                                         // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint16                                        DataIndex;                                         // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FSmartObjectDefinitionDataHandle;

// ScriptStruct SmartObjectsModule.SmartObjectDefinitionPropertyBinding
// 0x0028 (0x0028 - 0x0000)
struct FSmartObjectDefinitionPropertyBinding final
{
public:
	struct FPropertyBindingPath                   SourcePath;                                        // 0x0000(0x0010)(Protected, NativeAccessSpecifierProtected)
	struct FPropertyBindingPath                   TargetPath;                                        // 0x0010(0x0010)(Protected, NativeAccessSpecifierProtected)
	struct FSmartObjectDefinitionDataHandle       SourceDataHandle;                                  // 0x0020(0x0004)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSmartObjectDefinitionDataHandle       TargetDataHandle;                                  // 0x0024(0x0004)(NoDestructor, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FSmartObjectDefinitionPropertyBinding;

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionBase
// 0x0000 (0x0010 - 0x0010)
struct FSmartObjectWorldConditionBase : public FWorldConditionBase
{
};
DUMPER7_ASSERTS_FSmartObjectWorldConditionBase;

// ScriptStruct SmartObjectsModule.SmartObjectSlotEntranceAnnotation
// 0x0048 (0x0050 - 0x0008)
struct FSmartObjectSlotEntranceAnnotation final : public FSmartObjectSlotAnnotation
{
public:
	struct FVector3f                              Offset;                                            // 0x0008(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator3f                             Rotation;                                          // 0x0014(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tags;                                              // 0x0020(0x0020)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bIsEntry : 1;                                      // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsExit : 1;                                       // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTraceGroundLocation : 1;                          // 0x0040(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCheckTransitionTrajectory : 1;                    // 0x0040(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	ESmartObjectEntrancePriority                  SelectionPriority;                                 // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TrajectoryStartHeightOffset;                       // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TrajectorySlotHeightOffset;                        // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionCheckRadius;                             // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectSlotEntranceAnnotation;

// ScriptStruct SmartObjectsModule.SmartObjectSlotReference
// 0x0001 (0x0001 - 0x0000)
struct FSmartObjectSlotReference final
{
public:
	uint8                                         Index;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FSmartObjectSlotReference;

// ScriptStruct SmartObjectsModule.SmartObjectSlotLinkAnnotation
// 0x0010 (0x0018 - 0x0008)
struct FSmartObjectSlotLinkAnnotation final : public FSmartObjectSlotAnnotation
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotReference              LinkedSlot;                                        // 0x0010(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectSlotLinkAnnotation;

// ScriptStruct SmartObjectsModule.SmartObjectDefinitionReference
// 0x0028 (0x0028 - 0x0000)
struct FSmartObjectDefinitionReference final
{
public:
	class USmartObjectDefinition*                 SmartObjectDefinition;                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	struct FInstancedPropertyBag                  Parameters;                                        // 0x0008(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGuid>                          PropertyOverrides;                                 // 0x0018(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FSmartObjectDefinitionReference;

// ScriptStruct SmartObjectsModule.SmartObjectComponentInstanceData
// 0x0028 (0x0090 - 0x0068)
struct FSmartObjectComponentInstanceData final : public FActorComponentInstanceData
{
public:
	struct FSmartObjectDefinitionReference        SmartObjectDefinitionRef;                          // 0x0068(0x0028)(Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FSmartObjectComponentInstanceData;

// ScriptStruct SmartObjectsModule.SmartObjectDefinitionDataProxy
// 0x0010 (0x0010 - 0x0000)
struct FSmartObjectDefinitionDataProxy final
{
public:
	struct FInstancedStruct                       Data;                                              // 0x0000(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectDefinitionDataProxy;

// ScriptStruct SmartObjectsModule.SmartObjectSlotDefinition
// 0x00E0 (0x00E0 - 0x0000)
struct FSmartObjectSlotDefinition final
{
public:
	struct FVector3f                              Offset;                                            // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator3f                             Rotation;                                          // 0x000C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      UserTagFilter;                                     // 0x0020(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ActivityTags;                                      // 0x0068(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RuntimeTags;                                       // 0x0088(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FWorldConditionQueryDefinition         SelectionPreconditions;                            // 0x00A8(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class USmartObjectBehaviorDefinition*> BehaviorDefinitions;                               // 0x00C0(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TArray<struct FSmartObjectDefinitionDataProxy> DefinitionData;                                   // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectSlotDefinition;

// ScriptStruct SmartObjectsModule.SmartObjectDefinitionPreviewData
// 0x0098 (0x0098 - 0x0000)
struct FSmartObjectDefinitionPreviewData final
{
public:
	TSoftClassPtr<class UClass>                   ObjectActorClass;                                  // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ObjectMeshPath;                                    // 0x0028(0x0020)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   UserActorClass;                                    // 0x0048(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   UserValidationFilterClass;                         // 0x0070(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectDefinitionPreviewData;

// ScriptStruct SmartObjectsModule.SmartObjectSpatialEntryData
// 0x0001 (0x0001 - 0x0000)
struct FSmartObjectSpatialEntryData
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectSpatialEntryData;

// ScriptStruct SmartObjectsModule.SmartObjectHashGridEntryData
// 0x000B (0x000C - 0x0001)
struct alignas(0x04) FSmartObjectHashGridEntryData final : public FSmartObjectSpatialEntryData
{
public:
	uint8                                         Pad_1[0xB];                                        // 0x0001(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectHashGridEntryData;

// ScriptStruct SmartObjectsModule.SmartObjectOctreeEntryData
// 0x000F (0x0010 - 0x0001)
struct alignas(0x08) FSmartObjectOctreeEntryData final : public FSmartObjectSpatialEntryData
{
public:
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectOctreeEntryData;

// ScriptStruct SmartObjectsModule.SmartObjectCollectionEntry
// 0x00F0 (0x00F0 - 0x0000)
struct FSmartObjectCollectionEntry final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        Path;                                              // 0x0020(0x0020)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTransform                             Transform;                                         // 0x0040(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox                                   Bounds;                                            // 0x00A0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSmartObjectHandle                     Handle;                                            // 0x00D8(0x0008)(Edit, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        DefinitionIdx;                                     // 0x00E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E4[0xC];                                       // 0x00E4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectCollectionEntry;

// ScriptStruct SmartObjectsModule.SmartObjectContainer
// 0x00B0 (0x00B0 - 0x0000)
struct FSmartObjectContainer final
{
public:
	struct FBox                                   Bounds;                                            // 0x0000(0x0038)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSmartObjectCollectionEntry>    CollectionEntries;                                 // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TMap<struct FSmartObjectHandle, struct FSoftObjectPath> RegisteredIdToObjectMap;                 // 0x0048(0x0050)(Protected, NativeAccessSpecifierProtected)
	TArray<class USmartObjectDefinition*>         Definitions;                                       // 0x0098(0x0010)(Edit, ZeroConstructor, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UObject*                                Owner;                                             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FSmartObjectContainer;

// ScriptStruct SmartObjectsModule.SmartObjectUserHandle
// 0x0004 (0x0004 - 0x0000)
struct FSmartObjectUserHandle final
{
public:
	uint32                                        ID;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FSmartObjectUserHandle;

// ScriptStruct SmartObjectsModule.SmartObjectClaimHandle
// 0x0020 (0x0020 - 0x0000)
struct FSmartObjectClaimHandle final
{
public:
	struct FSmartObjectHandle                     SmartObjectHandle;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotHandle                 SlotHandle;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectUserHandle                 UserHandle;                                        // 0x0018(0x0004)(Edit, Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectClaimHandle;

// ScriptStruct SmartObjectsModule.SmartObjectSlotStateData
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSmartObjectSlotStateData
{
};
#pragma pack(pop)
DUMPER7_ASSERTS_FSmartObjectSlotStateData;

// ScriptStruct SmartObjectsModule.SmartObjectSlotTransform
// 0x0060 (0x0060 - 0x0000)
struct FSmartObjectSlotTransform final : public FSmartObjectSlotStateData
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FSmartObjectSlotTransform;

// ScriptStruct SmartObjectsModule.SmartObjectRuntimeSlot
// 0x00A8 (0x00A8 - 0x0000)
struct FSmartObjectRuntimeSlot final
{
public:
	struct FVector3f                              Offset;                                            // 0x0000(0x000C)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator3f                             Rotation;                                          // 0x000C(0x000C)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  Tags;                                              // 0x0018(0x0020)(Edit, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectUserHandle                 User;                                              // 0x0068(0x0004)(Edit, Transient, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWorldConditionQueryState              PreconditionState;                                 // 0x0070(0x0030)(Transient, Protected, NativeAccessSpecifierProtected)
	ESmartObjectSlotState                         State;                                             // 0x00A0(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESmartObjectClaimPriority                     ClaimedPriority;                                   // 0x00A1(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bSlotEnabled : 1;                                  // 0x00A2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bObjectEnabled : 1;                                // 0x00A2(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectRuntimeSlot;

// ScriptStruct SmartObjectsModule.SmartObjectRuntime
// 0x0130 (0x0130 - 0x0000)
struct FSmartObjectRuntime final
{
public:
	struct FWorldConditionQueryState              PreconditionState;                                 // 0x0000(0x0030)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FSmartObjectRuntimeSlot>        Slots;                                             // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class USmartObjectDefinition*                 Definition;                                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TWeakObjectPtr<class USmartObjectComponent>   OwnerComponent;                                    // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0060(0x0060)(Edit, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  Tags;                                              // 0x00C0(0x0020)(Edit, Transient, EditConst, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x28];                                      // 0x00E0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectHandle                     RegisteredHandle;                                  // 0x0108(0x0008)(Edit, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FInstancedStruct                       SpatialEntryData;                                  // 0x0110(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint16                                        DisableFlags;                                      // 0x0120(0x0002)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_122[0xE];                                      // 0x0122(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectRuntime;

// ScriptStruct SmartObjectsModule.SmartObjectSlotView
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FSmartObjectSlotView final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectSlotView;

// ScriptStruct SmartObjectsModule.SmartObjectRequestFilter
// 0x00D0 (0x00D0 - 0x0000)
struct alignas(0x10) FSmartObjectRequestFilter final
{
public:
	struct FGameplayTagContainer                  UserTags;                                          // 0x0000(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	ESmartObjectClaimPriority                     ClaimPriority;                                     // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      ActivityRequirements;                              // 0x0028(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class USmartObjectBehaviorDefinition>> BehaviorDefinitionClasses;             // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bShouldEvaluateConditions;                         // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldIncludeClaimedSlots;                        // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldIncludeDisabledSlots;                       // 0x0082(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83[0x4D];                                      // 0x0083(0x004D)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectRequestFilter;

// ScriptStruct SmartObjectsModule.SmartObjectRequest
// 0x0110 (0x0110 - 0x0000)
struct FSmartObjectRequest final
{
public:
	struct FBox                                   QueryBox;                                          // 0x0000(0x0038)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectRequestFilter              Filter;                                            // 0x0040(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectRequest;

// ScriptStruct SmartObjectsModule.SmartObjectRequestResult
// 0x0018 (0x0018 - 0x0000)
struct FSmartObjectRequestResult final
{
public:
	struct FSmartObjectHandle                     SmartObjectHandle;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotHandle                 SlotHandle;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectRequestResult;

// ScriptStruct SmartObjectsModule.SmartObjectSlotEntranceHandle
// 0x0018 (0x0018 - 0x0000)
struct FSmartObjectSlotEntranceHandle final
{
public:
	struct FSmartObjectSlotHandle                 SlotHandle;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectSlotEntranceHandle;

// ScriptStruct SmartObjectsModule.SmartObjectSlotEntranceLocationRequest
// 0x0058 (0x0058 - 0x0000)
struct FSmartObjectSlotEntranceLocationRequest final
{
public:
	class AActor*                                 UserActor;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	TSubclassOf<class USmartObjectSlotValidationFilter> ValidationFilter;                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ANavigationData*                        NavigationData;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FSmartObjectUserCapsuleParams          UserCapsuleParams;                                 // 0x0018(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SearchLocation;                                    // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFSmartObjectSlotEntrySelectionMethod         SelectMethod;                                      // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESmartObjectSlotNavigationLocationType        LocationType;                                      // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProjectNavigationLocation;                        // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTraceGroundLocation;                              // 0x0043(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckTransitionTrajectory;                        // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckEntranceLocationOverlap;                     // 0x0045(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckSlotLocationOverlap;                         // 0x0046(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSlotLocationAsFallback;                        // 0x0047(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectSlotEntranceLocationRequest;

// ScriptStruct SmartObjectsModule.SmartObjectSlotEntranceLocationResult
// 0x0080 (0x0080 - 0x0000)
struct FSmartObjectSlotEntranceLocationResult final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag;                                               // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tags;                                              // 0x0040(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotEntranceHandle         EntranceHandle;                                    // 0x0060(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsValid;                                          // 0x0078(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectSlotEntranceLocationResult;

// ScriptStruct SmartObjectsModule.SmartObjectSlotIndex
// 0x0004 (0x0004 - 0x0000)
struct FSmartObjectSlotIndex final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FSmartObjectSlotIndex;

// ScriptStruct SmartObjectsModule.SmartObjectTraceParams
// 0x0028 (0x0028 - 0x0000)
struct FSmartObjectTraceParams final
{
public:
	ESmartObjectTraceType                         Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               TraceChannel;                                      // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCollisionProfileName                  CollisionProfile;                                  // 0x0018(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bTraceComplex;                                     // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectTraceParams;

// ScriptStruct SmartObjectsModule.SmartObjectSlotValidationParams
// 0x0080 (0x0080 - 0x0000)
struct FSmartObjectSlotValidationParams final
{
public:
	TSubclassOf<class UNavigationQueryFilter>     NavigationFilter;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                SearchExtents;                                     // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSmartObjectTraceParams                GroundTraceParameters;                             // 0x0020(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FSmartObjectTraceParams                TransitionTraceParameters;                         // 0x0048(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseNavigationCapsuleSize;                         // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectUserCapsuleParams          UserCapsule;                                       // 0x0074(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FSmartObjectSlotValidationParams;

// ScriptStruct SmartObjectsModule.SmartObjectActorUserData
// 0x0008 (0x0008 - 0x0000)
struct FSmartObjectActorUserData final
{
public:
	TWeakObjectPtr<class AActor>                  UserActor;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectActorUserData;

// ScriptStruct SmartObjectsModule.SmartObjectActorOwnerData
// 0x0020 (0x0020 - 0x0000)
struct FSmartObjectActorOwnerData final
{
public:
	struct FActorInstanceHandle                   Handle;                                            // 0x0000(0x0020)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectActorOwnerData;

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionObjectTagQueryState
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSmartObjectWorldConditionObjectTagQueryState final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectWorldConditionObjectTagQueryState;

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionObjectTagQuery
// 0x0060 (0x0070 - 0x0010)
struct FSmartObjectWorldConditionObjectTagQuery final : public FSmartObjectWorldConditionBase
{
public:
	uint8                                         Pad_10[0x18];                                      // 0x0010(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0028(0x0048)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSmartObjectWorldConditionObjectTagQuery;

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionSlotTagQueryState
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FSmartObjectWorldConditionSlotTagQueryState final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectWorldConditionSlotTagQueryState;

// ScriptStruct SmartObjectsModule.SmartObjectWorldConditionSlotTagQuery
// 0x0060 (0x0070 - 0x0010)
struct FSmartObjectWorldConditionSlotTagQuery final : public FSmartObjectWorldConditionBase
{
public:
	uint8                                         Pad_10[0x18];                                      // 0x0010(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0028(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FSmartObjectWorldConditionSlotTagQuery;

// ScriptStruct SmartObjectsModule.WorldCondition_SmartObjectActorTagQueryState
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FWorldCondition_SmartObjectActorTagQueryState final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWorldCondition_SmartObjectActorTagQueryState;

// ScriptStruct SmartObjectsModule.WorldCondition_SmartObjectActorTagQuery
// 0x0058 (0x0068 - 0x0010)
struct FWorldCondition_SmartObjectActorTagQuery final : public FSmartObjectWorldConditionBase
{
public:
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      TagQuery;                                          // 0x0020(0x0048)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWorldCondition_SmartObjectActorTagQuery;

}

