#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Soundscape

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Soundscape_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class Soundscape.SoundscapeBPFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class USoundscapeBPFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool SpawnSoundscapeColor(class UObject* WorldContextObject, class USoundscapeColor* SoundscapeColorIn, class UActiveSoundscapeColor** ActiveSoundscapeColor);
	static bool SpawnSoundscapePalette(class UObject* WorldContextObject, class USoundscapePalette* SoundscapePaletteIn, class UActiveSoundscapePalette** SoundscapePaletteAgentsOut);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundscapeBPFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundscapeBPFunctionLibrary")
	}
	static class USoundscapeBPFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundscapeBPFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_USoundscapeBPFunctionLibrary;

// Class Soundscape.SoundscapeColor
// 0x00D8 (0x0100 - 0x0028)
class USoundscapeColor final : public UObject
{
public:
	class USoundBase*                             Sound;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	float                                         VolumeBase;                                        // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchBase;                                         // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoundscapeColorModulationSettings     ModulationBehavior;                                // 0x0038(0x0030)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSoundscapeColorPlaybackSettings       PlaybackBehavior;                                  // 0x0068(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundscapeColorSpawnSettings          SpawnBehavior;                                     // 0x0078(0x0088)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundscapeColor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundscapeColor")
	}
	static class USoundscapeColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundscapeColor>();
	}
};
DUMPER7_ASSERTS_USoundscapeColor;

// Class Soundscape.ActiveSoundscapeColorVoice
// 0x0018 (0x0040 - 0x0028)
class UActiveSoundscapeColorVoice final : public UObject
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FTimerHandle                           TimerHandle;                                       // 0x0030(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFree;                                             // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StopLimitedDurationVoice(float FadeOutTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActiveSoundscapeColorVoice")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActiveSoundscapeColorVoice")
	}
	static class UActiveSoundscapeColorVoice* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActiveSoundscapeColorVoice>();
	}
};
DUMPER7_ASSERTS_UActiveSoundscapeColorVoice;

// Class Soundscape.ActiveSoundscapeColor
// 0x0168 (0x0190 - 0x0028)
class UActiveSoundscapeColor final : public UObject
{
public:
	class USoundBase*                             Sound;                                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundscapeColorModulationSettings     ModulationBehavior;                                // 0x0038(0x0030)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FSoundscapeColorPlaybackSettings       PlaybackBehavior;                                  // 0x0068(0x000C)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundscapeColorSpawnSettings          SpawnBehavior;                                     // 0x0078(0x0088)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x78];                                     // 0x0100(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActiveSoundscapeColorVoice*>    SoundscapeColorVoicePool;                          // 0x0178(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsPlaying();
	void Play(float ColorVolume, float ColorPitch, float ColorFadeInTime);
	void Stop(float ColorFadeOutTime);
	void UpdateSoundscapeColor();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActiveSoundscapeColor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActiveSoundscapeColor")
	}
	static class UActiveSoundscapeColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActiveSoundscapeColor>();
	}
};
DUMPER7_ASSERTS_UActiveSoundscapeColor;

// Class Soundscape.SoundscapeColorPointComponent
// 0x0008 (0x00C0 - 0x00B8)
class USoundscapeColorPointComponent final : public UActorComponent
{
public:
	struct FGameplayTag                           ColorPoint;                                        // 0x00B8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundscapeColorPointComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundscapeColorPointComponent")
	}
	static class USoundscapeColorPointComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundscapeColorPointComponent>();
	}
};
DUMPER7_ASSERTS_USoundscapeColorPointComponent;

// Class Soundscape.SoundscapePalette
// 0x0058 (0x0080 - 0x0028)
class USoundscapePalette final : public UObject
{
public:
	struct FGameplayTagQuery                      SoundscapePalettePlaybackConditions;               // 0x0028(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FSoundscapePaletteColor>        Colors;                                            // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundscapePalette")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundscapePalette")
	}
	static class USoundscapePalette* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundscapePalette>();
	}
};
DUMPER7_ASSERTS_USoundscapePalette;

// Class Soundscape.ActiveSoundscapePalette
// 0x0018 (0x0040 - 0x0028)
class UActiveSoundscapePalette final : public UObject
{
public:
	class UWorld*                                 World;                                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TArray<class UActiveSoundscapeColor*>         ActiveSoundscapeColors;                            // 0x0030(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	void Play();
	void Stop();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActiveSoundscapePalette")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActiveSoundscapePalette")
	}
	static class UActiveSoundscapePalette* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActiveSoundscapePalette>();
	}
};
DUMPER7_ASSERTS_UActiveSoundscapePalette;

// Class Soundscape.SoundscapeSettings
// 0x0070 (0x00A8 - 0x0038)
class USoundscapeSettings final : public UDeveloperSettings
{
public:
	TSet<struct FSoftObjectPath>                  SoundscapePaletteCollection;                       // 0x0038(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	bool                                          bDebugDraw;                                        // 0x0088(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LOD1ColorPointHashWidth;                           // 0x008C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LOD1ColorPointHashDistance;                        // 0x0090(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LOD2ColorPointHashWidth;                           // 0x0094(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LOD2ColorPointHashDistance;                        // 0x0098(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LOD3ColorPointHashWidth;                           // 0x009C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveColorPointHashWidth;                         // 0x00A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveColorPointHashUpdateTimeSeconds;             // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundscapeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundscapeSettings")
	}
	static class USoundscapeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundscapeSettings>();
	}
};
DUMPER7_ASSERTS_USoundscapeSettings;

// Class Soundscape.SoundscapeColorPointHashCellDensity
// 0x0050 (0x0078 - 0x0028)
class USoundscapeColorPointHashCellDensity final : public UObject
{
public:
	TMap<uint64, int32>                           ColorPointHashCellDensity;                         // 0x0028(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundscapeColorPointHashCellDensity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundscapeColorPointHashCellDensity")
	}
	static class USoundscapeColorPointHashCellDensity* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundscapeColorPointHashCellDensity>();
	}
};
DUMPER7_ASSERTS_USoundscapeColorPointHashCellDensity;

// Class Soundscape.SoundscapeColorPointHashMap
// 0x0098 (0x00C0 - 0x0028)
class USoundscapeColorPointHashMap final : public UObject
{
public:
	TMap<struct FGameplayTag, class USoundscapeColorPointHashCellDensity*> ColorPointHashMap;        // 0x0028(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	float                                         HashCellSize;                                      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         GridWidth;                                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int64                                         NumCells;                                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         HashCellFactor;                                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GridCenter;                                        // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                GridOriginOffset;                                  // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AddColorPointArrayToHash(const TArray<struct FVector>& Locations, const struct FGameplayTag& ColorPoint);
	bool AddColorPointToHash(const struct FVector& Location, const struct FGameplayTag& ColorPoint);
	uint64 CalculateHashIndex(const struct FVector& Location);
	void ClearHash();
	void InitializeHash(float HashCellSizeIn, const struct FVector& GridCenterIn);
	int32 NumColorPointsInCell(const struct FVector& Location, const struct FGameplayTag& ColorPoint);
	void SetGridCenterpoint(const struct FVector& Location);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundscapeColorPointHashMap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundscapeColorPointHashMap")
	}
	static class USoundscapeColorPointHashMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundscapeColorPointHashMap>();
	}
};
DUMPER7_ASSERTS_USoundscapeColorPointHashMap;

// Class Soundscape.SoundscapeColorPointHashMapCollection
// 0x0030 (0x0058 - 0x0028)
class USoundscapeColorPointHashMapCollection final : public UObject
{
public:
	class USoundscapeColorPointHashMap*           ColorPointHashMapLOD1;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class USoundscapeColorPointHashMap*           ColorPointHashMapLOD2;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class USoundscapeColorPointHashMap*           ColorPointHashMapLOD3;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	float                                         LOD1ColorPointHashWidth;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LOD1ColorPointHashDistance;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LOD2ColorPointHashWidth;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LOD2ColorPointHashDistance;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LOD3ColorPointHashWidth;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundscapeColorPointHashMapCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundscapeColorPointHashMapCollection")
	}
	static class USoundscapeColorPointHashMapCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundscapeColorPointHashMapCollection>();
	}
};
DUMPER7_ASSERTS_USoundscapeColorPointHashMapCollection;

// Class Soundscape.SoundscapeSubsystem
// 0x0238 (0x0268 - 0x0030)
class USoundscapeSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class USoundscapePalette*>               LoadedPaletteCollectionSet;                        // 0x0038(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TMap<class FName, struct FSoundscapePaletteCollection> UnloadedPaletteCollections;               // 0x0088(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x20];                                      // 0x00D8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USoundscapePalette*, class UActiveSoundscapePalette*> ActivePalettes;                 // 0x00F8(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_148[0x58];                                     // 0x0148(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundscapeColorPointHashMapCollection*> ColorPointHashMapCollections;              // 0x01A0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_1B0[0x60];                                     // 0x01B0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundscapeColorPointHashMap*           ColorPointHashMapLOD1;                             // 0x0210(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class USoundscapeColorPointHashMap*           ColorPointHashMapLOD2;                             // 0x0218(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class USoundscapeColorPointHashMap*           ColorPointHashMapLOD3;                             // 0x0220(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	class USoundscapeColorPointHashMap*           ActiveColorPointHashMap;                           // 0x0228(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	uint8                                         Pad_230[0x38];                                     // 0x0230(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddColorPointCollection(class FName ColorPointCollectionName, const struct FSoundscapeColorPointCollection& ColorPointCollection);
	bool AddPaletteCollection(class FName PaletteCollectionName, const struct FSoundscapePaletteCollection& PaletteCollection);
	int32 CheckColorPointDensity(const struct FVector& Location, const struct FGameplayTag& ColorPoint);
	void ClearState(const struct FGameplayTag& SoundscapeState);
	bool RemoveColorPointCollection(class FName ColorPointCollectionName);
	bool RemovePaletteCollection(class FName PaletteCollectionName);
	void RestartSoundscape();
	void SetState(const struct FGameplayTag& SoundscapeState);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundscapeSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundscapeSubsystem")
	}
	static class USoundscapeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundscapeSubsystem>();
	}
};
DUMPER7_ASSERTS_USoundscapeSubsystem;

}

