#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SP_Camera

#include "Basic.hpp"

#include "SP_Camera_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CinematicCamera_structs.hpp"
#include "SP_Interpolators_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SP_Camera.SPCameraMode
// 0x0128 (0x0150 - 0x0028)
class alignas(0x10) USPCameraMode : public UObject
{
public:
	class ASPPlayerCameraManager*                 PlayerCamera;                                      // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionInTime;                                  // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FViewTargetTransitionParams            TransitionParams;                                  // 0x0034(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FOV;                                               // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseViewTargetCameraComponent;                     // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCineCam;                                       // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCineCamSettings;                               // 0x004A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideFilmback;                                 // 0x004B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraFilmbackSettings                CineCam_FilmbackOverride;                          // 0x004C(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         CineCam_CurrentFocalLength;                        // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CineCam_CurrentAperture;                           // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CineCam_FocusDistanceAdjustment;                   // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CineCam_DisplayOnly_FOV;                           // 0x006C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         BlockingActors;                                    // 0x0070(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCameraShakeBase>           CameraShakeClass;                                  // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraShakeBase*                       CameraShakeInstance;                               // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bScaleShakeWithViewTargetVelocity;                 // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ShakeScaling_SpeedRange;                           // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              ShakeScaling_ScaleRange;                           // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIIRInterpolatorFloat                  ShakeScaleInterpolator;                            // 0x00C0(0x0020)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bDrawDebugShake;                                   // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseCustomFocusDistance;                           // 0x00E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideViewPitchMinAndMax;                       // 0x00E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ViewPitchMinOverride;                              // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ViewPitchMaxOverride;                              // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC[0x64];                                      // 0x00EC(0x0064)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ResetToDefaultSettings();

	float GetCustomFocusDistance(class AActor* ViewTarget, const struct FTransform& ViewToWorld) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SPCameraMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SPCameraMode")
	}
	static class USPCameraMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USPCameraMode>();
	}
};
DUMPER7_ASSERTS_USPCameraMode;

// Class SP_Camera.SPCam_AttachedCamera
// 0x0370 (0x04C0 - 0x0150)
class USPCam_AttachedCamera final : public USPCameraMode
{
public:
	struct FDoubleIIRInterpolatorVector           LocInterpolator;                                   // 0x0150(0x0108)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDoubleIIRInterpolatorRotator          RotInterpolator;                                   // 0x0258(0x0108)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bAllowPlayerRotationControl;                       // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDoubleIIRInterpolatorRotator          PlayerControlRotInterpolator;                      // 0x0368(0x0108)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FIIRInterpolatorFloat                  ExtraLocZInterpolator;                             // 0x0470(0x0020)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              PivotPitchLimits;                                  // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              PivotYawLimits;                                    // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       LastViewCameraComponent;                           // 0x04B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UCameraComponent* ChooseViewCameraComponent(class AActor* ViewTarget) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SPCam_AttachedCamera")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SPCam_AttachedCamera")
	}
	static class USPCam_AttachedCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<USPCam_AttachedCamera>();
	}
};
DUMPER7_ASSERTS_USPCam_AttachedCamera;

// Class SP_Camera.SPCam_ThirdPerson
// 0x06F0 (0x0840 - 0x0150)
class USPCam_ThirdPerson final : public USPCameraMode
{
public:
	struct FTransform                             PivotToViewTarget;                                 // 0x0150(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDoubleIIRInterpolatorVector           PivotLocInterpolator;                              // 0x01B0(0x0108)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDoubleIIRInterpolatorRotator          PivotRotInterpolator;                              // 0x02B8(0x0108)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FIIRInterpolatorFloat                  ExtraPivotLocZInterpolator;                        // 0x03C0(0x0020)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              PivotPitchLimits;                                  // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              PivotYawLimits;                                    // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTransform                             CameraToPivot;                                     // 0x0400(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDoubleIIRInterpolatorVector           CameraToPivotTranslationInterpolator;              // 0x0460(0x0108)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UCurveVector*                           CameraToPivot_PitchAdjustmentCurve;                // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraToPivot_PitchAdjustmentCurveScale;           // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           CameraToPivot_SpeedAdjustmentCurve;                // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CameraToPivot_SpeedAdjustmentCurveScale;           // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CameraToPivot_SpeedAdjustment_SpeedRange;          // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECameraAutoFollowMode                         AutoFollowMode;                                    // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              LazyAutoFollowPitchLimits;                         // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowLazyAutoFollowPitchControl;                  // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LazyFollowGoalPitch;                               // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LazyFollowLaziness;                                // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LazyFollowDelayAfterUserControl;                   // 0x05BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C0[0x8];                                      // 0x05C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LookatOffsetLocal;                                 // 0x05C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIIRInterpolatorVector                 LookatWorldSpaceInterpolator;                      // 0x05E0(0x0078)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_658[0x18];                                     // 0x0658(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bUseLookatPoint : 1;                               // 0x0670(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bDoPredictiveLookat : 1;                           // 0x0670(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PredictiveLookatTime;                              // 0x0674(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FPenetrationAvoidanceRay>       CameraPenetrationAvoidanceRays;                    // 0x0678(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPenetrationAvoidanceRay>       SafeLocPenetrationAvoidanceRays;                   // 0x0688(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                SafeLocationOffset;                                // 0x0698(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIIRInterpolatorVector                 SafeLocationInterpolator;                          // 0x06B0(0x0078)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         bValidateSafeLoc : 1;                              // 0x0728(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bPreventCameraPenetration : 1;                     // 0x0728(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bDoPredictiveAvoidance : 1;                        // 0x0728(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_729[0x3];                                      // 0x0729(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PenetrationBlendInTime;                            // 0x072C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PenetrationBlendOutTime;                           // 0x0730(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_734[0x4];                                      // 0x0734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastSafeLocationLocal;                             // 0x0738(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LastPenetrationBlockedPct;                         // 0x0750(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_754[0xE4];                                     // 0x0754(0x00E4)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDrawDebugPivot;                                   // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawDebugLookat;                                  // 0x0839(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawDebugSafeLoc;                                 // 0x083A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawDebugPenetrationAvoidance;                    // 0x083B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_83C[0x4];                                      // 0x083C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SPCam_ThirdPerson")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SPCam_ThirdPerson")
	}
	static class USPCam_ThirdPerson* GetDefaultObj()
	{
		return GetDefaultObjImpl<USPCam_ThirdPerson>();
	}
};
DUMPER7_ASSERTS_USPCam_ThirdPerson;

// Class SP_Camera.SPPlayerCameraManager
// 0x09C0 (0x3680 - 0x2CC0)
class ASPPlayerCameraManager final : public APlayerCameraManager
{
public:
	float                                         BasePelvisRelativeZ;                               // 0x2CB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PelvisBoneName;                                    // 0x2CBC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CC4[0xC];                                     // 0x2CC4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AltViewTarget;                                     // 0x2CD0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CD8[0x8];                                     // 0x2CD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SavedMainViewTarget;                               // 0x2CE0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FActiveSPCamera>                CameraBlendStack;                                  // 0x2CE8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSPCameraModeInstance>          CameraModeInstances;                               // 0x2CF8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D08[0x978];                                   // 0x2D08(0x0978)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearAlternateCamera();
	void ConfigureAlternateCamera(TSubclassOf<class USPCameraMode> NewAltCameraMode, class AActor* NewAltViewTarget, float NewAltCameraTransitionTime);
	class USPCameraMode* GetCurrentCameraMode();
	void ResetViewPitchLimits();
	void SetDebugCameraStyle(EDebugCameraStyle NewDebugCameraStyle);
	void SetUsingAlternateCamera(bool bNewUsingAltCamera);
	void SetViewPitchLimits(float MinPitch, float MaxPitch);
	void SkipBlends();
	void SkipNextInterpolation();
	void StartAmbientCameraShake();
	void StopAmbientCameraShake(bool bImmediate);

	TSubclassOf<class USPCameraMode> GetCameraClassForCharacter(const class AActor* InViewTarget) const;
	bool IsUsingAlternateCamera() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SPPlayerCameraManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SPPlayerCameraManager")
	}
	static class ASPPlayerCameraManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASPPlayerCameraManager>();
	}
};
DUMPER7_ASSERTS_ASPPlayerCameraManager;

}

