#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SP_Camera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SP_Camera.ECameraAutoFollowMode
// NumValues: 0x0004
enum class ECameraAutoFollowMode : uint8
{
	None                                     = 0,
	LazyFollow                               = 1,
	FullFollow                               = 2,
	ECameraAutoFollowMode_MAX                = 3,
};

// Enum SP_Camera.EDebugCameraStyle
// NumValues: 0x0007
enum class EDebugCameraStyle : uint8
{
	None                                     = 0,
	Fixed                                    = 1,
	ThirdPerson                              = 2,
	FreeCam                                  = 3,
	FreeCam_Default                          = 4,
	FirstPerson                              = 5,
	EDebugCameraStyle_MAX                    = 6,
};

// ScriptStruct SP_Camera.PenetrationAvoidanceRay
// 0x0030 (0x0030 - 0x0000)
struct FPenetrationAvoidanceRay final
{
public:
	struct FRotator                               AdjustmentRot;                                     // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         WorldWeight;                                       // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TraceInterval;                                     // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FramesUntilNextTrace;                              // 0x0024(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrimaryRay;                                       // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPenetrationAvoidanceRay;

// ScriptStruct SP_Camera.ActiveSPCamera
// 0x0990 (0x0990 - 0x0000)
struct alignas(0x10) FActiveSPCamera final
{
public:
	class USPCameraMode*                          Camera;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ViewTarget;                                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x980];                                     // 0x0010(0x0980)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActiveSPCamera;

// ScriptStruct SP_Camera.SPCameraModeInstance
// 0x0020 (0x0020 - 0x0000)
struct FSPCameraModeInstance final
{
public:
	TSubclassOf<class USPCameraMode>              CameraModeClass;                                   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ViewTarget;                                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USPCameraMode*                          CameraMode;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCineCameraComponent*                   CineCameraComponent;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSPCameraModeInstance;

}

