#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SP_Interpolators

#include "Basic.hpp"

#include "SP_Interpolators_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SP_Interpolators.SPInterpolatorsBPLibrary.EvalAccelInterpolatorFloat
// 0x003C (0x003C - 0x0000)
struct SPInterpolatorsBPLibrary_EvalAccelInterpolatorFloat final
{
public:
	struct FAccelerationInterpolatorFloat         Interpolator;                                      // 0x0000(0x0030)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         NewGoal;                                           // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_EvalAccelInterpolatorFloat;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.EvalAccelInterpolatorRotator
// 0x0090 (0x0090 - 0x0000)
struct SPInterpolatorsBPLibrary_EvalAccelInterpolatorRotator final
{
public:
	struct FAccelerationInterpolatorRotator       Interpolator;                                      // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               NewGoal;                                           // 0x0058(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x0078(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_EvalAccelInterpolatorRotator;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.EvalAccelInterpolatorVector
// 0x0090 (0x0090 - 0x0000)
struct SPInterpolatorsBPLibrary_EvalAccelInterpolatorVector final
{
public:
	struct FAccelerationInterpolatorVector        Interpolator;                                      // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                NewGoal;                                           // 0x0058(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0078(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_EvalAccelInterpolatorVector;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.EvalCritDampedSpringInterpolatorRotator
// 0x00E0 (0x00E0 - 0x0000)
struct SPInterpolatorsBPLibrary_EvalCritDampedSpringInterpolatorRotator final
{
public:
	struct FCritDampSpringInterpolatorRotator     Interpolator;                                      // 0x0000(0x00A8)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               NewGoal;                                           // 0x00A8(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x00C0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x00C8(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_EvalCritDampedSpringInterpolatorRotator;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.EvalCritDampedSpringInterpolatorVector
// 0x00E0 (0x00E0 - 0x0000)
struct SPInterpolatorsBPLibrary_EvalCritDampedSpringInterpolatorVector final
{
public:
	struct FCritDampSpringInterpolatorVector      Interpolator;                                      // 0x0000(0x00A8)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                NewGoal;                                           // 0x00A8(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x00C0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x00C8(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_EvalCritDampedSpringInterpolatorVector;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.EvalDoubleIIRInterpolatorFloat
// 0x0058 (0x0058 - 0x0000)
struct SPInterpolatorsBPLibrary_EvalDoubleIIRInterpolatorFloat final
{
public:
	struct FDoubleIIRInterpolatorFloat            Interpolator;                                      // 0x0000(0x004C)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         NewGoal;                                           // 0x004C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0054(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_EvalDoubleIIRInterpolatorFloat;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.EvalDoubleIIRInterpolatorRotator
// 0x0140 (0x0140 - 0x0000)
struct SPInterpolatorsBPLibrary_EvalDoubleIIRInterpolatorRotator final
{
public:
	struct FDoubleIIRInterpolatorRotator          Interpolator;                                      // 0x0000(0x0108)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               NewGoal;                                           // 0x0108(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0120(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x0128(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_EvalDoubleIIRInterpolatorRotator;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.EvalDoubleIIRInterpolatorVector
// 0x0140 (0x0140 - 0x0000)
struct SPInterpolatorsBPLibrary_EvalDoubleIIRInterpolatorVector final
{
public:
	struct FDoubleIIRInterpolatorVector           Interpolator;                                      // 0x0000(0x0108)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                NewGoal;                                           // 0x0108(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0120(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0128(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_EvalDoubleIIRInterpolatorVector;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.EvalIIRInterpolatorFloat
// 0x002C (0x002C - 0x0000)
struct SPInterpolatorsBPLibrary_EvalIIRInterpolatorFloat final
{
public:
	struct FIIRInterpolatorFloat                  Interpolator;                                      // 0x0000(0x0020)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         NewGoal;                                           // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_EvalIIRInterpolatorFloat;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.EvalIIRInterpolatorRotator
// 0x00B0 (0x00B0 - 0x0000)
struct SPInterpolatorsBPLibrary_EvalIIRInterpolatorRotator final
{
public:
	struct FIIRInterpolatorRotator                Interpolator;                                      // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               NewGoal;                                           // 0x0078(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0090(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x0098(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_EvalIIRInterpolatorRotator;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.EvalIIRInterpolatorVector
// 0x00B0 (0x00B0 - 0x0000)
struct SPInterpolatorsBPLibrary_EvalIIRInterpolatorVector final
{
public:
	struct FIIRInterpolatorVector                 Interpolator;                                      // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                NewGoal;                                           // 0x0078(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0090(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0098(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_EvalIIRInterpolatorVector;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.ResetAccelInterpolatorFloat
// 0x0030 (0x0030 - 0x0000)
struct SPInterpolatorsBPLibrary_ResetAccelInterpolatorFloat final
{
public:
	struct FAccelerationInterpolatorFloat         Interpolator;                                      // 0x0000(0x0030)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_ResetAccelInterpolatorFloat;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.ResetAccelInterpolatorRotator
// 0x0058 (0x0058 - 0x0000)
struct SPInterpolatorsBPLibrary_ResetAccelInterpolatorRotator final
{
public:
	struct FAccelerationInterpolatorRotator       Interpolator;                                      // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_ResetAccelInterpolatorRotator;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.ResetAccelInterpolatorVector
// 0x0058 (0x0058 - 0x0000)
struct SPInterpolatorsBPLibrary_ResetAccelInterpolatorVector final
{
public:
	struct FAccelerationInterpolatorVector        Interpolator;                                      // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_ResetAccelInterpolatorVector;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.ResetCritDampedSpringInterpolatorRotator
// 0x00A8 (0x00A8 - 0x0000)
struct SPInterpolatorsBPLibrary_ResetCritDampedSpringInterpolatorRotator final
{
public:
	struct FCritDampSpringInterpolatorRotator     Interpolator;                                      // 0x0000(0x00A8)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_ResetCritDampedSpringInterpolatorRotator;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.ResetCritDampedSpringInterpolatorVector
// 0x00A8 (0x00A8 - 0x0000)
struct SPInterpolatorsBPLibrary_ResetCritDampedSpringInterpolatorVector final
{
public:
	struct FCritDampSpringInterpolatorVector      Interpolator;                                      // 0x0000(0x00A8)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_ResetCritDampedSpringInterpolatorVector;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.ResetDoubleIIRInterpolatorFloat
// 0x004C (0x004C - 0x0000)
struct SPInterpolatorsBPLibrary_ResetDoubleIIRInterpolatorFloat final
{
public:
	struct FDoubleIIRInterpolatorFloat            Interpolator;                                      // 0x0000(0x004C)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_ResetDoubleIIRInterpolatorFloat;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.ResetDoubleIIRInterpolatorRotator
// 0x0108 (0x0108 - 0x0000)
struct SPInterpolatorsBPLibrary_ResetDoubleIIRInterpolatorRotator final
{
public:
	struct FDoubleIIRInterpolatorRotator          Interpolator;                                      // 0x0000(0x0108)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_ResetDoubleIIRInterpolatorRotator;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.ResetDoubleIIRInterpolatorVector
// 0x0108 (0x0108 - 0x0000)
struct SPInterpolatorsBPLibrary_ResetDoubleIIRInterpolatorVector final
{
public:
	struct FDoubleIIRInterpolatorVector           Interpolator;                                      // 0x0000(0x0108)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_ResetDoubleIIRInterpolatorVector;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.ResetIIRInterpolatorFloat
// 0x0020 (0x0020 - 0x0000)
struct SPInterpolatorsBPLibrary_ResetIIRInterpolatorFloat final
{
public:
	struct FIIRInterpolatorFloat                  Interpolator;                                      // 0x0000(0x0020)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_ResetIIRInterpolatorFloat;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.ResetIIRInterpolatorRotator
// 0x0078 (0x0078 - 0x0000)
struct SPInterpolatorsBPLibrary_ResetIIRInterpolatorRotator final
{
public:
	struct FIIRInterpolatorRotator                Interpolator;                                      // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_ResetIIRInterpolatorRotator;

// Function SP_Interpolators.SPInterpolatorsBPLibrary.ResetIIRInterpolatorVector
// 0x0078 (0x0078 - 0x0000)
struct SPInterpolatorsBPLibrary_ResetIIRInterpolatorVector final
{
public:
	struct FIIRInterpolatorVector                 Interpolator;                                      // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SPInterpolatorsBPLibrary_ResetIIRInterpolatorVector;

}

