#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SP_Interpolators

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct SP_Interpolators.IIRInterpolatorVector
// 0x0078 (0x0078 - 0x0000)
struct alignas(0x08) FIIRInterpolatorVector final
{
public:
	float                                         InterpSpeed;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x74];                                       // 0x0004(0x0074)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIIRInterpolatorVector;

// ScriptStruct SP_Interpolators.DoubleIIRInterpolatorVector
// 0x0108 (0x0108 - 0x0000)
struct alignas(0x08) FDoubleIIRInterpolatorVector final
{
public:
	float                                         PrimaryInterpSpeed;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntermediateInterpSpeed;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x100];                                      // 0x0008(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDoubleIIRInterpolatorVector;

// ScriptStruct SP_Interpolators.IIRInterpolatorRotator
// 0x0078 (0x0078 - 0x0000)
struct alignas(0x08) FIIRInterpolatorRotator final
{
public:
	float                                         InterpSpeed;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x74];                                       // 0x0004(0x0074)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIIRInterpolatorRotator;

// ScriptStruct SP_Interpolators.DoubleIIRInterpolatorRotator
// 0x0108 (0x0108 - 0x0000)
struct alignas(0x08) FDoubleIIRInterpolatorRotator final
{
public:
	float                                         PrimaryInterpSpeed;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntermediateInterpSpeed;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x100];                                      // 0x0008(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDoubleIIRInterpolatorRotator;

// ScriptStruct SP_Interpolators.IIRInterpolatorFloat
// 0x0020 (0x0020 - 0x0000)
struct FIIRInterpolatorFloat final
{
public:
	float                                         InterpSpeed;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x1C];                                       // 0x0004(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIIRInterpolatorFloat;

// ScriptStruct SP_Interpolators.DoubleIIRInterpolatorFloat
// 0x004C (0x004C - 0x0000)
struct FDoubleIIRInterpolatorFloat final
{
public:
	float                                         PrimaryInterpSpeed;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntermediateInterpSpeed;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x44];                                       // 0x0008(0x0044)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDoubleIIRInterpolatorFloat;

// ScriptStruct SP_Interpolators.AccelerationInterpolatorParams
// 0x0010 (0x0010 - 0x0000)
struct FAccelerationInterpolatorParams final
{
public:
	float                                         Acceleration;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDeceleration;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HoldTolerance;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAccelerationInterpolatorParams;

// ScriptStruct SP_Interpolators.AccelerationInterpolatorFloat
// 0x0030 (0x0030 - 0x0000)
struct FAccelerationInterpolatorFloat final
{
public:
	struct FAccelerationInterpolatorParams        AccelerationParams;                                // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x20];                                      // 0x0010(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAccelerationInterpolatorFloat;

// ScriptStruct SP_Interpolators.AccelerationInterpolatorVector
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FAccelerationInterpolatorVector final
{
public:
	struct FAccelerationInterpolatorParams        AccelerationParams;                                // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x48];                                      // 0x0010(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAccelerationInterpolatorVector;

// ScriptStruct SP_Interpolators.AccelerationInterpolatorRotator
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FAccelerationInterpolatorRotator final
{
public:
	struct FAccelerationInterpolatorParams        AccelerationParams;                                // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x48];                                      // 0x0010(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAccelerationInterpolatorRotator;

// ScriptStruct SP_Interpolators.CritDampSpringInterpolatorVector
// 0x00A8 (0x00A8 - 0x0000)
struct alignas(0x08) FCritDampSpringInterpolatorVector final
{
public:
	float                                         NaturalFrequency;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xA4];                                       // 0x0004(0x00A4)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCritDampSpringInterpolatorVector;

// ScriptStruct SP_Interpolators.CritDampSpringInterpolatorRotator
// 0x00A8 (0x00A8 - 0x0000)
struct alignas(0x08) FCritDampSpringInterpolatorRotator final
{
public:
	float                                         NaturalFrequency;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xA4];                                       // 0x0004(0x00A4)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCritDampSpringInterpolatorRotator;

}

