#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateTreeModule

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function StateTreeModule.StateTreeNodeBlueprintBase.RequestTransition
// 0x0004 (0x0004 - 0x0000)
struct StateTreeNodeBlueprintBase_RequestTransition final
{
public:
	struct FStateTreeStateLink                    TargetState;                                       // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EStateTreeTransitionPriority                  Priority;                                          // 0x0002(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StateTreeNodeBlueprintBase_RequestTransition;

// Function StateTreeModule.StateTreeNodeBlueprintBase.SendEvent
// 0x0020 (0x0020 - 0x0000)
struct StateTreeNodeBlueprintBase_SendEvent final
{
public:
	struct FStateTreeEvent                        Event;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeNodeBlueprintBase_SendEvent;

// Function StateTreeModule.StateTreeNodeBlueprintBase.GetPropertyDescriptionByPropertyName
// 0x0018 (0x0018 - 0x0000)
struct StateTreeNodeBlueprintBase_GetPropertyDescriptionByPropertyName final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeNodeBlueprintBase_GetPropertyDescriptionByPropertyName;

// Function StateTreeModule.StateTreeNodeBlueprintBase.GetPropertyReference
// 0x0010 (0x0010 - 0x0000)
struct StateTreeNodeBlueprintBase_GetPropertyReference final
{
public:
	struct FStateTreeBlueprintPropertyRef         PropertyRef;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeNodeBlueprintBase_GetPropertyReference;

// Function StateTreeModule.StateTreeNodeBlueprintBase.IsPropertyRefValid
// 0x0018 (0x0018 - 0x0000)
struct StateTreeNodeBlueprintBase_IsPropertyRefValid final
{
public:
	struct FStateTreeBlueprintPropertyRef         PropertyRef;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StateTreeNodeBlueprintBase_IsPropertyRefValid;

// Function StateTreeModule.StateTreeNodeBlueprintBase.ReceiveGetDescription
// 0x0018 (0x0018 - 0x0000)
struct StateTreeNodeBlueprintBase_ReceiveGetDescription final
{
public:
	EStateTreeNodeFormatting                      Formatting;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeNodeBlueprintBase_ReceiveGetDescription;

// Function StateTreeModule.StateTreeConditionBlueprintBase.ReceiveTestCondition
// 0x0001 (0x0001 - 0x0000)
struct StateTreeConditionBlueprintBase_ReceiveTestCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeConditionBlueprintBase_ReceiveTestCondition;

// Function StateTreeModule.StateTreeConsiderationBlueprintBase.ReceiveGetScore
// 0x0004 (0x0004 - 0x0000)
struct StateTreeConsiderationBlueprintBase_ReceiveGetScore final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeConsiderationBlueprintBase_ReceiveGetScore;

// Function StateTreeModule.StateTreeEvaluatorBlueprintBase.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct StateTreeEvaluatorBlueprintBase_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeEvaluatorBlueprintBase_ReceiveTick;

// Function StateTreeModule.StateTreeTaskBlueprintBase.FinishTask
// 0x0001 (0x0001 - 0x0000)
struct StateTreeTaskBlueprintBase_FinishTask final
{
public:
	bool                                          bSucceeded;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeTaskBlueprintBase_FinishTask;

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveEnterState
// 0x0048 (0x0048 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EStateTreeRunStatus                           ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StateTreeTaskBlueprintBase_ReceiveEnterState;

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveExitState
// 0x0040 (0x0040 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveExitState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeTaskBlueprintBase_ReceiveExitState;

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveLatentEnterState
// 0x0040 (0x0040 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveLatentEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeTaskBlueprintBase_ReceiveLatentEnterState;

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveLatentTick
// 0x0004 (0x0004 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveLatentTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeTaskBlueprintBase_ReceiveLatentTick;

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveStateCompleted
// 0x0014 (0x0014 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveStateCompleted final
{
public:
	EStateTreeRunStatus                           CompletionStatus;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeActiveStates                 CompletedActiveStates;                             // 0x0002(0x0012)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StateTreeTaskBlueprintBase_ReceiveStateCompleted;

// Function StateTreeModule.StateTreeTaskBlueprintBase.ReceiveTick
// 0x0008 (0x0008 - 0x0000)
struct StateTreeTaskBlueprintBase_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeRunStatus                           ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StateTreeTaskBlueprintBase_ReceiveTick;

}

