#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateTreeModule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// Enum StateTreeModule.EStateTreeBreakpointType
// NumValues: 0x0005
enum class EStateTreeBreakpointType : uint8
{
	Unset                                    = 0,
	OnEnter                                  = 1,
	OnExit                                   = 2,
	OnTransition                             = 3,
	EStateTreeBreakpointType_MAX             = 4,
};

// Enum StateTreeModule.EStateTreeUpdatePhase
// NumValues: 0x0012
enum class EStateTreeUpdatePhase : uint8
{
	Unset                                    = 0,
	StartTree                                = 1,
	StopTree                                 = 2,
	StartGlobalTasks                         = 3,
	StopGlobalTasks                          = 4,
	TickStateTree                            = 5,
	ApplyTransitions                         = 6,
	TriggerTransitions                       = 7,
	TickingGlobalTasks                       = 8,
	TickingTasks                             = 9,
	TransitionConditions                     = 10,
	StateSelection                           = 11,
	TrySelectBehavior                        = 12,
	EnterConditions                          = 13,
	EnterStates                              = 14,
	ExitStates                               = 15,
	StateCompleted                           = 16,
	EStateTreeUpdatePhase_MAX                = 17,
};

// Enum StateTreeModule.EStateTreeRunStatus
// NumValues: 0x0006
enum class EStateTreeRunStatus : uint8
{
	Running                                  = 0,
	Failed                                   = 1,
	Succeeded                                = 2,
	Stopped                                  = 3,
	Unset                                    = 4,
	EStateTreeRunStatus_MAX                  = 5,
};

// Enum StateTreeModule.EStateTreeStateChangeType
// NumValues: 0x0004
enum class EStateTreeStateChangeType : uint8
{
	None                                     = 0,
	Changed                                  = 1,
	Sustained                                = 2,
	EStateTreeStateChangeType_MAX            = 3,
};

// Enum StateTreeModule.EStateTreeConditionEvaluationMode
// NumValues: 0x0004
enum class EStateTreeConditionEvaluationMode : uint8
{
	Evaluated                                = 0,
	ForcedTrue                               = 1,
	ForcedFalse                              = 2,
	EStateTreeConditionEvaluationMode_MAX    = 3,
};

// Enum StateTreeModule.EStateTreeTransitionSourceType
// NumValues: 0x0005
enum class EStateTreeTransitionSourceType : uint8
{
	Unset                                    = 0,
	Asset                                    = 1,
	ExternalRequest                          = 2,
	Internal                                 = 3,
	EStateTreeTransitionSourceType_MAX       = 4,
};

// Enum StateTreeModule.EStateTreeRecordTransitions
// NumValues: 0x0003
enum class EStateTreeRecordTransitions : uint8
{
	No                                       = 0,
	Yes                                      = 1,
	EStateTreeRecordTransitions_MAX          = 2,
};

// Enum StateTreeModule.EStateTreeLinkerStatus
// NumValues: 0x0003
enum class EStateTreeLinkerStatus : uint8
{
	Succeeded                                = 0,
	Failed                                   = 1,
	EStateTreeLinkerStatus_MAX               = 2,
};

// Enum StateTreeModule.EStateTreeNodeFormatting
// NumValues: 0x0003
enum class EStateTreeNodeFormatting : uint8
{
	RichText                                 = 0,
	Text                                     = 1,
	EStateTreeNodeFormatting_MAX             = 2,
};

// Enum StateTreeModule.EStateTreePropertyRefType
// NumValues: 0x0011
enum class EStateTreePropertyRefType : uint8
{
	None                                     = 0,
	Bool                                     = 1,
	Byte                                     = 2,
	Int32                                    = 3,
	Int64                                    = 4,
	Float                                    = 5,
	Double                                   = 6,
	Name                                     = 7,
	String                                   = 8,
	Text                                     = 9,
	Enum                                     = 10,
	Struct                                   = 11,
	Object                                   = 12,
	SoftObject                               = 13,
	Class                                    = 14,
	SoftClass                                = 15,
	EStateTreePropertyRefType_MAX            = 16,
};

// Enum StateTreeModule.EStateTreeTraceStatus
// NumValues: 0x0004
enum class EStateTreeTraceStatus : uint8
{
	TracesStarted                            = 0,
	StoppingTrace                            = 1,
	TracesStopped                            = 2,
	EStateTreeTraceStatus_MAX                = 3,
};

// Enum StateTreeModule.EStateTreeTraceEventType
// NumValues: 0x0016
enum class EStateTreeTraceEventType : uint8
{
	Unset                                    = 0,
	OnEntering                               = 1,
	OnEntered                                = 2,
	OnExiting                                = 3,
	OnExited                                 = 4,
	Push                                     = 5,
	Pop                                      = 6,
	OnStateSelected                          = 7,
	OnStateCompleted                         = 8,
	OnTicking                                = 9,
	OnTaskCompleted                          = 10,
	OnTicked                                 = 11,
	Passed                                   = 12,
	Failed                                   = 13,
	ForcedSuccess                            = 14,
	ForcedFailure                            = 15,
	InternalForcedFailure                    = 16,
	OnEvaluating                             = 17,
	OnTransition                             = 18,
	OnTreeStarted                            = 19,
	OnTreeStopped                            = 20,
	EStateTreeTraceEventType_MAX             = 21,
};

// Enum StateTreeModule.EStateTreeBlueprintPropertyCategory
// NumValues: 0x0006
enum class EStateTreeBlueprintPropertyCategory : uint8
{
	NotSet                                   = 0,
	Input                                    = 1,
	Parameter                                = 2,
	Output                                   = 3,
	ContextObject                            = 4,
	EStateTreeBlueprintPropertyCategory_MAX  = 5,
};

// Enum StateTreeModule.EStateTreeLoopEvents
// NumValues: 0x0004
enum class EStateTreeLoopEvents : uint8
{
	Next                                     = 0,
	Break                                    = 1,
	Consume                                  = 2,
	EStateTreeLoopEvents_MAX                 = 3,
};

// Enum StateTreeModule.EStateTreeBindableStructSource
// NumValues: 0x000C
enum class EStateTreeBindableStructSource : uint8
{
	Context                                  = 0,
	Parameter                                = 1,
	Evaluator                                = 2,
	GlobalTask                               = 3,
	StateParameter                           = 4,
	Task                                     = 5,
	Condition                                = 6,
	Consideration                            = 7,
	TransitionEvent                          = 8,
	StateEvent                               = 9,
	PropertyFunction                         = 10,
	EStateTreeBindableStructSource_MAX       = 11,
};

// Enum StateTreeModule.EStateTreePropertyAccessType
// NumValues: 0x0008
enum class EStateTreePropertyAccessType : uint8
{
	Offset                                   = 0,
	Object                                   = 1,
	WeakObject                               = 2,
	SoftObject                               = 3,
	ObjectInstance                           = 4,
	StructInstance                           = 5,
	IndexArray                               = 6,
	EStateTreePropertyAccessType_MAX         = 7,
};

// Enum StateTreeModule.EStateTreePropertyCopyType
// NumValues: 0x0021
enum class EStateTreePropertyCopyType : uint8
{
	None                                     = 0,
	CopyPlain                                = 1,
	CopyComplex                              = 2,
	CopyBool                                 = 3,
	CopyStruct                               = 4,
	CopyObject                               = 5,
	CopyName                                 = 6,
	CopyFixedArray                           = 7,
	StructReference                          = 8,
	PromoteBoolToByte                        = 9,
	PromoteBoolToInt32                       = 10,
	PromoteBoolToUInt32                      = 11,
	PromoteBoolToInt64                       = 12,
	PromoteBoolToFloat                       = 13,
	PromoteBoolToDouble                      = 14,
	PromoteByteToInt32                       = 15,
	PromoteByteToUInt32                      = 16,
	PromoteByteToInt64                       = 17,
	PromoteByteToFloat                       = 18,
	PromoteByteToDouble                      = 19,
	PromoteInt32ToInt64                      = 20,
	PromoteInt32ToFloat                      = 21,
	PromoteInt32ToDouble                     = 22,
	PromoteUInt32ToInt64                     = 23,
	PromoteUInt32ToFloat                     = 24,
	PromoteUInt32ToDouble                    = 25,
	PromoteFloatToInt32                      = 26,
	PromoteFloatToInt64                      = 27,
	PromoteFloatToDouble                     = 28,
	DemoteDoubleToInt32                      = 29,
	DemoteDoubleToInt64                      = 30,
	DemoteDoubleToFloat                      = 31,
	EStateTreePropertyCopyType_MAX           = 32,
};

// Enum StateTreeModule.EStateTreeTransitionType
// NumValues: 0x0008
enum class EStateTreeTransitionType : uint8
{
	None                                     = 0,
	Succeeded                                = 1,
	Failed                                   = 2,
	GotoState                                = 3,
	NextState                                = 4,
	NextSelectableState                      = 5,
	NotSet                                   = 6,
	EStateTreeTransitionType_MAX             = 7,
};

// Enum StateTreeModule.EStateTreeExpressionOperand
// NumValues: 0x0004
enum class EStateTreeExpressionOperand : uint8
{
	Copy                                     = 0,
	And                                      = 1,
	Or                                       = 2,
	EStateTreeExpressionOperand_MAX          = 3,
};

// Enum StateTreeModule.EStateTreeStateType
// NumValues: 0x0006
enum class EStateTreeStateType : uint8
{
	State                                    = 0,
	Group                                    = 1,
	Linked                                   = 2,
	LinkedAsset                              = 3,
	Subtree                                  = 4,
	EStateTreeStateType_MAX                  = 5,
};

// Enum StateTreeModule.EStateTreeStateSelectionBehavior
// NumValues: 0x000A
enum class EStateTreeStateSelectionBehavior : uint8
{
	None                                     = 0,
	TryEnterState                            = 1,
	TrySelectChildrenInOrder                 = 2,
	TrySelectChildrenAtRandom                = 3,
	TrySelectChildrenWithHighestUtility      = 4,
	TrySelectChildrenAtRandomWeightedByUtility = 5,
	TryFollowTransitions                     = 6,
	TrySelectChildrenAtUniformRandom         = 3,
	TrySelectChildrenBasedOnRelativeUtility  = 5,
	EStateTreeStateSelectionBehavior_MAX     = 7,
};

// Enum StateTreeModule.EStateTreeTransitionTrigger
// NumValues: 0x0007
enum class EStateTreeTransitionTrigger : uint8
{
	None                                     = 0,
	OnStateCompleted                         = 3,
	OnStateSucceeded                         = 1,
	OnStateFailed                            = 2,
	OnTick                                   = 4,
	OnEvent                                  = 8,
	MAX                                      = 9,
};

// Enum StateTreeModule.EStateTreeTransitionPriority
// NumValues: 0x0007
enum class EStateTreeTransitionPriority : uint8
{
	None                                     = 0,
	Low                                      = 1,
	Normal                                   = 2,
	Medium                                   = 3,
	High                                     = 4,
	Critical                                 = 5,
	EStateTreeTransitionPriority_MAX         = 6,
};

// Enum StateTreeModule.EStateTreeDataSourceType
// NumValues: 0x000F
enum class EStateTreeDataSourceType : uint8
{
	None                                     = 0,
	GlobalInstanceData                       = 1,
	GlobalInstanceDataObject                 = 2,
	ActiveInstanceData                       = 3,
	ActiveInstanceDataObject                 = 4,
	SharedInstanceData                       = 5,
	SharedInstanceDataObject                 = 6,
	ContextData                              = 7,
	ExternalData                             = 8,
	GlobalParameterData                      = 9,
	SubtreeParameterData                     = 10,
	StateParameterData                       = 11,
	TransitionEvent                          = 12,
	StateEvent                               = 13,
	EStateTreeDataSourceType_MAX             = 14,
};

// Enum StateTreeModule.EStateTreeSelectionFallback
// NumValues: 0x0003
enum class EStateTreeSelectionFallback : uint8
{
	None                                     = 0,
	NextSelectableSibling                    = 1,
	EStateTreeSelectionFallback_MAX          = 2,
};

// Enum StateTreeModule.EStateTreeExternalDataRequirement
// NumValues: 0x0003
enum class EStateTreeExternalDataRequirement : uint8
{
	Required                                 = 0,
	Optional                                 = 1,
	EStateTreeExternalDataRequirement_MAX    = 2,
};

// Enum StateTreeModule.EStateTreePropertyUsage
// NumValues: 0x0006
enum class EStateTreePropertyUsage : uint8
{
	Invalid                                  = 0,
	Context                                  = 1,
	Input                                    = 2,
	Parameter                                = 3,
	Output                                   = 4,
	EStateTreePropertyUsage_MAX              = 5,
};

// ScriptStruct StateTreeModule.StateTreeIndex16
// 0x0002 (0x0002 - 0x0000)
struct FStateTreeIndex16 final
{
public:
	uint16                                        Value;                                             // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FStateTreeIndex16;

// ScriptStruct StateTreeModule.StateTreeStateHandle
// 0x0002 (0x0002 - 0x0000)
struct FStateTreeStateHandle final
{
public:
	uint16                                        Index;                                             // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeStateHandle;

// ScriptStruct StateTreeModule.StateTreeDataHandle
// 0x0006 (0x0006 - 0x0000)
struct FStateTreeDataHandle final
{
public:
	EStateTreeDataSourceType                      Source;                                            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        Index;                                             // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FStateTreeStateHandle                  StateHandle;                                       // 0x0004(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FStateTreeDataHandle;

// ScriptStruct StateTreeModule.StateTreeNodeBase
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FStateTreeNodeBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      BindingsBatch;                                     // 0x0010(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      InstanceTemplateIndex;                             // 0x0012(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeDataHandle                   InstanceDataHandle;                                // 0x0014(0x0006)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeNodeBase;

// ScriptStruct StateTreeModule.StateTreeEvaluatorBase
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeEvaluatorBase : public FStateTreeNodeBase
{
};
DUMPER7_ASSERTS_FStateTreeEvaluatorBase;

// ScriptStruct StateTreeModule.StateTreeNodeIdToIndex
// 0x0014 (0x0014 - 0x0000)
struct FStateTreeNodeIdToIndex final
{
public:
	struct FGuid                                  ID;                                                // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      Index;                                             // 0x0010(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeNodeIdToIndex;

// ScriptStruct StateTreeModule.StateTreeAnyEnum
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeAnyEnum final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnum*                                  Enum;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FStateTreeAnyEnum;

// ScriptStruct StateTreeModule.StateTreeBooleanOperationPropertyFunctionInstanceData
// 0x0003 (0x0003 - 0x0000)
struct FStateTreeBooleanOperationPropertyFunctionInstanceData final
{
public:
	bool                                          bLeft;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRight;                                            // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResult;                                           // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeBooleanOperationPropertyFunctionInstanceData;

// ScriptStruct StateTreeModule.StateTreeTaskBase
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeTaskBase : public FStateTreeNodeBase
{
public:
	uint8                                         BitPad_20_0 : 6;                                   // 0x0020(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bTaskEnabled : 1;                                  // 0x0020(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EStateTreeTransitionPriority                  TransitionHandlingPriority;                        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeTaskBase;

// ScriptStruct StateTreeModule.StateTreeTaskCommonBase
// 0x0000 (0x0028 - 0x0028)
struct FStateTreeTaskCommonBase : public FStateTreeTaskBase
{
};
DUMPER7_ASSERTS_FStateTreeTaskCommonBase;

// ScriptStruct StateTreeModule.StateTreeRandomTimeDuration
// 0x0004 (0x0004 - 0x0000)
struct FStateTreeRandomTimeDuration final
{
public:
	uint16                                        Duration;                                          // 0x0000(0x0002)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint16                                        RandomVariance;                                    // 0x0002(0x0002)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FStateTreeRandomTimeDuration;

// ScriptStruct StateTreeModule.StateTreeConditionBase
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeConditionBase : public FStateTreeNodeBase
{
public:
	EStateTreeExpressionOperand                   Operand;                                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          DeltaIndent;                                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeConditionEvaluationMode             EvaluationMode;                                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeConditionBase;

// ScriptStruct StateTreeModule.StateTreeConditionCommonBase
// 0x0000 (0x0028 - 0x0028)
struct FStateTreeConditionCommonBase : public FStateTreeConditionBase
{
};
DUMPER7_ASSERTS_FStateTreeConditionCommonBase;

// ScriptStruct StateTreeModule.StateTreePropertyFunctionBase
// 0x0000 (0x0020 - 0x0020)
struct FStateTreePropertyFunctionBase : public FStateTreeNodeBase
{
};
DUMPER7_ASSERTS_FStateTreePropertyFunctionBase;

// ScriptStruct StateTreeModule.StateTreePropertyFunctionCommonBase
// 0x0000 (0x0020 - 0x0020)
struct FStateTreePropertyFunctionCommonBase : public FStateTreePropertyFunctionBase
{
};
DUMPER7_ASSERTS_FStateTreePropertyFunctionCommonBase;

// ScriptStruct StateTreeModule.StateTreeCompareBoolConditionInstanceData
// 0x0002 (0x0002 - 0x0000)
struct FStateTreeCompareBoolConditionInstanceData final
{
public:
	bool                                          bLeft;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRight;                                            // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeCompareBoolConditionInstanceData;

// ScriptStruct StateTreeModule.StateTreeBooleanAndPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeBooleanAndPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeBooleanAndPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeBooleanOrPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeBooleanOrPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeBooleanOrPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeBooleanXOrPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeBooleanXOrPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeBooleanXOrPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeBlueprintTaskWrapper
// 0x0008 (0x0030 - 0x0028)
struct FStateTreeBlueprintTaskWrapper final : public FStateTreeTaskBase
{
public:
	TSubclassOf<class UStateTreeTaskBlueprintBase> TaskClass;                                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeBlueprintTaskWrapper;

// ScriptStruct StateTreeModule.StateTreeBooleanNotOperationPropertyFunctionInstanceData
// 0x0002 (0x0002 - 0x0000)
struct FStateTreeBooleanNotOperationPropertyFunctionInstanceData final
{
public:
	bool                                          bInput;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResult;                                           // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeBooleanNotOperationPropertyFunctionInstanceData;

// ScriptStruct StateTreeModule.StateTreeBooleanNotPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeBooleanNotPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeBooleanNotPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeExternalDataHandle
// 0x0006 (0x0006 - 0x0000)
struct FStateTreeExternalDataHandle final
{
public:
	struct FStateTreeDataHandle                   DataHandle;                                        // 0x0000(0x0006)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeExternalDataHandle;

// ScriptStruct StateTreeModule.StateTreeExternalDataDesc
// 0x0018 (0x0018 - 0x0000)
struct FStateTreeExternalDataDesc final
{
public:
	class UStruct*                                Struct;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class FName                                   Name;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeExternalDataHandle           Handle;                                            // 0x0010(0x0006)(NoDestructor, NativeAccessSpecifierPublic)
	EStateTreeExternalDataRequirement             Requirement;                                       // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeExternalDataDesc;

// ScriptStruct StateTreeModule.StateTreeTransitionRequest
// 0x0018 (0x0018 - 0x0000)
struct FStateTreeTransitionRequest final
{
public:
	struct FStateTreeStateHandle                  SourceState;                                       // 0x0000(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateTree*                             SourceStateTree;                                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FStateTreeStateHandle                  SourceRootState;                                   // 0x0010(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  TargetState;                                       // 0x0012(0x0002)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeTransitionPriority                  Priority;                                          // 0x0014(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeTransitionRequest;

// ScriptStruct StateTreeModule.StateTreeActiveStates
// 0x0012 (0x0012 - 0x0000)
struct FStateTreeActiveStates final
{
public:
	struct FStateTreeStateHandle                  States[0x8];                                       // 0x0000(0x0002)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumStates;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x1];                                       // 0x0011(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeActiveStates;

// ScriptStruct StateTreeModule.StateTreeTransitionSource
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x02) FStateTreeTransitionSource final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeTransitionSource;

// ScriptStruct StateTreeModule.StateTreeSharedEvent
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FStateTreeSharedEvent final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeSharedEvent;

// ScriptStruct StateTreeModule.StateTreeTransitionDelayedState
// 0x0028 (0x0028 - 0x0000)
struct FStateTreeTransitionDelayedState final
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FStateTreeIndex16                      TransitionIndex;                                   // 0x0008(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeLeft;                                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeSharedEvent                  CapturedEvent;                                     // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	uint32                                        CapturedEventHash;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeTransitionDelayedState;

// ScriptStruct StateTreeModule.StateTreeExecutionFrame
// 0x0030 (0x0030 - 0x0000)
struct FStateTreeExecutionFrame final
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FStateTreeStateHandle                  RootState;                                         // 0x0008(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeActiveStates                 ActiveStates;                                      // 0x000A(0x0012)(NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      ExternalDataBaseIndex;                             // 0x001C(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      GlobalInstanceIndexBase;                           // 0x001E(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      ActiveInstanceIndexBase;                           // 0x0020(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeDataHandle                   StateParameterDataHandle;                          // 0x0022(0x0006)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeDataHandle                   GlobalParameterDataHandle;                         // 0x0028(0x0006)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x1];                                       // 0x002E(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bIsGlobalFrame : 1;                                // 0x002F(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
};
DUMPER7_ASSERTS_FStateTreeExecutionFrame;

// ScriptStruct StateTreeModule.StateTreeExecutionState
// 0x0038 (0x0038 - 0x0000)
struct FStateTreeExecutionState final
{
public:
	TArray<struct FStateTreeExecutionFrame>       ActiveFrames;                                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FStateTreeTransitionDelayedState> DelayedTransitions;                              // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      EnterStateFailedFrameIndex;                        // 0x0020(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      EnterStateFailedTaskIndex;                         // 0x0022(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeRunStatus                           LastTickStatus;                                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeRunStatus                           TreeRunStatus;                                     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeRunStatus                           RequestedStop;                                     // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeUpdatePhase                         CurrentPhase;                                      // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeIndex16                      CompletedFrameIndex;                               // 0x0028(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  CompletedStateHandle;                              // 0x002A(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        StateChangeCount;                                  // 0x002C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          RandomStream;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeExecutionState;

// ScriptStruct StateTreeModule.StateTreeTransitionResult
// 0x0040 (0x0040 - 0x0000)
struct FStateTreeTransitionResult final
{
public:
	TArray<struct FStateTreeExecutionFrame>       NextActiveFrames;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EStateTreeRunStatus                           CurrentRunStatus;                                  // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x1];                                       // 0x0021(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStateTreeStateHandle                  SourceState;                                       // 0x0022(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  TargetState;                                       // 0x0024(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  CurrentState;                                      // 0x0026(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeStateChangeType                     ChangeType;                                        // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeTransitionPriority                  Priority;                                          // 0x0029(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateTree*                             SourceStateTree;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FStateTreeStateHandle                  SourceRootState;                                   // 0x0038(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeTransitionResult;

// ScriptStruct StateTreeModule.RecordedStateTreeExecutionFrame
// 0x0028 (0x0028 - 0x0000)
struct FRecordedStateTreeExecutionFrame final
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FStateTreeStateHandle                  RootState;                                         // 0x0008(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeActiveStates                 ActiveStates;                                      // 0x000A(0x0012)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bIsGlobalFrame : 1;                                // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1D[0xB];                                       // 0x001D(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRecordedStateTreeExecutionFrame;

// ScriptStruct StateTreeModule.StateTreeEvent
// 0x0020 (0x0020 - 0x0000)
struct FStateTreeEvent final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       Payload;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   Origin;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeEvent;

// ScriptStruct StateTreeModule.RecordedStateTreeTransitionResult
// 0x0038 (0x0038 - 0x0000)
struct FRecordedStateTreeTransitionResult final
{
public:
	TArray<struct FRecordedStateTreeExecutionFrame> NextActiveFrames;                                // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FStateTreeEvent>                NextActiveFrameEvents;                             // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  SourceState;                                       // 0x0020(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeStateHandle                  TargetState;                                       // 0x0022(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStateTreeTransitionPriority                  Priority;                                          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateTree*                             SourceStateTree;                                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	struct FStateTreeStateHandle                  SourceRootState;                                   // 0x0030(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRecordedStateTreeTransitionResult;

// ScriptStruct StateTreeModule.StateTreeFloatCombinaisonPropertyFunctionInstanceData
// 0x000C (0x000C - 0x0000)
struct FStateTreeFloatCombinaisonPropertyFunctionInstanceData final
{
public:
	float                                         Left;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Right;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Result;                                            // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeFloatCombinaisonPropertyFunctionInstanceData;

// ScriptStruct StateTreeModule.StateTreeSingleIntPropertyFunctionInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FStateTreeSingleIntPropertyFunctionInstanceData final
{
public:
	int32                                         Input;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Result;                                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeSingleIntPropertyFunctionInstanceData;

// ScriptStruct StateTreeModule.StateTreeAddFloatPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeAddFloatPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeAddFloatPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeSubtractFloatPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeSubtractFloatPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeSubtractFloatPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeMakeIntervalPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeMakeIntervalPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeMakeIntervalPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeMultiplyFloatPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeMultiplyFloatPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeMultiplyFloatPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeDivideFloatPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeDivideFloatPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeDivideFloatPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeSingleFloatPropertyFunctionInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FStateTreeSingleFloatPropertyFunctionInstanceData final
{
public:
	float                                         Input;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Result;                                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeSingleFloatPropertyFunctionInstanceData;

// ScriptStruct StateTreeModule.StateTreeInvertFloatPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeInvertFloatPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeInvertFloatPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeMultiplyIntPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeMultiplyIntPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeMultiplyIntPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeAbsoluteFloatPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeAbsoluteFloatPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeAbsoluteFloatPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeIndex8
// 0x0001 (0x0001 - 0x0000)
struct FStateTreeIndex8 final
{
public:
	uint8                                         Value;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FStateTreeIndex8;

// ScriptStruct StateTreeModule.StateTreeMakeIntervalPropertyFunctionInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeMakeIntervalPropertyFunctionInstanceData final
{
public:
	float                                         min_0;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         max_0;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatInterval                         Result;                                            // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeMakeIntervalPropertyFunctionInstanceData;

// ScriptStruct StateTreeModule.StateTreeIntCombinaisonPropertyFunctionInstanceData
// 0x000C (0x000C - 0x0000)
struct FStateTreeIntCombinaisonPropertyFunctionInstanceData final
{
public:
	int32                                         Left;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Right;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Result;                                            // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeIntCombinaisonPropertyFunctionInstanceData;

// ScriptStruct StateTreeModule.StateTreeAddIntPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeAddIntPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeAddIntPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeSubtractIntPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeSubtractIntPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeSubtractIntPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeDivideIntPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeDivideIntPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeDivideIntPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeInvertIntPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeInvertIntPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeInvertIntPropertyFunction;

// ScriptStruct StateTreeModule.StateTreeAbsoluteIntPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeAbsoluteIntPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
DUMPER7_ASSERTS_FStateTreeAbsoluteIntPropertyFunction;

// ScriptStruct StateTreeModule.StateTreePropertyRef
// 0x0002 (0x0002 - 0x0000)
struct FStateTreePropertyRef
{
public:
	struct FStateTreeIndex16                      RefAccessIndex;                                    // 0x0000(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FStateTreePropertyRef;

// ScriptStruct StateTreeModule.StateTreeBlueprintPropertyRef
// 0x000E (0x0010 - 0x0002)
struct FStateTreeBlueprintPropertyRef final : public FStateTreePropertyRef
{
public:
	EStateTreePropertyRefType                     RefType;                                           // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsRefToArray : 1;                                 // 0x0003(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsOptional : 1;                                   // 0x0003(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                TypeObject;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FStateTreeBlueprintPropertyRef;

// ScriptStruct StateTreeModule.StateTreeReference
// 0x0028 (0x0028 - 0x0000)
struct FStateTreeReference final
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	struct FInstancedPropertyBag                  Parameters;                                        // 0x0008(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGuid>                          PropertyOverrides;                                 // 0x0018(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FStateTreeReference;

// ScriptStruct StateTreeModule.StateTreeInstanceData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FStateTreeInstanceData final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeInstanceData;

// ScriptStruct StateTreeModule.StateTreeRunParallelStateTreeTaskInstanceData
// 0x0040 (0x0040 - 0x0000)
struct FStateTreeRunParallelStateTreeTaskInstanceData final
{
public:
	struct FStateTreeReference                    StateTree;                                         // 0x0000(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FStateTreeInstanceData                 TreeInstanceData;                                  // 0x0028(0x0010)(Transient, NativeAccessSpecifierPublic)
	class UStateTree*                             RunningStateTree;                                  // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FStateTreeRunParallelStateTreeTaskInstanceData;

// ScriptStruct StateTreeModule.StateTreeRunParallelStateTreeTask
// 0x0008 (0x0030 - 0x0028)
struct FStateTreeRunParallelStateTreeTask final : public FStateTreeTaskCommonBase
{
public:
	struct FGameplayTag                           StateTreeOverrideTag;                              // 0x0028(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FStateTreeRunParallelStateTreeTask;

// ScriptStruct StateTreeModule.StateTreeBlueprintConditionWrapper
// 0x0008 (0x0030 - 0x0028)
struct FStateTreeBlueprintConditionWrapper final : public FStateTreeConditionBase
{
public:
	TSubclassOf<class UStateTreeConditionBlueprintBase> ConditionClass;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeBlueprintConditionWrapper;

// ScriptStruct StateTreeModule.StateTreeConsiderationBase
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeConsiderationBase : public FStateTreeNodeBase
{
public:
	EStateTreeExpressionOperand                   Operand;                                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          DeltaIndent;                                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeConsiderationBase;

// ScriptStruct StateTreeModule.StateTreeBlueprintConsiderationWrapper
// 0x0008 (0x0030 - 0x0028)
struct FStateTreeBlueprintConsiderationWrapper final : public FStateTreeConsiderationBase
{
public:
	TSubclassOf<class UStateTreeConsiderationBlueprintBase> ConsiderationClass;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeBlueprintConsiderationWrapper;

// ScriptStruct StateTreeModule.StateTreeBlueprintEvaluatorWrapper
// 0x0008 (0x0028 - 0x0020)
struct FStateTreeBlueprintEvaluatorWrapper final : public FStateTreeEvaluatorBase
{
public:
	TSubclassOf<class UStateTreeEvaluatorBlueprintBase> EvaluatorClass;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeBlueprintEvaluatorWrapper;

// ScriptStruct StateTreeModule.StateTreeCompareIntConditionInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FStateTreeCompareIntConditionInstanceData final
{
public:
	int32                                         Left;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Right;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTreeCompareIntConditionInstanceData;

// ScriptStruct StateTreeModule.StateTreeCompareIntCondition
// 0x0008 (0x0030 - 0x0028)
struct FStateTreeCompareIntCondition final : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenericAICheck                               Operator;                                          // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStateTreeCompareIntCondition;

// ScriptStruct StateTreeModule.StateTreeCompareFloatConditionInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FStateTreeCompareFloatConditionInstanceData final
{
public:
	double                                        Left;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
