#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteelShield

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "SteelShield_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SteelShield.SteelShieldTokenProvider
// 0x0038 (0x0060 - 0x0028)
class USteelShieldTokenProvider : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteelShieldTokenProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteelShieldTokenProvider")
	}
	static class USteelShieldTokenProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteelShieldTokenProvider>();
	}
};
DUMPER7_ASSERTS_USteelShieldTokenProvider;

// Class SteelShield.ClientTokenProvider
// 0x00A0 (0x0100 - 0x0060)
class UClientTokenProvider : public USteelShieldTokenProvider
{
public:
	uint8                                         Pad_60[0x90];                                      // 0x0060(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USteelShieldTokenRequest*>       ActiveRequests;                                    // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClientTokenProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClientTokenProvider")
	}
	static class UClientTokenProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientTokenProvider>();
	}
};
DUMPER7_ASSERTS_UClientTokenProvider;

// Class SteelShield.DefaultTokenProvider
// 0x0010 (0x0110 - 0x0100)
class UDefaultTokenProvider final : public UClientTokenProvider
{
public:
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USteelShieldJWT*                        JWT;                                               // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DefaultTokenProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefaultTokenProvider")
	}
	static class UDefaultTokenProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultTokenProvider>();
	}
};
DUMPER7_ASSERTS_UDefaultTokenProvider;

// Class SteelShield.EOSTokenProvider
// 0x0018 (0x0118 - 0x0100)
class UEOSTokenProvider final : public UClientTokenProvider
{
public:
	uint8                                         Pad_100[0x18];                                     // 0x0100(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSTokenProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSTokenProvider")
	}
	static class UEOSTokenProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSTokenProvider>();
	}
};
DUMPER7_ASSERTS_UEOSTokenProvider;

// Class SteelShield.SteelShieldJWT
// 0x0038 (0x0060 - 0x0028)
class USteelShieldJWT final : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteelShieldJWT")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteelShieldJWT")
	}
	static class USteelShieldJWT* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteelShieldJWT>();
	}
};
DUMPER7_ASSERTS_USteelShieldJWT;

// Class SteelShield.SteelShieldRuntimeSettings
// 0x0090 (0x00B8 - 0x0028)
class USteelShieldRuntimeSettings final : public UObject
{
public:
	int32                                         ApiVersion;                                        // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Developer;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Game;                                              // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Platform;                                          // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlatformKey;                                       // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BackendURL;                                        // 0x0070(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AuthProvider;                                      // 0x0080(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameClientVersion;                                 // 0x0090(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Certificate;                                       // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EJWTCertificateType                           CertificateType;                                   // 0x00B0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteelShieldRuntimeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteelShieldRuntimeSettings")
	}
	static class USteelShieldRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteelShieldRuntimeSettings>();
	}
};
DUMPER7_ASSERTS_USteelShieldRuntimeSettings;

// Class SteelShield.SteelShieldSubsystem
// 0x0078 (0x00A8 - 0x0030)
class USteelShieldSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bSuccessful)> OnInitializedBP;                                // 0x0050(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class USteelShieldTokenProvider*              TokenProvider;                                     // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x40];                                      // 0x0068(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class USteelShieldTokenProvider* SetTokenProvider(TSubclassOf<class USteelShieldTokenProvider> TokenProviderClass);
	bool Start(int32 TokenNum);
	void Stop();

	class USteelShieldTokenProvider* GetTokenProvider() const;
	bool IsEnabled() const;
	bool IsRolloverInProgress() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteelShieldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteelShieldSubsystem")
	}
	static class USteelShieldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteelShieldSubsystem>();
	}
};
DUMPER7_ASSERTS_USteelShieldSubsystem;

// Class SteelShield.SteelShieldTokenRequest
// 0x0018 (0x0040 - 0x0028)
class USteelShieldTokenRequest final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SteelShieldTokenRequest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SteelShieldTokenRequest")
	}
	static class USteelShieldTokenRequest* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteelShieldTokenRequest>();
	}
};
DUMPER7_ASSERTS_USteelShieldTokenRequest;

}

