#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StopWatch_Interface

#include "Basic.hpp"


namespace SDK::Params
{

// Function StopWatch_Interface.StopWatch_Interface_C.CanUseStopwatch
// 0x0001 (0x0001 - 0x0000)
struct StopWatch_Interface_C_CanUseStopwatch final
{
public:
	bool                                          bCanUse;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StopWatch_Interface_C_CanUseStopwatch;

// Function StopWatch_Interface.StopWatch_Interface_C.GetStopwatchBuffClass
// 0x0008 (0x0008 - 0x0000)
struct StopWatch_Interface_C_GetStopwatchBuffClass final
{
public:
	class UClass*                                 BuffClass;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StopWatch_Interface_C_GetStopwatchBuffClass;

// Function StopWatch_Interface.StopWatch_Interface_C.Interface_CanRecallTeleport
// 0x0001 (0x0001 - 0x0000)
struct StopWatch_Interface_C_Interface_CanRecallTeleport final
{
public:
	bool                                          CanRecall;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StopWatch_Interface_C_Interface_CanRecallTeleport;

// Function StopWatch_Interface.StopWatch_Interface_C.IsCurrentlyRewinding
// 0x0010 (0x0010 - 0x0000)
struct StopWatch_Interface_C_IsCurrentlyRewinding final
{
public:
	bool                                          bIsRewinding;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PercentLeft;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StopWatch_Interface_C_IsCurrentlyRewinding;

// Function StopWatch_Interface.StopWatch_Interface_C.IsStopWatchOnCooldown
// 0x0010 (0x0010 - 0x0000)
struct StopWatch_Interface_C_IsStopWatchOnCooldown final
{
public:
	bool                                          bIsOnCD;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PercentLeft;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StopWatch_Interface_C_IsStopWatchOnCooldown;

// Function StopWatch_Interface.StopWatch_Interface_C.SetCurrentWatchNumber
// 0x0004 (0x0004 - 0x0000)
struct StopWatch_Interface_C_SetCurrentWatchNumber final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StopWatch_Interface_C_SetCurrentWatchNumber;

// Function StopWatch_Interface.StopWatch_Interface_C.Stopwatch Activate Store Recall
// 0x0008 (0x0008 - 0x0000)
struct StopWatch_Interface_C_Stopwatch_Activate_Store_Recall final
{
public:
	class UPrimalItem*                            AssociatedPrimalItem;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StopWatch_Interface_C_Stopwatch_Activate_Store_Recall;

// Function StopWatch_Interface.StopWatch_Interface_C.StoredRecallTeleportSpotExists
// 0x0010 (0x0010 - 0x0000)
struct StopWatch_Interface_C_StoredRecallTeleportSpotExists final
{
public:
	bool                                          StoredTeleportSpotExists;                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PercentLeft;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StopWatch_Interface_C_StoredRecallTeleportSpotExists;

}

