#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoredDataPseudoFunctionLibrary

#include "Basic.hpp"

#include "ClientsideEvents_GeneScanner_structs.hpp"
#include "ShooterGame_classes.hpp"
#include "ClientsideEvents_GeneScanner_Variations_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass StoredDataPseudoFunctionLibrary.StoredDataPseudoFunctionLibrary_C
// 0x0130 (0x0160 - 0x0030)
class UStoredDataPseudoFunctionLibrary_C : public UObject_WithWorldContext
{
public:
	class FString                                 Could_Not_Determine_Max_Storage_Limit_string;      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Could_Not_Retrieve_Name_string;                    // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Could_Not_Get_Count_Of_Stored_Data_string;         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Name_For_StoredDatatype__PLURAL_;                  // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Could_Not_Retrieve_Description_string;             // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Target_Cannot_Recieve_string;                      // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 No_Available_Room_string;                          // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Could_Not_Determine_Available_Room_string;         // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Cannot_Add_string;                                 // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Cannot_Transfer_string;                            // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Failed_To_Add_To_Target_string;                    // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Failed_To_Remove_string;                           // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Unable_To_Determine_Target_Name_string;            // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Name_For_StoredDatatype__SINGULAR_;                // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 No_Options_Found_For_Entry_string;                 // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Action_Could_Not_Be_Completed_string;              // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Cannot_Remove_string;                              // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Transfer_string;                                   // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Destroy_String;                                    // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void AddStoredDataEntry_ViaCopying(struct FFunctionParams_NoArrays& Function_Params, int32 StoredDataIndex, class AActor* Sender_To_Copy_From, class FName& Function_Tag, class AActor* Reciever, bool SkipRoomCheck, bool* success, class FString* Fail_Reason_String);
	void AttemptTransferDataFromOneTargetToAnotherTarget(class AActor*& ActorTransferringFrom, class AActor*& ActorToTransferDataTo, TArray<int32>& StoredDataIndiciesToTransfer, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, bool* success, class FString* Fail_Reason_String);
	void Can_Target_Add_ANY_Stored_Data_Entry_Via_Copying(class AActor*& ActorTransferringFrom, class AActor*& ActorToTransferDataTo, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, bool SkipRoomCheck, class FString* Fail_Reason_String, bool* success);
	void Can_Target_Add_PARTICULAR_Stored_Data_Entry_Via_Copying(struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class AActor* SenderTransferringFrom, class AActor* RecieverToTransferDataTo, int32 Entry_Index, bool SkipRoomCheck, bool* can_add, class FString* Fail_Reason_String);
	void Can_Target_Remove_ANY_Stored_Data_Entry(struct FFunctionParams_NoArrays& Function_Params, class AActor*& Target, class FName& Function_Tag, class AActor*& RequestedByActor, class FString* Fail_Reason_String, bool* success);
	void Can_Target_Remove_PARTICULAR_Stored_Data_Entry(struct FFunctionParams_NoArrays& Function_Params, class AActor*& Entry_Owner, int32& StoredDataIndexToTransfer, class FName& Function_Tag, class AActor* RequestedByActor, bool* success, class FString* Fail_Reason_String);
	void Can_Transfer_Data_From_One_Target_To_Another_Target(class AActor* ActorTransferringFrom, class AActor*& ActorToTransferDataTo, TArray<int32>& StoredDataIndiciesToTransfer, class FName& Function_Tag, struct FFunctionParams_NoArrays& Function_Params, bool* success, class FString* Fail_Reason_String);
	void Common_Options_On_Stored_Data_Entry_Button(class AActor* Stored_Data_Entry_Owner, class AActor* Remote_Actor_To_Transfer_To, int32 Entry_Index, EClientsideEvents_GeneScanner Event_for_transferring_into_creature, EClientsideEvents_GeneScanner Event_for_transferring_from_Creature, EClientsideEvents_GeneScanner Event_for_transferring_into_Structure, EClientsideEvents_GeneScanner Event_for_transferring_from_Structure, EClientsideEvents_GeneScanner Event_For_Destroying, EClientsideEvents_GeneScanner_Variations Variant_In_Self, EClientsideEvents_GeneScanner_Variations Variant_In_Creature, EClientsideEvents_GeneScanner_Variations Variant_In_Structure, float ID, const class FString& String_Param_1, class AActor* Actor_To_Call_Event_On, TArray<class FString>* Options, TArray<bool>* Options_enabled, class FString* local_fail_reason);
	void Does_Target_Contain_PARTICULAR_Stored_Data_Entry(struct FFunctionParams_NoArrays& Function_Params, class AActor*& Target, int32& StoredDataIndiciesToTransfer, class FName& Function_Tag, bool* success, class FString* Fail_Reason_String);
	void Generate_Unique_ID(class AActor*& Target, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class FString* Fail_Reason_String, bool* success, double* EntryIndex);
	void Get_Available_Room_For_Stored_Data(class AActor*& Target, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, int32* Available_Room, bool* success, class FString* Fail_Reason_String);
	void Get_Entry_Index_From_Unique_Identifier(double unique_identifier, class AActor*& Target, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class FString* Fail_Reason_String, bool* success, int32* EntryIndex);
	void Get_Unique_Identifier_For_Entry(int32 Entry_Index, class AActor*& Target, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class FString* Fail_Reason_String, bool* success, double* Unique_ID);
	void GetCountOfStoredData(class AActor* Target, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class UPrimalItem* primal_item_target, class FString* fail_reason_string_count, bool* succeeded_finding_count, int32* found_count);
	void GetMaxAllowedStoredDataCount(class AActor*& ForActor, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class FString* Fail_Reason_String_B, int32* max_allowed_count, bool* succeeded_getting_max_allowed_count);
	void Is_There_Room_For_Transfering_Stored_Data_To_Target(const TArray<int32>& Transferring_StoredData_Indicies, class AActor*& ActorTransferringTo, class FName& Function_Tag, struct FFunctionParams_NoArrays& Function_Params, bool* There_Is_Room, class FString* Fail_Reason_String);
	void IsTargetValid(class AActor*& Target, class FName& Function_Tag, struct FFunctionParams_NoArrays& Function_Params, bool MustBeCreature, bool MustBeOnSameTeam, bool MustBeWild, bool MustBePregnantCreature, bool MustNotBePregnantCreature, bool MustBeStructure, bool MustBeBabyCreature, bool MustBeAdultCreature, bool MustBeFemale, bool MustBeMale, bool MustBeAlive, bool MustBeDead, TSoftClassPtr<class UClass> Must_Match_Specific_Class, class AActor*& Valid_To_Whom, TSoftClassPtr<class UClass> Must_Match_Specific_Dino_Entry_Class, bool* IsValidToBeInteractedWith, class FString* Fail_Reason_String);
	void RemoveStoredDataEntry(struct FFunctionParams_NoArrays& Function_Params, int32 StoredDataIndex, class AActor* Actor_to_Remove_From, class FName& Function_Tag, class AActor*& RequestedByActor, bool* success, class FString* Fail_Reason_String);
	void Target_Is_Valid_For_transfer(class AActor*& Target_To_Check, class FName& Function_Tag, struct FFunctionParams_NoArrays& Function_Params, bool MustBeCreature, bool MustBeOnSameTeam, bool MustBeWild, bool MustBePregnantCreature, bool MustNotBePregnantCreature, bool MustBeStructure, bool MustBeBabyCreature, bool MustBeAdultCreature, bool MustBeFemale, bool MustBeMale, bool MustBeAlive, bool MustBeDead, TSoftClassPtr<class UClass> Must_Match_Specific_Class, class AActor*& Valid_To_Whom, TSoftClassPtr<class UClass> Must_Match_Specific_Dino_Entry_Class, bool* IsValidToBeInteractedWith, class FString* Fail_Reason_String);
	void UI_Get_Available_Options_For_Interacting_WIth_An_Entry(struct FFunctionParams_NoArrays& Function_Params, int32 EntryIndex, class FName Function_Tag, class AActor* Left_Target_Actor, class AActor* Right_Target_Actor, bool Entry_Is_Held_By_Left_Target_Actor, TArray<class FString>* EntryOptions, TArray<bool>* EntryOptionsEnabled, bool* success, class FString* Fail_Reason_String);
	void UI_Get_Display_Name_For_Data_Type__PLURAL_(struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class FString* Name_For_Data_Type, bool* Succeded_getting_plural_name);
	void UI_Get_Display_Name_For_Data_Type__SINGULAR_(struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class FString* Ret_Singular_name, bool* succeeded_getting_singular_name);
	void UI_Trigger_Option_for_Interacting_WIth_An_Entry(struct FFunctionParams_NoArrays& Function_Params, int32 Entry_Index, uint8 Option_Chosen, class FName& Function_Tag, class AActor* Entry_Owning_Actor, class AActor* Remote_Actor_To_Transfer_To, class FString* fail_reason_string_for_triggering_entry_action, bool* succeeded_triggering_entry_action);
	void UI_Get_Description_For_PARTICULAR_Entry(int32& StoredData_Index, class AActor*& Target, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class FString* Description_For_Entry, bool* success, class FString* Fail_Reason_String);
	void UI_Get_Detailed_Description_For_PARTICULAR_Entry(int32& StoredData_Index, class AActor*& Target, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class FString* Description_For_Entry, bool* success, class FString* Fail_Reason_String);
	void UI_Get_Display_Name_For_PARTICULAR_Entry(int32& StoredData_Index, class AActor* Target, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class UPrimalItem* primal_item_target, class FString* ret_name_for_particular_entry, bool* succeeded_getting_name_for_particular_entry, class FString* ret_fail_reason_string_for_getting_name_of_particular_entry);
	void UI_GetDisplayNameForTarget(class AActor*& Target, struct FFunctionParams_NoArrays& Function_Params, class FName& Function_Tag, class FString* ret_name, bool* succeeded_getting_displawy_name_for_target, class FString* Ret_Fail_Rason);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("StoredDataPseudoFunctionLibrary_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StoredDataPseudoFunctionLibrary_C")
	}
	static class UStoredDataPseudoFunctionLibrary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoredDataPseudoFunctionLibrary_C>();
	}
};
DUMPER7_ASSERTS_UStoredDataPseudoFunctionLibrary_C;

}

