#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_DinoCompanion_GearData

#include "Basic.hpp"

#include "E_DinoCompanion_GearType_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_DinoCompanion_GearData.STR_DinoCompanion_GearData
// 0x00E0 (0x00E0 - 0x0000)
struct FSTR_DinoCompanion_GearData final
{
public:
	E_DinoCompanion_GearType                      GearType_35_4B1D67B84AE7A9567D0E0E88FCCE7772;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GearName_66_9085E7FC44848A65739B81951816AFA2;      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bIsToggle_86_9576B58346BE22CEFEEABAAB6763D71E;     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSaveToggleStateOnUnequip_89_FBFE4B9240748620D879768F974F29A6; // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActivateOnlyOnEquip_63_CC0AFACD4A519FE5218983BF90B6DBC8; // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowMultiusePlayerActivation_62_0C37AA864174A8FCD63D98BBFE3A2FE3; // 0x001B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GearCooldown_36_EB25A15A4CCDB1CDF1C27998DDE52A7F;  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDistanceToOwnerToUseSkill_47_F6C2F331439D2817736C0E99326BE42F; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   GearAddsBuffs_OnUse_75_53B5F1F14754F224743472B855524FA4; // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   GearAddsBuffs_OnUse_CompanionOwnerOverride_77_A128737A43F7E9D6523241805A892991; // 0x0058(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   GearAddsBuffs_OnEquip_79_920C6FC545CBA8C9EDCC2D9BC9447A97; // 0x0080(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   GearAddsBuffs_OnEquip_CompanionOwnerOverride_81_05606C6B4E2C9DC3F6A6D489683BCEF7; // 0x00A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bApplyBuffToCompanion_49_ECE35CF84DF68330731F5B81D0153541; // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bApplyBuffToCompanionOwner_44_7819D1554A17272EF7B8F49EF0CA431E; // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bConsumeDurabilityOnActivation_72_A8A73ED5421610448757CAB36F9D641B; // 0x00D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           ActivationAnimOverride_84_BD75A5A84F31436320277698FBBDA8EA; // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSTR_DinoCompanion_GearData;

}

