#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_VFX_DinoData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_VFX_DinoData.Struct_VFX_DinoData
// 0x0078 (0x0078 - 0x0000)
struct FStruct_VFX_DinoData final
{
public:
	class UMaterialInterface*                     FootPrintMaterialFront_40_9934BE724977867A05ECF4B30D0DEEBE; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     FootPrintMaterialBack_41_6DE4DFED4E1E9A8FCFEA78B3A1DD4290; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        FootPrintSize_9_07EED46F49833309632BE9B80FEF09B8;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FrontOffset_13_042EB71244BD073D424CE1ACC1F26E6C;   // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BackOffset_15_5896E7744D0C8029D1E1018271AB0D1F;    // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HoudiniScale_18_367AD654415C1909DD33DB9990F0FF91;  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               FrontTexture_36_E7B85FE84D4ED01F7BBDE68E374F0B15;  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               BackTexture_37_AF463293404EB69BD1C228A4371CECB9;   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               BackNormalTexture_38_E8AED8174904CE850931258D26AF5A3A; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               FrontNormalTexture_39_49DD42254279EB13CE20969B3BDB8940; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NiagaraSystemImpactOverride_45_F970EE614C9D415E7DA7BF9F9C4673DB; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_VFX_DinoData;

}

