#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Structure_TrainCart_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StructureBaseBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Structure_TrainCart_Base.Structure_TrainCart_Base_C
// 0x00F0 (0x0C38 - 0x0B48)
class AStructure_TrainCart_Base_C : public AStructureBaseBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   WheelFrameBack;                                    // 0x0B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WheelFrameFront;                                   // 0x0B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BuildingBounds;                                    // 0x0B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CouplerBack;                                       // 0x0B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CouplerFront;                                      // 0x0B70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WheelsFront_B;                                     // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WheelsBack_B;                                      // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WheelsFront_F;                                     // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WheelsBack_F;                                      // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        OffsetToNextAttachedCart;                          // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZOffset;                                           // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 MyTrain;                                           // 0x0BA8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash, ExperimentalAlwaysOverriden)
	struct FVector                                AttachTraceSize;                                   // 0x0BB0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TrackEndStopOffset;                                // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitialRelativeLoc_WF_Back;                        // 0x0BD0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitialRelativeLoc_WF_Front;                       // 0x0BE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             AttachCartIcon;                                    // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                             DetachCartIcon;                                    // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                             GoToCartIcon;                                      // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     GoToCartNumIcons;                                  // 0x0C18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             GoToEngineIcon;                                    // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         TameCountTargetingTeam;                            // 0x0C30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TameCountCost;                                     // 0x0C34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AttachLinkedStructures();
	bool BPAllowPickupGiveItem(class APlayerController* ForPC);
	void BPChangedActorTeam();
	void BPClientDoMultiUse(class APlayerController* ForPC, int32 ClientUseIndex);
	class APrimalDinoCharacter* BPGetAttachedToCharacter();
	TArray<struct FMultiUseEntry> BPGetMultiUseEntries(class APlayerController* ForPC, const TArray<struct FMultiUseEntry>& MultiUseEntries);
	void BPOnStructurePickup(class APlayerController* PlayerController, TSubclassOf<class UPrimalItem> ItemType, class UPrimalItem* NewlyPickedUpItem, bool bIsQuickPickup);
	bool BPTryMultiUse(class APlayerController* ForPC, int32 UseIndex);
	void ClearNetworkParent();
	void ExecuteUbergraph_Structure_TrainCart_Base(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void SetTrain(class AActor* MyTrain_0);
	void UpdateMovementValues(bool bIsMoving, double LastMovementSpeed, double LastDistance, class AActor* LastTrack, int32 LastTrackIndex, class USplineComponent* LastTrackSpline, int32 LastTrainSelectedTrackIndex);
	void UpdateTameCount(bool bForceDecrement);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Structure_TrainCart_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Structure_TrainCart_Base_C")
	}
	static class AStructure_TrainCart_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStructure_TrainCart_Base_C>();
	}
};
DUMPER7_ASSERTS_AStructure_TrainCart_Base_C;

}

