#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubtitlesUI

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SubtitlesUI.SubtitlesUI_C
// 0x00F8 (0x0940 - 0x0848)
class USubtitlesUI_C final : public UUI_Subtitles
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0848(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Icon_Glide_Out_Skip;                               // 0x0850(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Icon_Glide_In_Skip;                                // 0x0858(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HLNA_Icon_Glide_Out;                               // 0x0860(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HLNA_Icon_Glide_In;                                // 0x0868(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0870(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0878(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DialogueIconImage;                                 // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimalRichTextBlock*                   DialogueRichText;                                  // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SubtitleTextBlock;                                 // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         ExtAscensionSubtitles;                             // 0x0898(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSlateColor>                    ExSubtitleColors;                                  // 0x08A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         Gen2IntroSubtitles;                                // 0x08B8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSlateColor>                    Gen2IntroSubtitleColors;                           // 0x08C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         Gen2EndingSubtitles;                               // 0x08D8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSlateColor>                    Gen2EndingSubtitleColors;                          // 0x08E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         Gen2StingerSubtitles;                              // 0x08F8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSlateColor>                    Gen2StingerSubtitleColors;                         // 0x0908(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentIndex;                                      // 0x0918(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentSubtitleSet;                                // 0x091C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasChatBoxShown;                                   // 0x0924(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Fading_Out;                                     // 0x0925(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_926[0x2];                                      // 0x0926(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            DefaultSubtitleColor;                              // 0x0928(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddedToViewport();
	void BPPlayInstigatorVO(const class AActor* InstigatorVO, const struct FVO_DataEntry& Data);
	void ExecuteUbergraph_SubtitlesUI(int32 EntryPoint);
	void FadeOutSubtitles();
	void GetSubtitleColors(TArray<struct FSlateColor>* Colors);
	void GetSubtitles(TArray<class FString>* Subtitles);
	void OnHideSubtitles();
	void OnShowSubtitles();
	void ProcessDynamicMaterialForDialogueIcon();
	void ResetToStart(class FName SubtitleSet);
	void ShowNextSubtitle();
	void ShowSubtitleAtIndex(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SubtitlesUI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubtitlesUI_C")
	}
	static class USubtitlesUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubtitlesUI_C>();
	}
};
DUMPER7_ASSERTS_USubtitlesUI_C;

}

