#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TekArmor_EffectActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.ExecuteUbergraph_TekArmor_EffectActor
// 0x00A0 (0x00A0 - 0x0000)
struct TekArmor_EffectActor_C_ExecuteUbergraph_TekArmor_EffectActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_CustomEvent_particle_1;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_particleScale_1;                // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_CustomEvent_Sound_1;                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APrimalCharacter*                       K2Node_CustomEvent_player;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APrimalCharacter*                       K2Node_CustomEvent_DiedCharacter;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_CustomEvent_particle;                       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_particleScale;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_CustomEvent_Sound;                          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue_1;      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_active_1;                       // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APrimalCharacter* DiedCharacter)> K2Node_CreateDelegate_OutputDelegate;     // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_active;                         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_ExecuteUbergraph_TekArmor_EffectActor;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.InitTekEffect
// 0x0030 (0x0030 - 0x0000)
struct TekArmor_EffectActor_C_InitTekEffect final
{
public:
	class UParticleSystem*                        particle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleScale_0;                                   // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound;                                             // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APrimalCharacter*                       Player;                                            // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_InitTekEffect;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.OnRep_bParticlesOn
// 0x0001 (0x0001 - 0x0000)
struct TekArmor_EffectActor_C_OnRep_bParticlesOn final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_OnRep_bParticlesOn;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.OnRep_bSoundOn
// 0x0001 (0x0001 - 0x0000)
struct TekArmor_EffectActor_C_OnRep_bSoundOn final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_OnRep_bSoundOn;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.OnRep_ParticleScale
// 0x0001 (0x0001 - 0x0000)
struct TekArmor_EffectActor_C_OnRep_ParticleScale final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_OnRep_ParticleScale;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.OnRep_TekParticleTemplate
// 0x0001 (0x0001 - 0x0000)
struct TekArmor_EffectActor_C_OnRep_TekParticleTemplate final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_OnRep_TekParticleTemplate;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.OnRep_TekSoundRef
// 0x0001 (0x0001 - 0x0000)
struct TekArmor_EffectActor_C_OnRep_TekSoundRef final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_OnRep_TekSoundRef;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.PlayerDied
// 0x0008 (0x0008 - 0x0000)
struct TekArmor_EffectActor_C_PlayerDied final
{
public:
	class APrimalCharacter*                       DiedCharacter;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_PlayerDied;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.Replicate_SetParticleState
// 0x0001 (0x0001 - 0x0000)
struct TekArmor_EffectActor_C_Replicate_SetParticleState final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_Replicate_SetParticleState;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.Replicate_SetSoundState
// 0x0001 (0x0001 - 0x0000)
struct TekArmor_EffectActor_C_Replicate_SetSoundState final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_Replicate_SetSoundState;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.Set ParticleActive
// 0x0001 (0x0001 - 0x0000)
struct TekArmor_EffectActor_C_Set_ParticleActive final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_Set_ParticleActive;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.SetSoundActive
// 0x0018 (0x0018 - 0x0000)
struct TekArmor_EffectActor_C_SetSoundActive final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StartTime;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Play_StartTime_ImplicitCast;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_SetSoundActive;

// Function TekArmor_EffectActor.TekArmor_EffectActor_C.SetTekFX
// 0x0028 (0x0028 - 0x0000)
struct TekArmor_EffectActor_C_SetTekFX final
{
public:
	class UParticleSystem*                        particle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleScale_0;                                   // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound;                                             // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TekArmor_EffectActor_C_SetTekFX;

}

