#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TekHoverSail_Character_Base_BP

#include "Basic.hpp"

#include "Dino_Character_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TekHoverSail_Character_Base_BP.TekHoverSail_Character_Base_BP_C
// 0x0040 (0x2A50 - 0x2A10)
class ATekHoverSail_Character_Base_BP_C final : public ADino_Character_BP_C
{
public:
	bool                                          destroyed_by_item;                                 // 0x2A08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A09[0x7];                                     // 0x2A09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentFuelUnitPercent;                            // 0x2A10(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        SkiffDeathDropInventoryLifetime;                   // 0x2A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          has_set_item_ref;                                  // 0x2A20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A21[0x7];                                     // 0x2A21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimalItem*                            spawned_item_ref;                                  // 0x2A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        passed_in_follow_distance_to_stop_within;          // 0x2A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      spawning_character;                                // 0x2A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Hoversail_Class;                                   // 0x2A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void destroy_itself();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TekHoverSail_Character_Base_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TekHoverSail_Character_Base_BP_C")
	}
	static class ATekHoverSail_Character_Base_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATekHoverSail_Character_Base_BP_C>();
	}
};
DUMPER7_ASSERTS_ATekHoverSail_Character_Base_BP_C;

}

