#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThreadExecutionBlueprintNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ThreadExecutionBlueprintNode_structs.hpp"


namespace SDK::Params
{

// Function ThreadExecutionBlueprintNode.AsyncExecutionBlueprintTypes.Conv_ThreadTickTimingToTickingGroup
// 0x0002 (0x0002 - 0x0000)
struct AsyncExecutionBlueprintTypes_Conv_ThreadTickTimingToTickingGroup final
{
public:
	EThreadTickTiming                             ThreadTickTiming;                                  // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETickingGroup                                 ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncExecutionBlueprintTypes_Conv_ThreadTickTimingToTickingGroup;

// Function ThreadExecutionBlueprintNode.AsyncExecutionBlueprintTypes.Conv_TickingGroupToThreadTickTiming
// 0x0002 (0x0002 - 0x0000)
struct AsyncExecutionBlueprintTypes_Conv_TickingGroupToThreadTickTiming final
{
public:
	ETickingGroup                                 TickGroup;                                         // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EThreadTickTiming                             ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncExecutionBlueprintTypes_Conv_TickingGroupToThreadTickTiming;

// Function ThreadExecutionBlueprintNode.Mutex.TryLock
// 0x0001 (0x0001 - 0x0000)
struct Mutex_TryLock final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mutex_TryLock;

// Function ThreadExecutionBlueprintNode.SyncExecOnce.CreateSyncExecOnce
// 0x0008 (0x0008 - 0x0000)
struct SyncExecOnce_CreateSyncExecOnce final
{
public:
	class USyncExecOnce*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SyncExecOnce_CreateSyncExecOnce;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecLibrary.ExecIsGameThread
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecLibrary_ExecIsGameThread final
{
public:
	bool                                          bIsInGameThread;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecLibrary_ExecIsGameThread;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecLibrary.GameThreadExecOnce
// 0x0010 (0x0010 - 0x0000)
struct ThreadAsyncExecLibrary_GameThreadExecOnce final
{
public:
	TDelegate<void()>                             GameThreadExec;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecLibrary_GameThreadExecOnce;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecLibrary.GetCurrentThreadID
// 0x0004 (0x0004 - 0x0000)
struct ThreadAsyncExecLibrary_GetCurrentThreadID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecLibrary_GetCurrentThreadID;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecLibrary.GetThreadName
// 0x0008 (0x0008 - 0x0000)
struct ThreadAsyncExecLibrary_GetThreadName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecLibrary_GetThreadName;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecLibrary.IsGameThread
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecLibrary_IsGameThread final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecLibrary_IsGameThread;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecLibrary.SetThreadName
// 0x000C (0x000C - 0x0000)
struct ThreadAsyncExecLibrary_SetThreadName final
{
public:
	class FName                                   ThreadName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ThreadAsyncExecLibrary_SetThreadName;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecLibrary.ThreadWait
// 0x0004 (0x0004 - 0x0000)
struct ThreadAsyncExecLibrary_ThreadWait final
{
public:
	float                                         Seconds;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecLibrary_ThreadWait;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecLoopUnsafely.CreateThreadExecLoopUnsafely
// 0x0020 (0x0020 - 0x0000)
struct ThreadAsyncExecLoopUnsafely_CreateThreadExecLoopUnsafely final
{
public:
	float                                         Interval;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLongTask;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ThreadName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockGC;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UThreadAsyncExecLoopUnsafely*           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecLoopUnsafely_CreateThreadExecLoopUnsafely;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecOnce.CreateThreadExecOnce
// 0x0018 (0x0018 - 0x0000)
struct ThreadAsyncExecOnce_CreateThreadExecOnce final
{
public:
	bool                                          bExecuteWhenPaused;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLongTask;                                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ThreadName;                                        // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FThreadExecTimingPair                  TimingPair;                                        // 0x000C(0x0002)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UThreadAsyncExecOnce*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecOnce_CreateThreadExecOnce;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecOnce.IsExecuteWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecOnce_IsExecuteWhenPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecOnce_IsExecuteWhenPaused;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecOnceUnsafely.CreateThreadExecOnceUnsafely
// 0x0018 (0x0018 - 0x0000)
struct ThreadAsyncExecOnceUnsafely_CreateThreadExecOnceUnsafely final
{
public:
	bool                                          bLongTask;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ThreadName;                                        // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockGC;                                          // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UThreadAsyncExecOnceUnsafely*           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecOnceUnsafely_CreateThreadExecOnceUnsafely;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickBase.SetTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecTickBase_SetTickableWhenPaused final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickBase_SetTickableWhenPaused;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickBase.SetTickEnabled
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecTickBase_SetTickEnabled final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickBase_SetTickEnabled;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickBase.GetBehavior
// 0x0010 (0x0010 - 0x0000)
struct ThreadAsyncExecTickBase_GetBehavior final
{
public:
	struct FThreadTickExecBehavior                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickBase_GetBehavior;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickBase.GetTimingPair
// 0x0002 (0x0002 - 0x0000)
struct ThreadAsyncExecTickBase_GetTimingPair final
{
public:
	struct FThreadExecTimingPair                  ReturnValue;                                       // 0x0000(0x0002)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickBase_GetTimingPair;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickBase.IsTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecTickBase_IsTickableWhenPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickBase_IsTickableWhenPaused;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickBase.IsTickEnabled
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecTickBase_IsTickEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickBase_IsTickEnabled;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickBase.IsTicking
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecTickBase_IsTicking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickBase_IsTicking;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTick.CreateThreadExecTick
// 0x0028 (0x0028 - 0x0000)
struct ThreadAsyncExecTick_CreateThreadExecTick final
{
public:
	bool                                          bTickEnabled;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTickWhenPaused;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLongTask;                                         // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ThreadName;                                        // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FThreadExecTimingPair                  TimingPair;                                        // 0x000C(0x0002)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FThreadTickExecBehavior                Behavior;                                          // 0x0010(0x0010)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	class UThreadAsyncExecTick*                   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTick_CreateThreadExecTick;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickForLoop.CreateThreadExecTickForLoop
// 0x0030 (0x0030 - 0x0000)
struct ThreadAsyncExecTickForLoop_CreateThreadExecTickForLoop final
{
public:
	int32                                         FirstIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastIndex;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTickEnabled;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTickWhenPaused;                                   // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLongTask;                                         // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ThreadName;                                        // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FThreadExecTimingPair                  TimingPair;                                        // 0x0014(0x0002)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FThreadTickExecBehavior                Behavior;                                          // 0x0018(0x0010)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	class UThreadAsyncExecTickForLoop*            ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickForLoop_CreateThreadExecTickForLoop;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickForLoop.GetCurrentIndex
// 0x0004 (0x0004 - 0x0000)
struct ThreadAsyncExecTickForLoop_GetCurrentIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickForLoop_GetCurrentIndex;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickForLoop.GetFirstIndex
// 0x0004 (0x0004 - 0x0000)
struct ThreadAsyncExecTickForLoop_GetFirstIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickForLoop_GetFirstIndex;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickForLoop.GetLastIndex
// 0x0004 (0x0004 - 0x0000)
struct ThreadAsyncExecTickForLoop_GetLastIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickForLoop_GetLastIndex;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickUnsafely.CreateThreadExecTickUnsafely
// 0x0018 (0x0018 - 0x0000)
struct ThreadAsyncExecTickUnsafely_CreateThreadExecTickUnsafely final
{
public:
	bool                                          TickEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TickWhenPaused;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLongTask;                                         // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ThreadName;                                        // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockGC;                                          // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UThreadAsyncExecTickUnsafely*           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickUnsafely_CreateThreadExecTickUnsafely;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickUnsafely.SetTickable
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecTickUnsafely_SetTickable final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickUnsafely_SetTickable;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickUnsafely.SetTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecTickUnsafely_SetTickableWhenPaused final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickUnsafely_SetTickableWhenPaused;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickUnsafely.IsTickable
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecTickUnsafely_IsTickable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickUnsafely_IsTickable;

// Function ThreadExecutionBlueprintNode.ThreadAsyncExecTickUnsafely.IsTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct ThreadAsyncExecTickUnsafely_IsTickableWhenPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadAsyncExecTickUnsafely_IsTickableWhenPaused;

// Function ThreadExecutionBlueprintNode.ThreadExecDeveloperSettings.Get
// 0x0008 (0x0008 - 0x0000)
struct ThreadExecDeveloperSettings_Get final
{
public:
	class UThreadExecDeveloperSettings*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadExecDeveloperSettings_Get;

// Function ThreadExecutionBlueprintNode.ThreadNodeSubsystem.CreateNewMutex
// 0x0008 (0x0008 - 0x0000)
struct ThreadNodeSubsystem_CreateNewMutex final
{
public:
	class UMutex*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadNodeSubsystem_CreateNewMutex;

// Function ThreadExecutionBlueprintNode.ThreadNodeSubsystem.DestoryMutex
// 0x0008 (0x0008 - 0x0000)
struct ThreadNodeSubsystem_DestoryMutex final
{
public:
	class UMutex*                                 Mutex;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadNodeSubsystem_DestoryMutex;

// Function ThreadExecutionBlueprintNode.ThreadNodeSubsystem.GetAllMutexes
// 0x0050 (0x0050 - 0x0000)
struct ThreadNodeSubsystem_GetAllMutexes final
{
public:
	TSet<class UMutex*>                           ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadNodeSubsystem_GetAllMutexes;

// Function ThreadExecutionBlueprintNode.ThreadNodeSubsystem.GetAllThreadExecLoops
// 0x0050 (0x0050 - 0x0000)
struct ThreadNodeSubsystem_GetAllThreadExecLoops final
{
public:
	TSet<class UThreadAsyncExecLoopUnsafely*>     ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadNodeSubsystem_GetAllThreadExecLoops;

// Function ThreadExecutionBlueprintNode.ThreadNodeSubsystem.GetAllThreadExecNodes
// 0x0050 (0x0050 - 0x0000)
struct ThreadNodeSubsystem_GetAllThreadExecNodes final
{
public:
	TSet<class UThreadAsyncExecBase*>             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadNodeSubsystem_GetAllThreadExecNodes;

// Function ThreadExecutionBlueprintNode.ThreadNodeSubsystem.GetAllThreadExecOnces
// 0x0050 (0x0050 - 0x0000)
struct ThreadNodeSubsystem_GetAllThreadExecOnces final
{
public:
	TSet<class UThreadAsyncExecOnce*>             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadNodeSubsystem_GetAllThreadExecOnces;

// Function ThreadExecutionBlueprintNode.ThreadNodeSubsystem.GetAllThreadExecTicks
// 0x0050 (0x0050 - 0x0000)
struct ThreadNodeSubsystem_GetAllThreadExecTicks final
{
public:
	TSet<class UThreadAsyncExecTickBase*>         ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThreadNodeSubsystem_GetAllThreadExecTicks;

}

