#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThreadExecutionBlueprintNode

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum ThreadExecutionBlueprintNode.EThreadTickTiming
// NumValues: 0x0007
enum class EThreadTickTiming : uint8
{
	PreActorTick                             = 0,
	PrePhysics                               = 1,
	DuringPhysics                            = 2,
	PostPhysics                              = 3,
	PostUpdateWork                           = 4,
	PostActorTick                            = 5,
	EThreadTickTiming_MAX                    = 6,
};

// Enum ThreadExecutionBlueprintNode.EThreadAsyncExecTag
// NumValues: 0x0003
enum class EThreadAsyncExecTag : uint8
{
	DoExecution                              = 1,
	WithoutCompletion                        = 2,
	EThreadAsyncExecTag_MAX                  = 3,
};

// ScriptStruct ThreadExecutionBlueprintNode.TickFunctionByGroup
// 0x0008 (0x0030 - 0x0028)
struct FTickFunctionByGroup final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTickFunctionByGroup;

// ScriptStruct ThreadExecutionBlueprintNode.ThreadTickExecBehavior
// 0x0010 (0x0010 - 0x0000)
struct FThreadTickExecBehavior final
{
public:
	bool                                          bDynamicExecPerTick;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StaticExecTimes;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPredictNextUsingPreExec;                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PredictedTimeCostFactor;                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FThreadTickExecBehavior;

// ScriptStruct ThreadExecutionBlueprintNode.ThreadExecTimingPair
// 0x0002 (0x0002 - 0x0000)
struct FThreadExecTimingPair final
{
public:
	EThreadTickTiming                             BeginIn;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EThreadTickTiming                             EndBefore;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FThreadExecTimingPair;

}

