#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrackResourceItem_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TrackResourceItem_Widget.TrackResourceItem_Widget_C
// 0x0040 (0x03B8 - 0x0378)
class UTrackResourceItem_Widget_C final : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCustomButtonWidget*                    ButtonDestroyPanel3;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaxQuantityEngram3;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Qty;                                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TrackEngramIcon3;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UClass* Item)> RemoveIndex;                                  // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 LastItem;                                          // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__TrackResourceItem_Widget_ButtonDestroyPanel3_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_TrackResourceItem_Widget(int32 EntryPoint);
	void InitItem(class UClass* Item);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TrackResourceItem_Widget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TrackResourceItem_Widget_C")
	}
	static class UTrackResourceItem_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrackResourceItem_Widget_C>();
	}
};
DUMPER7_ASSERTS_UTrackResourceItem_Widget_C;

}

