#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trait_Warm

#include "Basic.hpp"

#include "Trait_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trait_Warm.Trait_Warm_C
// 0x0100 (0x0260 - 0x0160)
class UTrait_Warm_C final : public UTrait_Base_C
{
public:
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 AdditionalInsulationValues;                        // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Creature_s_rider_gains_string;                     // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 _Hypothermic_Insulation_string;                    // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 PercentNewlineString;                              // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CreatureAndItsRiderReduceIncomingDamageString;     // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<TSoftClassPtr<class UClass>, double>     reduced_damagetypes;                               // 0x01B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 damage_recieved_multiplier;                        // 0x0200(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<TSoftClassPtr<class UClass>, double>     reduced_damagetypes_that_have_this_buff;           // 0x0210(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool BPGetCustomBlueprintData(class FName DataName, const struct FFunctionParams_NoArrays& InData, struct FFunctionParams_NoArrays* OutData);
	void GetFullDescription__with_tier_and_drag_weight_alpha_already_obtained_(struct FFunctionParams_NoArrays& In_Data, int32 Tier, float Drag_Weight_Alpha_from_1_0_to_Value, class FString* Full_Description);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trait_Warm_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trait_Warm_C")
	}
	static class UTrait_Warm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrait_Warm_C>();
	}
};
DUMPER7_ASSERTS_UTrait_Warm_C;

}

