#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trait_Swimmer

#include "Basic.hpp"

#include "Trait_Base_classes.hpp"
#include "TraitValueModifications_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trait_Swimmer.Trait_Swimmer_C
// 0x0050 (0x01B0 - 0x0160)
class UTrait_Swimmer_C final : public UTrait_Base_C
{
public:
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 SubmergedOxygenDecreaseSpeedMultiplierPerInstance; // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 ModifySwimmingSpeedmultiplierperinstance;          // 0x0170(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 ModifySwimmingOrFlyingStaminaConsumptionRatemultiplierperinstance; // 0x0180(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Swimming_string;                                   // 0x0190(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 NewlineString;                                     // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	bool BPGetCustomBlueprintData(class FName DataName, const struct FFunctionParams_NoArrays& InData, struct FFunctionParams_NoArrays* OutData);
	void GetFullDescription__with_tier_and_drag_weight_alpha_already_obtained_(struct FFunctionParams_NoArrays& In_Data, int32 Tier, float Drag_Weight_Alpha_from_1_0_to_Value, class FString* Full_Description);
	void GetSpecificationForAdjustingValue(ETraitValueModifications Effect, uint8 Tier, class FString* Reason);
	void IsTraitAllowedToBeOnThisCreature(struct FFunctionParams_NoArrays& InData, bool* IsAllowed);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trait_Swimmer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trait_Swimmer_C")
	}
	static class UTrait_Swimmer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrait_Swimmer_C>();
	}
};
DUMPER7_ASSERTS_UTrait_Swimmer_C;

}

