#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trait_Angry

#include "Basic.hpp"

#include "Trait_Base_classes.hpp"
#include "TraitValueModifications_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trait_Angry.Trait_Angry_C
// 0x0058 (0x01B8 - 0x0160)
class UTrait_Angry_C final : public UTrait_Base_C
{
public:
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Multiplier;                                        // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        AdditionalDamageMultiplierMinimum;                 // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AdditionalDamageStartsAtHealthMaxPercentage;       // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AdditionalDamageReachesMaximumAtHealthMinPercentage; // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   At_Low_HP_string;                                  // 0x0188(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Increased_Speed_string;                            // 0x0198(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 NewlineString;                                     // 0x01A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	bool BPGetCustomBlueprintData(class FName DataName, const struct FFunctionParams_NoArrays& InData, struct FFunctionParams_NoArrays* OutData);
	void GetFullDescription(struct FFunctionParams_NoArrays& InData, class FString* Full_Description);
	void GetSpecificationForAdjustingValue(ETraitValueModifications Effect, uint8 Tier, class FString* Reason);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trait_Angry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trait_Angry_C")
	}
	static class UTrait_Angry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrait_Angry_C>();
	}
};
DUMPER7_ASSERTS_UTrait_Angry_C;

}

