#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trait_Kingslaying

#include "Basic.hpp"

#include "Trait_Base_classes.hpp"
#include "TraitValueModifications_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trait_Kingslaying.Trait_Kingslaying_C
// 0x0058 (0x01B8 - 0x0160)
class UTrait_Kingslaying_C final : public UTrait_Base_C
{
public:
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 SpecialMultipliers;                                // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         NonSpecialMultiplier;                              // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   AdjustOutputDamageString;                          // 0x0178(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        SpecialDamageMultiplier;                           // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   AlphaBuffClass;                                    // 0x0190(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	bool BPGetCustomBlueprintData(class FName DataName, const struct FFunctionParams_NoArrays& InData, struct FFunctionParams_NoArrays* OutData);
	void GetFullDescription(struct FFunctionParams_NoArrays& InData, class FString* Full_Description);
	void GetSpecificationForAdjustingValue(ETraitValueModifications Effect, uint8 Tier, class FString* Reason);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trait_Kingslaying_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trait_Kingslaying_C")
	}
	static class UTrait_Kingslaying_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrait_Kingslaying_C>();
	}
};
DUMPER7_ASSERTS_UTrait_Kingslaying_C;

}

