#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trait_Carefree

#include "Basic.hpp"

#include "Trait_Base_classes.hpp"
#include "TraitValueModifications_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trait_Carefree.Trait_Carefree_C
// 0x0058 (0x01B8 - 0x0160)
class UTrait_Carefree_C final : public UTrait_Base_C
{
public:
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Multipliers;                                       // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class APrimalBuff>                BuffOnDealReceiveDamageOrRide;                     // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   LoseSpeedDealDamageString;                         // 0x0178(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LoseSpeedTakeDamageString;                         // 0x0188(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LoseSpeedOnSetRiderString;                         // 0x0198(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ApplySpeedString;                                  // 0x01A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool BPGetCustomBlueprintData(class FName DataName, const struct FFunctionParams_NoArrays& InData, struct FFunctionParams_NoArrays* OutData);
	void GetFullDescription__with_tier_and_drag_weight_alpha_already_obtained_(struct FFunctionParams_NoArrays& In_Data, int32 Tier, float Drag_Weight_Alpha_from_1_0_to_Value, class FString* Full_Description);
	void GetSpecificationForAdjustingValue(ETraitValueModifications Effect, uint8 Tier, class FString* Reason);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trait_Carefree_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trait_Carefree_C")
	}
	static class UTrait_Carefree_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrait_Carefree_C>();
	}
};
DUMPER7_ASSERTS_UTrait_Carefree_C;

}

