#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trait_Inherit_Base

#include "Basic.hpp"

#include "ShooterGame_structs.hpp"
#include "Trait_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trait_Inherit_Base.Trait_Inherit_Base_C
// 0x0130 (0x0290 - 0x0160)
class UTrait_Inherit_Base_C : public UTrait_Base_C
{
public:
	EPrimalCharacterStatusValue                   InheritedStatToAdjust;                             // 0x015C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Robust;                                            // 0x015D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 RobustModifiers;                                   // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Frail;                                             // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FrailModifiers;                                    // 0x0178(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Mutable;                                           // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 MutableChanceModifiers;                            // 0x0190(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 MutableWeightModifiers;                            // 0x01A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Health_string;                                     // 0x01B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Stamina_string;                                    // 0x01C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Torpidity_string;                                  // 0x01D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Oxygen_string;                                     // 0x01E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Food_string;                                       // 0x01F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Water_string;                                      // 0x0200(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Temperature_string;                                // 0x0210(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Melee_Damage_string;                               // 0x0220(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Speed_string;                                      // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Fortitude_string;                                  // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Crafting_Speed_string;                             // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Weight_string;                                     // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FullDescriptionRobustFormatText;                   // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FullDescriptionFrailFormatText;                    // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool BPGetCustomBlueprintData(class FName DataName, const struct FFunctionParams_NoArrays& InData, struct FFunctionParams_NoArrays* OutData);
	void Get_Affected_Stat_String(class FString* stat_string);
	void GetFullDescription__with_tier_and_drag_weight_alpha_already_obtained_(struct FFunctionParams_NoArrays& In_Data, int32 Tier, float Drag_Weight_Alpha_from_1_0_to_Value, class FString* Full_Description);
	void IsTraitAllowedToBeOnThisCreature(struct FFunctionParams_NoArrays& InData, bool* IsAllowed);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trait_Inherit_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trait_Inherit_Base_C")
	}
	static class UTrait_Inherit_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrait_Inherit_Base_C>();
	}
};
DUMPER7_ASSERTS_UTrait_Inherit_Base_C;

}

