#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trait_CarrierBase

#include "Basic.hpp"

#include "Trait_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trait_CarrierBase.Trait_CarrierBase_C
// 0x0108 (0x0268 - 0x0160)
class UTrait_CarrierBase_C : public UTrait_Base_C
{
public:
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TSoftClassPtr<class UClass>, double>     ApplicableItemTypesToReduceWeightOfAndTheirAssociatedWeightMultipliers_Tier_1; // 0x0160(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<TSoftClassPtr<class UClass>, double>     ApplicableItemTypesToReduceWeightOfAndTheirAssociatedWeightMultipliers_Tier_2; // 0x01B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<TSoftClassPtr<class UClass>, double>     ApplicableItemTypesToReduceWeightOfAndTheirAssociatedWeightMultipliers_Tier_3; // 0x0200(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Full_Description_carried_types;                    // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   GetReducedWeightItem_name;                         // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, TObjectPtr)

public:
	bool BPGetCustomBlueprintData(class FName DataName, const struct FFunctionParams_NoArrays& InData, struct FFunctionParams_NoArrays* OutData);
	void GetFullDescription(struct FFunctionParams_NoArrays& InData, class FString* Full_Description);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trait_CarrierBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trait_CarrierBase_C")
	}
	static class UTrait_CarrierBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrait_CarrierBase_C>();
	}
};
DUMPER7_ASSERTS_UTrait_CarrierBase_C;

}

