#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trait_Cowardly

#include "Basic.hpp"

#include "Trait_Base_classes.hpp"
#include "TraitValueModifications_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trait_Cowardly.Trait_Cowardly_C
// 0x0038 (0x0198 - 0x0160)
class UTrait_Cowardly_C final : public UTrait_Base_C
{
public:
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Multiplier;                                        // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   After_Taking_Damage_string;                        // 0x0170(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Increased_Speed__string;                           // 0x0180(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class APrimalBuff>                buff_on_being_damaged;                             // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	bool BPGetCustomBlueprintData(class FName DataName, const struct FFunctionParams_NoArrays& InData, struct FFunctionParams_NoArrays* OutData);
	void GetFullDescription__with_tier_and_drag_weight_alpha_already_obtained_(struct FFunctionParams_NoArrays& In_Data, int32 Tier, float Drag_Weight_Alpha_from_1_0_to_Value, class FString* Full_Description);
	void GetSpecificationForAdjustingValue(ETraitValueModifications Effect, uint8 Tier, class FString* Reason);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trait_Cowardly_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trait_Cowardly_C")
	}
	static class UTrait_Cowardly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrait_Cowardly_C>();
	}
};
DUMPER7_ASSERTS_UTrait_Cowardly_C;

}

