#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trait_Base

#include "Basic.hpp"

#include "TraitValueModifications_structs.hpp"
#include "ShooterGame_structs.hpp"
#include "ShooterGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trait_Base.Trait_Base_C
// 0x0138 (0x0160 - 0x0028)
#pragma pack(push, 0x1)
class alignas(0x08) UTrait_Base_C : public UGeneTrait
{
public:
	int32                                         MaxAllowedStacksOfThisTraitThatCanExistOnACreature; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Display_Name;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   BaseDescription;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ExtraNote;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveFloat*                            Drag_Weight_Effectiveness_Curve;                   // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 percent_string;                                    // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, HasGetValueTypeHash)
	TMap<ETraitValueModifications, class FName>   GeneTraitValueModificationNames;                   // 0x0078(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, TObjectPtr)
	TMap<double, double>                          Drag_Weight_Effectiveness_Steps;                   // 0x00C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 plus_string;                                       // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, HasGetValueTypeHash)
	class FString                                 minus_string;                                      // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          CheckIsTraitAllowedToBeOnThisCreature;             // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanBeReplacedAsAnAdult;                            // 0x0139(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FullDescriptionFormatText;                         // 0x0140(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Is_Primal_Bot_Thrall_Trait;                        // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   IsTraitAllowedToBeOnThisCreature_name;             // 0x0154(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, TObjectPtr)

public:
	bool BPGetCustomBlueprintData(class FName DataName, const struct FFunctionParams_NoArrays& InData, struct FFunctionParams_NoArrays* OutData);
	void EffectDescriptionMultiplierAdding(const TArray<struct FFloatArray>& Cumulative_additive_multiplier_vals, bool* we_have_2_or_more_of_a_trait_stack, double* combined_values_finalMultiplier1, class FString* combined_values_string1);
	class FString float_to_clamped_precision_string__make_this_better_(double InDouble, int32 Length);
	void Get_Drag_Weight_Effectiveness_Alpha(float drag_weight, float* Alpha_From_1_0_To_Value);
	void GetDisplayName(struct FFunctionParams_NoArrays& InData, class FString* DisplayName);
	void GetFullDescription(struct FFunctionParams_NoArrays& InData, class FString* Full_Description);
	void GetFullDescription__with_tier_and_drag_weight_alpha_already_obtained_(struct FFunctionParams_NoArrays& In_Data, int32 Tier, float Drag_Weight_Alpha_from_1_0_to_Value, class FString* Full_Description);
	void GetMaxAllowedStacksOfThisTraitThatCanExistOnACreature(struct FFunctionParams_NoArrays& InData, int32* MaxAllowedStacksOfThisTraitThatCanExistOnACreature_0);
	void GetOwningCreatureTraitTierAndDragWeightAlpha(const struct FFunctionParams_NoArrays& FunctionParams_NoArrays, bool* Could_Obtain_Creature_s_Drag_Weight, int32* Trait_Tier, float* Drag_Weight_Alpha_from_1_0_to_Value);
	class FString GetPlayerDisplayedPlusOrMinusValueOfTraitMultiplier(double InputPin, int32 Length);
	class FString GetPlusOrMinusSignFromFloat(double A);
	void GetShortDescription(struct FFunctionParams_NoArrays& InData, class FString* Short_Description);
	void GetShortDescription__with_tier_and_drag_weight_alpha_already_obtained_(struct FFunctionParams_NoArrays& In_Data, int32 Tier, float Drag_Weight_Alpha_from_1_0_to_Value, class FString* Short_Description);
	void GetSpecificationForAdjustingValue(ETraitValueModifications Effect, uint8 Tier, class FString* Reason);
	void GetTotalStatPoints(const struct FFunctionParams_NoArrays& InData, EPrimalCharacterStatusValue Stat, bool Wild, bool Tamed, bool Mutations, int32* NumPoints);
	void IsTraitAllowedToBeOnThisCreature(struct FFunctionParams_NoArrays& InData, bool* IsAllowed);
	void Sanitize_Float(double FloatInput, int32 Places, class FString* StringOutput);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trait_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trait_Base_C")
	}
	static class UTrait_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrait_Base_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UTrait_Base_C;

}

