#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trait_Giantslaying

#include "Basic.hpp"

#include "Trait_Base_classes.hpp"
#include "TraitValueModifications_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trait_Giantslaying.Trait_Giantslaying_C
// 0x0038 (0x0198 - 0x0160)
class UTrait_Giantslaying_C final : public UTrait_Base_C
{
public:
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 damage_multiplier_above_high_hp;                   // 0x0160(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Decreased_Against_Small_string;                    // 0x0170(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Drag_Weight_above_which_to_have_increased_damage;  // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Drag_Weight_below_which_to_have_decreased_damage;  // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 damage_multiplier_below_low_hp;                    // 0x0188(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool BPGetCustomBlueprintData(class FName DataName, const struct FFunctionParams_NoArrays& InData, struct FFunctionParams_NoArrays* OutData);
	void GetFullDescription__with_tier_and_drag_weight_alpha_already_obtained_(struct FFunctionParams_NoArrays& In_Data, int32 Tier, float Drag_Weight_Alpha_from_1_0_to_Value, class FString* Full_Description);
	void GetSpecificationForAdjustingValue(ETraitValueModifications Effect, uint8 Tier, class FString* Reason);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trait_Giantslaying_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trait_Giantslaying_C")
	}
	static class UTrait_Giantslaying_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrait_Giantslaying_C>();
	}
};
DUMPER7_ASSERTS_UTrait_Giantslaying_C;

}

