#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "Struct_MinMaxVectors_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "RigVM_structs.hpp"
#include "PBIK_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_2d77fffdd66f7b9c
// 0x1040 (0x1040 - 0x0000)
struct FPropertyBag_2d77fffdd66f7b9c final
{
public:
	struct FRigElementKey                         RigVMModel___RigUnit_SetRotation_2_Item__Const;    // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_SetRotation_2_Space__Const;   // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetRotation_2_bInitial__Const; // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x0010(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___RigUnit_SetRotation_2_Weight__Const;  // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetRotation_2_bPropagateToChildren__Const; // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___GroundConformForwardsSolve_DebugDrawThickness__Const; // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___GroundConformForwardsSolve_DebugDrawScale__Const; // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GroundConformForwardsSolve_SpringStrength__Const; // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___GroundConformForwardsSolve_DampingFactor__Const; // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___GroundConformForwardsSolve_CollisionRadiusFactor__Const; // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GroundConformForwardsSolve_Root_Bone__Const; // 0x0058(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GroundConformForwardsSolve_Hip_Bone__Const; // 0x0064(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GroundConformForwardsSolve_Effector_Rotation_Alpha__Const; // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GroundConformForwardsSolve_Effector_Pin_Rotation__Const; // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                RigVMModel___GroundConformForwardsSolve_TimingBias__Const; // 0x0078(0x0010)(Edit)
	double                                        RigVMModel___GroundConformForwardsSolve_TimingBiasSpeed__Const; // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GroundConformForwardsSolve_ForceSleepTimeLimit__Const; // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariableDefault__GroundConformForwardsSolve_bNotAppliedCachedPose__Const; // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariableDefault__GroundConformForwardsSolve_bComponentMotionDetected__Const; // 0x0095(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariableDefault__GroundConformForwardsSolve_bTempMotionDetected__Const; // 0x0096(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_Space__Const; // 0x0097(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_bInitial__Const; // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_bInitial__Const; // 0x0099(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_Weight__Const; // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             GroundConformForwardsSolve___GroundConformForwardsSolve_To_World_Value__Const; // 0x00A0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_2_1_Index__Const; // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Name__Const; // 0x0104(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigMetaDataNameSpace                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_NameSpace__Const; // 0x010C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Name__Const; // 0x0110(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Value__Const; // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Item__Const; // 0x011C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Name__Const; // 0x0128(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x0130(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_1_Value__Const; // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariableDefault__CheckForAnimationMotion_CallGroundConform__Const; // 0x013C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariableDefault__CheckForAnimationMotion_DetectedPoseDifference__Const; // 0x013D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalVariableDefault__CheckForAnimationMotion_To_World_World__Const; // 0x0140(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_Space__Const; // 0x01A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_bInitial__Const; // 0x01A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigElementType                               CheckForAnimationMotion___CheckForAnimationMotion_HierarchyGetPoseItemArray_1_ElementType__Const; // 0x01A2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A3[0x1];                                      // 0x01A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_RotationThreshold__Const; // 0x01A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariable__FunctionLibrary___CheckForAnimationMotion_VariableNode_1_Value__Const; // 0x01A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_Tolerance__Const; // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x01B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Subtract_B__Const; // 0x01B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigElementType                               GroundConformForwardsSolve___GroundConformForwardsSolve_HierarchyGetPoseItemArray_ElementType__Const; // 0x01BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 GroundConformForwardsSolve___GroundConformForwardsSolve_HierarchyGetPoseItemArray_ItemsToGet__Const; // 0x01C0(0x0010)(Edit)
	bool                                          Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_VariableNode_1_Value__Const; // 0x01D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Name__Const; // 0x01D4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigMetaDataNameSpace                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_NameSpace__Const; // 0x01DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_Space__Const; // 0x01DD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_bInitial__Const; // 0x01DE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DF[0x1];                                      // 0x01DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Name__Const; // 0x01E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Default__Const; // 0x01E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_Default__Const; // 0x01EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Minimum_1_B__Const; // 0x01F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Name__Const; // 0x01F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Default__Const; // 0x0200(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Name__Const; // 0x0218(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Name__Const; // 0x0220(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Name__Const; // 0x0228(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Default__Const; // 0x0230(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Name__Const; // 0x023C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Name__Const; // 0x0244(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_3_1_Name__Const; // 0x024C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LookAt_1_1___LookAt_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x0258(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookAt_1_1___LookAt_Scale_Factor__Const;           // 0x0270(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LookAt_1_1___LookAt_Rotate_Vector_1_Vector__Const; // 0x0278(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigElementKey>                 LocalVariableDefault__MakeArrayFromStartToEndBone_ChildrenArray__Const; // 0x0290(0x0010)(Edit)
	TArray<struct FRigElementKey>                 LocalVariableDefault__MakeArrayFromStartToEndBone_ParentsArray__Const; // 0x02A0(0x0010)(Edit)
	TArray<struct FRigElementKey>                 LocalVariableDefault__MakeArrayFromStartToEndBone_OutChain__Const; // 0x02B0(0x0010)(Edit)
	bool                                          LocalVariableDefault__MakeArrayFromStartToEndBone_ChainComplete__Const; // 0x02C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Prefix__Const; // 0x02C8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash)
	bool                                          MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Enabled__Const; // 0x02D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenDuration__Const; // 0x02DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenColor__Const; // 0x02E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_1_Prefix__Const; // 0x02F0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash)
	bool                                          MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_bIncludeParent__Const; // 0x0300(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigElementType                               MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_TypeToSearch__Const; // 0x0301(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_302[0x6];                                      // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x0308(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_1_Prefix__Const; // 0x0318(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_Prefix__Const; // 0x0328(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_1_Prefix__Const; // 0x0338(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_Prefix__Const; // 0x0348(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_1_Prefix__Const; // 0x0358(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FRigElementKey>                 LocalVariableDefault__CalculateLengthOfElementChain_NewLocalVar__Const; // 0x0368(0x0010)(Edit)
	bool                                          LocalVariableDefault__CalculateLengthOfElementChain_MathIntEquals_Result__Const; // 0x0378(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalVariableDefault__CalculateLengthOfElementChain_Bones_maxIndex__Const; // 0x037C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalVariableDefault__CalculateLengthOfElementChain_currentDistance__Const; // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalVariableDefault__CalculateLengthOfElementChain_averageDistance__Const; // 0x0384(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_1_B__Const; // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalVariable__FunctionLibrary___CalculateLengthOfElementChain_VariableNode_7_Value__Const; // 0x038C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_Space__Const; // 0x0390(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_Name__Const; // 0x0394(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Index__Const; // 0x039C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_Name__Const; // 0x03A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_5_Name__Const; // 0x03A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Strength__Const; // 0x03B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_Strength__Const; // 0x03B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_HitNotifyCheckFrame__Const; // 0x03B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_B__Const; // 0x03C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariableDefault__GroundConform_SphereTrace_bHit__Const; // 0x03C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariableDefault__GroundConform_FirstSphereTrace_bHit__Const; // 0x03C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA[0x2];                                      // 0x03CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalVariableDefault__GroundConform_CurrentIndex__Const; // 0x03CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         LocalVariableDefault__GroundConform_CurrentElement__Const; // 0x03D0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             LocalVariableDefault__GroundConform_SphereTraceByTraceChannel_WorldSpaceHitResult__Const; // 0x03E0(0x0108)(Edit, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FVector>                        LocalVariableDefault__GroundConform_EffectorPositionCache__Const; // 0x04E8(0x0010)(Edit)
	bool                                          LocalVariableDefault__GroundConform_HasMotion__Const; // 0x04F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LocalVariableDefault__GroundConform_CurrentElementGravity__Const; // 0x0500(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariableDefault__GroundConform_bShouldCheckHitNotify__Const; // 0x0508(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x3];                                      // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         LocalVariableDefault__GroundConform_CurrentControl__Const; // 0x050C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__GroundConform_TargetPosition__Const; // 0x0518(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  LocalVariableDefault__GroundConform_TargetRotation__Const; // 0x0530(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             LocalVariableDefault__GroundConform_ParentTransform__Const; // 0x0550(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             LocalVariableDefault__GroundConform_CurrentTransform__Const; // 0x05B0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalVariableDefault__GroundConform_DistanceToParent__Const; // 0x0610(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614[0x4];                                      // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalVariableDefault__GroundConform_PreviousPosition__Const; // 0x0618(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__GroundConform_Solver_Position__Const; // 0x0630(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__GroundConform_If_4_Result__Const; // 0x0648(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__GroundConform_TrueIn__Const; // 0x0660(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__GroundConform_FalseIn__Const; // 0x0678(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariableDefault__GroundConform_BoolIn__Const; // 0x0690(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        LocalVariableDefault__GroundConform_TracePathPositions_Local__Const; // 0x0698(0x0010)(Edit)
	bool                                          LocalVariableDefault__GroundConform_bHasDynamicBase_LastFrame_Local__Const; // 0x06A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalVariableDefault__GroundConform_TraceHitPosition_Local__Const; // 0x06B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__GroundConform_TraceCenter_Local__Const; // 0x06C8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalVariableDefault__GroundConform_TraceLengthCalculated__Const; // 0x06E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Index__Const; // 0x06E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Name__Const; // 0x06E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigMetaDataNameSpace                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_NameSpace__Const; // 0x06F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Default__Const; // 0x06F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F2[0x2];                                      // 0x06F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Name__Const; // 0x06F4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalVariable__FunctionLibrary___GroundConform_VariableNode_80_Value__Const; // 0x06FC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD[0x3];                                      // 0x06FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GroundConform___GroundConform_Subtract_9_B__Const; // 0x0700(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Name__Const; // 0x0704(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          GroundConform___GroundConform_GetTransform_3_Space__Const; // 0x070C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70D[0x3];                                      // 0x070D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Name__Const; // 0x0710(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x0718(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0x0720(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Name__Const; // 0x072C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Default__Const; // 0x0734(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_Add_2_B__Const;      // 0x0740(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_Clamp_2_Minimum__Const; // 0x0748(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Name__Const; // 0x0750(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Default__Const; // 0x0758(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Name__Const; // 0x075C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0x4];                                      // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Default__Const; // 0x0768(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Name__Const; // 0x0780(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        GroundConform___GroundConform_ArrayAppend_Other__Const; // 0x0788(0x0010)(Edit)
	double                                        GroundConform___GroundConform_Add_9_A__Const;      // 0x0798(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_Add_9_1_A__Const;    // 0x07A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_Multiply_5_B__Const; // 0x07A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_Multiply_4_3_B__Const; // 0x07B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GroundConform___GroundConform_Greater_4_B__Const;  // 0x07B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayMake_Values_1__Const; // 0x07C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               GroundConform___GroundConform_SphereTraceByTraceChannel_TraceChannel__Const; // 0x07D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D9[0x7];                                      // 0x07D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  GroundConform___GroundConform_From_World_4_1_Value__Const; // 0x07E0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_Less_1_B__Const;     // 0x0800(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x0808(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Name__Const; // 0x080C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigMetaDataNameSpace                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_NameSpace__Const; // 0x0814(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_815[0x3];                                      // 0x0815(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Default__Const; // 0x0818(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Name__Const; // 0x0824(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x082C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigMetaDataNameSpace                         LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_NameSpace__Const; // 0x0834(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_835[0x3];                                      // 0x0835(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_6_True__Const; // 0x0838(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_6_False__Const; // 0x0840(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_1_B__Const; // 0x0848(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReorientBone___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x0850(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x0868(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigMetaDataNameSpace                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_NameSpace__Const; // 0x0870(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_871[0x3];                                      // 0x0871(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x0874(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x087C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Name__Const; // 0x0888(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Default__Const; // 0x0890(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_Multiply_17_B__Const; // 0x08B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    GroundConform___GroundConform_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x08B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B9[0x3];                                      // 0x08B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           GroundConform___GroundConform_RigVMFunction_DebugTransformMutableNoSpace_Color__Const; // 0x08BC(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroundConform___GroundConform_RigVMFunction_DebugTransformMutableNoSpace_Thickness__Const; // 0x08CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroundConform___GroundConform_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x08D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4[0xC];                                      // 0x08D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GroundConform___GroundConform_RigVMFunction_DebugTransformMutableNoSpace_WorldOffset__Const; // 0x08E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParentChainLengthConstraint_1___ParentChainLengthConstraint_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0x0940(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_944[0x4];                                      // 0x0944(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GroundConform___GroundConform_If_26_True__Const;   // 0x0948(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_If_26_False__Const;  // 0x0950(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_Interpolate_1_2_B__Const; // 0x0958(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__Solver_PostZConstraint__Const; // 0x0960(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_GreaterEqual_1_B__Const;           // 0x0978(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_Subtract_6_A__Const;               // 0x0980(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_Power_A__Const;                    // 0x0988(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_Multiply_B__Const;                 // 0x0990(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_Clamp_2_1_Minimum__Const;          // 0x0998(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Solver___Solver_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x09A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigMetaDataNameSpace                         Solver___Solver_DISPATCH_RigDispatch_GetMetadata_NameSpace__Const; // 0x09A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A9[0x7];                                      // 0x09A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Solver___Solver_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x09B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_Multiply_7_Multiply_7_B__Const;    // 0x09C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_Remap_1_SourceMaximum__Const;      // 0x09D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_DISPATCH_RigVMDispatch_If_True__Const; // 0x09D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_DISPATCH_RigVMDispatch_If_False__Const; // 0x09E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Solver___Solver_Remap_1_bClamp__Const;             // 0x09E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E9[0x3];                                      // 0x09E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Solver___Solver_Multiply_1_1_B__Const;             // 0x09EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_Greater_3_B__Const;                // 0x09F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Solver___Solver_Scale_2_1_Factor__Const;           // 0x09F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9FC[0x4];                                      // 0x09FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Solver___Solver_Multiply_8_B__Const;               // 0x0A00(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Solver___Solver_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0x0A08(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Solver___Solver_If_2_Condition__Const;             // 0x0A0C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A0D[0x3];                                      // 0x0A0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Solver___Solver_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x0A10(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_Multiply_5_B__Const;               // 0x0A18(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Solver___Solver_Clamp_1_Maximum__Const;            // 0x0A20(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Solver___Solver_Interpolate_T__Const;              // 0x0A28(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParentChainLengthConstraint___ParentChainLengthConstraint_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0x0A2C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x0A30(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x0A48(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigMetaDataNameSpace                         ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_NameSpace__Const; // 0x0A50(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A51[0x3];                                      // 0x0A51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x0A54(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x0A5C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Name__Const; // 0x0A68(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Default__Const; // 0x0A70(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroundConform___GroundConform_SpringInterpQuaternionV2_Strength__Const; // 0x0A90(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroundConform___GroundConform_SpringInterpQuaternionV2_CriticalDamping__Const; // 0x0A94(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_Prefix__Const; // 0x0A98(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash)
	float                                         GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_ScreenDuration__Const; // 0x0AA8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_ScreenColor__Const; // 0x0AAC(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GroundConform___GroundConform_DebugLineItemSpace_1_Color__Const; // 0x0ABC(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACC[0x4];                                      // 0x0ACC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GroundConform___GroundConform_RigVMFunction_MathQuaternionFromTwoVectors_A__Const; // 0x0AD0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GroundConform___GroundConform_DebugRectangleItemSpace_1_Color__Const; // 0x0AE8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_Multiply_8_B__Const; // 0x0AF8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_Multiply_8_1_B__Const; // 0x0B00(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GroundConform___GroundConform_DebugLineItemSpace_1_2_Color__Const; // 0x0B08(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GroundConform___GroundConform_DebugLineItemSpace_1_1_Color__Const; // 0x0B18(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_5_Name__Const; // 0x0B28(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_14_Name__Const; // 0x0B30(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_1_Name__Const; // 0x0B38(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_If_5_True__Const;    // 0x0B40(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GroundConform___GroundConform_If_5_False__Const;   // 0x0B48(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     GroundConform___GroundConform_DrawTransforms_Transforms__Const; // 0x0B50(0x0010)(Edit)
	double                                        GroundConform___GroundConform_Multiply_12_B__Const; // 0x0B60(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GroundConform___GroundConform_Multiply_4_B__Const; // 0x0B68(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    GroundConform___GroundConform_DrawTransforms_Mode__Const; // 0x0B70(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B71[0x7];                                      // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     LocalVariableDefault__DrawTransforms_the_transforms__Const; // 0x0B78(0x0010)(Edit)
	uint8                                         Pad_B88[0x8];                                      // 0x0B88(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DrawTransforms___DrawTransforms_DebugTransformMutableItemSpace_WorldOffset__Const; // 0x0B90(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawTransforms___DrawTransforms_DebugTransformMutableItemSpace_bEnabled__Const; // 0x0BF0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF1[0x3];                                      // 0x0BF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_4_Value__Const; // 0x0BF4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_Color__Const; // 0x0BF8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
