#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialUI

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TutorialUI.TutorialUI_C
// 0x0028 (0x0810 - 0x07E8)
class UTutorialUI_C final : public UUI_Tutorial
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x07F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x07F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 TutorialImage;                                     // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bRemoving;                                         // 0x0808(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddedToViewport();
	void ExecuteUbergraph_TutorialUI(int32 EntryPoint);
	void RemovedFromViewport();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TutorialUI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TutorialUI_C")
	}
	static class UTutorialUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorialUI_C>();
	}
};
DUMPER7_ASSERTS_UTutorialUI_C;

}

