#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TypedElementFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum TypedElementFramework.FTypedElementAlertColumnType
// NumValues: 0x0003
enum class EFTypedElementAlertColumnType : uint8
{
	Error                                    = 0,
	Warning                                  = 1,
	MAX                                      = 2,
};

// Enum TypedElementFramework.ESCCModification
// NumValues: 0x0005
enum class ESCCModification : uint32
{
	Modified                                 = 0,
	Added                                    = 1,
	Removed                                  = 2,
	Conflicted                               = 3,
	ESCCModification_MAX                     = 4,
};

// ScriptStruct TypedElementFramework.EditorDataStorageColumn
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FEditorDataStorageColumn
{
};
#pragma pack(pop)
DUMPER7_ASSERTS_FEditorDataStorageColumn;

// ScriptStruct TypedElementFramework.TypedElementAlertActionColumn
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x10) FTypedElementAlertActionColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementAlertActionColumn;

// ScriptStruct TypedElementFramework.EditorDataStorageTag
// 0x0001 (0x0001 - 0x0000)
struct FEditorDataStorageTag
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FEditorDataStorageTag;

// ScriptStruct TypedElementFramework.FolderTag
// 0x0000 (0x0001 - 0x0001)
struct FFolderTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FFolderTag;

// ScriptStruct TypedElementFramework.ScriptTypedElementHandle
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FScriptTypedElementHandle final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FScriptTypedElementHandle;

// ScriptStruct TypedElementFramework.TypedElementAlertColumn
// 0x0020 (0x0020 - 0x0000)
struct FTypedElementAlertColumn final : public FEditorDataStorageColumn
{
public:
	class FText                                   Message;                                           // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EFTypedElementAlertColumnType                 AlertType;                                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementAlertColumn;

// ScriptStruct TypedElementFramework.TypedElementChildAlertColumn
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FTypedElementChildAlertColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementChildAlertColumn;

// ScriptStruct TypedElementFramework.TypedElementUObjectColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FTypedElementUObjectColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementUObjectColumn;

// ScriptStruct TypedElementFramework.TypedElementUObjectIdColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementUObjectIdColumn final : public FEditorDataStorageColumn
{
public:
	uint32                                        ID;                                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SerialNumber;                                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementUObjectIdColumn;

// ScriptStruct TypedElementFramework.TypedElementExternalObjectColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FTypedElementExternalObjectColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementExternalObjectColumn;

// ScriptStruct TypedElementFramework.TypedElementClassDefaultObjectTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementClassDefaultObjectTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTypedElementClassDefaultObjectTag;

// ScriptStruct TypedElementFramework.TypedElementActorTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementActorTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTypedElementActorTag;

// ScriptStruct TypedElementFramework.TypedElementWorldColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FTypedElementWorldColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementWorldColumn;

// ScriptStruct TypedElementFramework.TypedElementPropertyBagPlaceholderTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementPropertyBagPlaceholderTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTypedElementPropertyBagPlaceholderTag;

// ScriptStruct TypedElementFramework.TypedElementLoosePropertyTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementLoosePropertyTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTypedElementLoosePropertyTag;

// ScriptStruct TypedElementFramework.TypedElementPropertyBagPlaceholderTypeInfoColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FTypedElementPropertyBagPlaceholderTypeInfoColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementPropertyBagPlaceholderTypeInfoColumn;

// ScriptStruct TypedElementFramework.Test_PingPongPrePhys
// 0x0008 (0x0008 - 0x0000)
struct FTest_PingPongPrePhys final : public FEditorDataStorageColumn
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTest_PingPongPrePhys;

// ScriptStruct TypedElementFramework.Test_PingPongDurPhys
// 0x0008 (0x0008 - 0x0000)
struct FTest_PingPongDurPhys final : public FEditorDataStorageColumn
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTest_PingPongDurPhys;

// ScriptStruct TypedElementFramework.Test_PingPongPostPhys
// 0x0008 (0x0008 - 0x0000)
struct FTest_PingPongPostPhys final : public FEditorDataStorageColumn
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTest_PingPongPostPhys;

// ScriptStruct TypedElementFramework.TypedElementWidgetConstructor
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FTypedElementWidgetConstructor
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementWidgetConstructor;

// ScriptStruct TypedElementFramework.SimpleWidgetConstructor
// 0x0000 (0x0028 - 0x0028)
struct FSimpleWidgetConstructor final : public FTypedElementWidgetConstructor
{
};
DUMPER7_ASSERTS_FSimpleWidgetConstructor;

// ScriptStruct TypedElementFramework.TedsRowHandle
// 0x0008 (0x0008 - 0x0000)
struct FTedsRowHandle final
{
public:
	uint64                                        RowHandle;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTedsRowHandle;

// ScriptStruct TypedElementFramework.TableRowParentColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FTableRowParentColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTableRowParentColumn;

// ScriptStruct TypedElementFramework.UnresolvedTableRowParentColumn
// 0x0008 (0x0008 - 0x0000)
struct FUnresolvedTableRowParentColumn final : public FEditorDataStorageColumn
{
public:
	uint64                                        ParentIdHash;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUnresolvedTableRowParentColumn;

// ScriptStruct TypedElementFramework.TypedElementIconOverrideColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementIconOverrideColumn final : public FEditorDataStorageColumn
{
public:
	class FName                                   IconName;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementIconOverrideColumn;

// ScriptStruct TypedElementFramework.TypedElementLabelColumn
// 0x0010 (0x0010 - 0x0000)
struct FTypedElementLabelColumn final : public FEditorDataStorageColumn
{
public:
	class FString                                 Label;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementLabelColumn;

// ScriptStruct TypedElementFramework.TypedElementLabelHashColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementLabelHashColumn final : public FEditorDataStorageColumn
{
public:
	uint64                                        LabelHash;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementLabelHashColumn;

// ScriptStruct TypedElementFramework.ScriptTypedElementListProxy
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FScriptTypedElementListProxy final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FScriptTypedElementListProxy;

// ScriptStruct TypedElementFramework.TypedElementSyncBackToWorldTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSyncBackToWorldTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTypedElementSyncBackToWorldTag;

// ScriptStruct TypedElementFramework.TypedElementSyncFromWorldTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSyncFromWorldTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTypedElementSyncFromWorldTag;

// ScriptStruct TypedElementFramework.TypedElementSyncFromWorldInteractiveTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSyncFromWorldInteractiveTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTypedElementSyncFromWorldInteractiveTag;

// ScriptStruct TypedElementFramework.TypedElementRowReferenceColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FTypedElementRowReferenceColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementRowReferenceColumn;

// ScriptStruct TypedElementFramework.NameColumn
// 0x0008 (0x0008 - 0x0000)
struct FNameColumn final : public FEditorDataStorageColumn
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNameColumn;

// ScriptStruct TypedElementFramework.ObjectOverrideColumn
// 0x0001 (0x0001 - 0x0000)
struct FObjectOverrideColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FObjectOverrideColumn;

// ScriptStruct TypedElementFramework.TypedElementPackageUnresolvedReference
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FTypedElementPackageUnresolvedReference final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementPackageUnresolvedReference;

// ScriptStruct TypedElementFramework.TypedElementPackageReference
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FTypedElementPackageReference final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementPackageReference;

// ScriptStruct TypedElementFramework.TypedElementPackageUpdatedTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementPackageUpdatedTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTypedElementPackageUpdatedTag;

// ScriptStruct TypedElementFramework.TypedElementPackagePathColumn
// 0x0010 (0x0010 - 0x0000)
struct FTypedElementPackagePathColumn final : public FEditorDataStorageColumn
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementPackagePathColumn;

// ScriptStruct TypedElementFramework.TypedElementPackageLoadedPathColumn
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FTypedElementPackageLoadedPathColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementPackageLoadedPathColumn;

// ScriptStruct TypedElementFramework.TypedElementPivotOffset
// 0x0018 (0x0018 - 0x0000)
struct FTypedElementPivotOffset final : public FEditorDataStorageColumn
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementPivotOffset;

// ScriptStruct TypedElementFramework.SCCInChangelistTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCInChangelistTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FSCCInChangelistTag;

// ScriptStruct TypedElementFramework.SCCStagedTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCStagedTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FSCCStagedTag;

// ScriptStruct TypedElementFramework.SCCLockedTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCLockedTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FSCCLockedTag;

// ScriptStruct TypedElementFramework.SCCExternallyEditedTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCExternallyEditedTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FSCCExternallyEditedTag;

// ScriptStruct TypedElementFramework.SCCNotCurrentTag
// 0x0000 (0x0001 - 0x0001)
struct FSCCNotCurrentTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FSCCNotCurrentTag;

// ScriptStruct TypedElementFramework.SCCStatusColumn
// 0x0004 (0x0004 - 0x0000)
struct FSCCStatusColumn final : public FEditorDataStorageColumn
{
public:
	ESCCModification                              Modification;                                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSCCStatusColumn;

// ScriptStruct TypedElementFramework.SCCRevisionId
// 0x0014 (0x0014 - 0x0000)
struct FSCCRevisionId final
{
public:
	uint32                                        ID[0x5];                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSCCRevisionId;

// ScriptStruct TypedElementFramework.SCCRevisionIdColumn
// 0x0014 (0x0014 - 0x0000)
struct FSCCRevisionIdColumn final : public FEditorDataStorageColumn
{
public:
	struct FSCCRevisionId                         RevisionId;                                        // 0x0000(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSCCRevisionIdColumn;

// ScriptStruct TypedElementFramework.SCCExternalRevisionIdColumn
// 0x0014 (0x0014 - 0x0000)
struct FSCCExternalRevisionIdColumn final : public FEditorDataStorageColumn
{
public:
	struct FSCCRevisionId                         RevisionId;                                        // 0x0000(0x0014)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSCCExternalRevisionIdColumn;

// ScriptStruct TypedElementFramework.SCCUserInfo
// 0x0010 (0x0010 - 0x0000)
struct FSCCUserInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSCCUserInfo;

// ScriptStruct TypedElementFramework.SCCExternallyLockedColumn
// 0x0010 (0x0010 - 0x0000)
struct FSCCExternallyLockedColumn final : public FEditorDataStorageColumn
{
public:
	struct FSCCUserInfo                           LockedBy;                                          // 0x0000(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSCCExternallyLockedColumn;

// ScriptStruct TypedElementFramework.TypedElementSelectionColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementSelectionColumn final : public FEditorDataStorageColumn
{
public:
	class FName                                   SelectionSet;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementSelectionColumn;

// ScriptStruct TypedElementFramework.TypedElementSlateWidgetReferenceColumn
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FTypedElementSlateWidgetReferenceColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementSlateWidgetReferenceColumn;

// ScriptStruct TypedElementFramework.TypedElementSlateWidgetReferenceDeletesRowTag
// 0x0000 (0x0001 - 0x0001)
struct FTypedElementSlateWidgetReferenceDeletesRowTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTypedElementSlateWidgetReferenceDeletesRowTag;

// ScriptStruct TypedElementFramework.DisplayNameColumn
// 0x0010 (0x0010 - 0x0000)
struct FDisplayNameColumn final : public FEditorDataStorageColumn
{
public:
	class FText                                   DisplayName;                                       // 0x0000(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDisplayNameColumn;

// ScriptStruct TypedElementFramework.DescriptionColumn
// 0x0010 (0x0010 - 0x0000)
struct FDescriptionColumn final : public FEditorDataStorageColumn
{
public:
	class FText                                   Description;                                       // 0x0000(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDescriptionColumn;

// ScriptStruct TypedElementFramework.SlateColorColumn
// 0x0014 (0x0014 - 0x0000)
struct FSlateColorColumn final : public FEditorDataStorageColumn
{
public:
	struct FSlateColor                            Color;                                             // 0x0000(0x0014)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSlateColorColumn;

// ScriptStruct TypedElementFramework.TestColumnA
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnA final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTestColumnA;

// ScriptStruct TypedElementFramework.TestColumnB
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnB final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTestColumnB;

// ScriptStruct TypedElementFramework.TestColumnC
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnC final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTestColumnC;

// ScriptStruct TypedElementFramework.TestColumnD
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnD final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTestColumnD;

// ScriptStruct TypedElementFramework.TestColumnE
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnE final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTestColumnE;

// ScriptStruct TypedElementFramework.TestColumnF
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnF final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTestColumnF;

// ScriptStruct TypedElementFramework.TestColumnG
// 0x0001 (0x0001 - 0x0000)
struct FTestColumnG final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTestColumnG;

// ScriptStruct TypedElementFramework.TestColumnInt
// 0x0004 (0x0004 - 0x0000)
struct FTestColumnInt final : public FEditorDataStorageColumn
{
public:
	int32                                         TestInt;                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTestColumnInt;

// ScriptStruct TypedElementFramework.TestColumnString
// 0x0010 (0x0010 - 0x0000)
struct FTestColumnString final : public FEditorDataStorageColumn
{
public:
	class FString                                 TestString;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTestColumnString;

// ScriptStruct TypedElementFramework.TestTagColumnA
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnA final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTestTagColumnA;

// ScriptStruct TypedElementFramework.TestTagColumnB
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnB final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTestTagColumnB;

// ScriptStruct TypedElementFramework.TestTagColumnC
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnC final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTestTagColumnC;

// ScriptStruct TypedElementFramework.TestTagColumnD
// 0x0000 (0x0001 - 0x0001)
struct FTestTagColumnD final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTestTagColumnD;

// ScriptStruct TypedElementFramework.TEDSProcessorTestsReferenceColumn
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FTEDSProcessorTestsReferenceColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTEDSProcessorTestsReferenceColumn;

// ScriptStruct TypedElementFramework.TEDSProcessorTests_PrimaryTag
// 0x0000 (0x0001 - 0x0001)
struct FTEDSProcessorTests_PrimaryTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTEDSProcessorTests_PrimaryTag;

// ScriptStruct TypedElementFramework.TEDSProcessorTests_SecondaryTag
// 0x0000 (0x0001 - 0x0001)
struct FTEDSProcessorTests_SecondaryTag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTEDSProcessorTests_SecondaryTag;

// ScriptStruct TypedElementFramework.TEDSProcessorTests_Linked
// 0x0000 (0x0001 - 0x0001)
struct FTEDSProcessorTests_Linked final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FTEDSProcessorTests_Linked;

// ScriptStruct TypedElementFramework.TypedElementLocalTransformColumn
// 0x0060 (0x0060 - 0x0000)
struct FTypedElementLocalTransformColumn final : public FEditorDataStorageColumn
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementLocalTransformColumn;

// ScriptStruct TypedElementFramework.TypedElementClassTypeInfoColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FTypedElementClassTypeInfoColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementClassTypeInfoColumn;

// ScriptStruct TypedElementFramework.TypedElementScriptStructTypeInfoColumn
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FTypedElementScriptStructTypeInfoColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementScriptStructTypeInfoColumn;

// ScriptStruct TypedElementFramework.HideRowFromUITag
// 0x0000 (0x0001 - 0x0001)
struct FHideRowFromUITag final : public FEditorDataStorageTag
{
};
DUMPER7_ASSERTS_FHideRowFromUITag;

// ScriptStruct TypedElementFramework.TypedElementU32IntValueCacheColumn
// 0x0004 (0x0004 - 0x0000)
struct FTypedElementU32IntValueCacheColumn final : public FEditorDataStorageColumn
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementU32IntValueCacheColumn;

// ScriptStruct TypedElementFramework.TypedElementI32IntValueCacheColumn
// 0x0004 (0x0004 - 0x0000)
struct FTypedElementI32IntValueCacheColumn final : public FEditorDataStorageColumn
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementI32IntValueCacheColumn;

// ScriptStruct TypedElementFramework.TypedElementU64IntValueCacheColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementU64IntValueCacheColumn final : public FEditorDataStorageColumn
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementU64IntValueCacheColumn;

// ScriptStruct TypedElementFramework.TypedElementI64IntValueCacheColumn
// 0x0008 (0x0008 - 0x0000)
struct FTypedElementI64IntValueCacheColumn final : public FEditorDataStorageColumn
{
public:
	int64                                         Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementI64IntValueCacheColumn;

// ScriptStruct TypedElementFramework.TypedElementFloatValueCacheColumn
// 0x0004 (0x0004 - 0x0000)
struct FTypedElementFloatValueCacheColumn final : public FEditorDataStorageColumn
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementFloatValueCacheColumn;

// ScriptStruct TypedElementFramework.TypedElementViewportOutlineColorColumn
// 0x0001 (0x0001 - 0x0000)
struct FTypedElementViewportOutlineColorColumn final : public FEditorDataStorageColumn
{
public:
	uint8                                         SelectionOutlineColorIndex;                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementViewportOutlineColorColumn;

// ScriptStruct TypedElementFramework.TypedElementViewportOverlayColorColumn
// 0x0004 (0x0004 - 0x0000)
struct FTypedElementViewportOverlayColorColumn final : public FEditorDataStorageColumn
{
public:
	struct FColor                                 OverlayColor;                                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTypedElementViewportOverlayColorColumn;

}

