#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TypedElementRuntime

#include "Basic.hpp"


namespace SDK
{

// Enum TypedElementRuntime.ETypedElementChildInclusionMethod
// NumValues: 0x0004
enum class ETypedElementChildInclusionMethod : uint8
{
	None                                     = 0,
	Immediate                                = 1,
	Recursive                                = 2,
	ETypedElementChildInclusionMethod_MAX    = 3,
};

// Enum TypedElementRuntime.ETypedElementSelectionMethod
// NumValues: 0x0004
enum class ETypedElementSelectionMethod : uint8
{
	Primary                                  = 0,
	Secondary                                = 1,
	FromSecondary                            = 2,
	ETypedElementSelectionMethod_MAX         = 3,
};

// ScriptStruct TypedElementRuntime.TypedElementSelectionOptions
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FTypedElementSelectionOptions final
{
public:
	bool                                          bAllowHidden;                                      // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAllowGroups;                                      // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAllowLegacyNotifications;                         // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bWarnIfLocked;                                     // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAllowSubRootSelection;                            // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ETypedElementChildInclusionMethod             ChildElementInclusionMethod;                       // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6[0xA];                                        // 0x0006(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementSelectionOptions;

// ScriptStruct TypedElementRuntime.TypedElementSelectionSetState
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FTypedElementSelectionSetState final
{
public:
	TWeakObjectPtr<class UTypedElementSelectionSet> CreatedFromSelectionSet;                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementSelectionSetState;

// ScriptStruct TypedElementRuntime.TypedElementSelectionNormalizationOptions
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FTypedElementSelectionNormalizationOptions final
{
public:
	bool                                          bExpandGroups;                                     // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bFollowAttachment;                                 // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2[0xA];                                        // 0x0002(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementSelectionNormalizationOptions;

// ScriptStruct TypedElementRuntime.TypedElementIsSelectedOptions
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FTypedElementIsSelectedOptions final
{
public:
	bool                                          bAllowIndirect;                                    // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0xB];                                        // 0x0001(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTypedElementIsSelectedOptions;

// ScriptStruct TypedElementRuntime.TypedElementAssetDataReferencedOptions
// 0x0001 (0x0001 - 0x0000)
struct FTypedElementAssetDataReferencedOptions final
{
public:
	bool                                          bOnlyTopLevelAsset;                                // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FTypedElementAssetDataReferencedOptions;

}

