#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Button_Ark_Global_LikeDislike

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UI_Button_Ark_Global_Base_classes.hpp"
#include "cfcore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Button_Ark_Global_LikeDislike.UI_Button_Ark_Global_LikeDislike_C
// 0x0090 (0x0698 - 0x0608)
class UUI_Button_Ark_Global_LikeDislike_C final : public UUI_Button_Ark_Global_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_Button_Ark_Global_LikeDislike_C; // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ECFCoreRatingVoteDirection                    Vote_Action;                                       // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         modId;                                             // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMyRatings                             MyRatings;                                         // 0x0620(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	ECFCoreRatingVoteDirection                    ButtonTrueState;                                   // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishedLikeAction;                              // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           DefaultFillColor;                                  // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentFillColor;                                  // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRatingDetails                         ratings;                                           // 0x0678(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Construct();
	void ExecuteUbergraph_UI_Button_Ark_Global_LikeDislike(int32 EntryPoint);
	bool IsCurrentButtonEnabled();
	void UpdateButtonStatus();
	void UpdateToNewRatingAction();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Button_Ark_Global_LikeDislike_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Button_Ark_Global_LikeDislike_C")
	}
	static class UUI_Button_Ark_Global_LikeDislike_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Button_Ark_Global_LikeDislike_C>();
	}
};
DUMPER7_ASSERTS_UUI_Button_Ark_Global_LikeDislike_C;

}

