#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Button_Player_PlayPause

#include "Basic.hpp"

#include "CFCoreUIWidget_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Button_Player_PlayPause.UI_Button_Player_PlayPause_C
// 0x0038 (0x0870 - 0x0838)
class UUI_Button_Player_PlayPause_C final : public UCFCoreUIWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_Button_Player_PlayPause_C;       // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_FulLWidget;                                 // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Border;                                      // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayerPause;                                 // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Previous;                                  // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClick;                                           // 0x0860(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__UI_Button_ScreenshotNavigation_IMG_PrevImage_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_UI_Button_Player_PlayPause(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Button_Player_PlayPause_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Button_Player_PlayPause_C")
	}
	static class UUI_Button_Player_PlayPause_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Button_Player_PlayPause_C>();
	}
};
DUMPER7_ASSERTS_UUI_Button_Player_PlayPause_C;

}

