#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_BasePage

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_BasePage.UI_BasePage_C.ShouldHideOptionsButton
// 0x0028 (0x0028 - 0x0000)
struct UI_BasePage_C_ShouldHideOptionsButton final
{
public:
	bool                                          ShouldHide;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 CallFunc_GetPrimaryWorld_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BPGetPrimaryMapName_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StriStri_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_BasePage_C_ShouldHideOptionsButton;

// Function UI_BasePage.UI_BasePage_C.GetControlSizeBox
// 0x0008 (0x0008 - 0x0000)
struct UI_BasePage_C_GetControlSizeBox final
{
public:
	class USizeBox*                               SizeBoxForControls;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_BasePage_C_GetControlSizeBox;

// Function UI_BasePage.UI_BasePage_C.CheckHideOptionsButton
// 0x0020 (0x0020 - 0x0000)
struct UI_BasePage_C_CheckHideOptionsButton final
{
public:
	class USizeBox*                               CallFunc_GetControlSizeBox_SizeBoxForControls;     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldHideOptionsButton_ShouldHide;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Button_Ark_Global_Base_C*           CallFunc_GetOptionsButton_OptionsButton;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_BasePage_C_CheckHideOptionsButton;

// Function UI_BasePage.UI_BasePage_C.GetOptionsButton
// 0x0008 (0x0008 - 0x0000)
struct UI_BasePage_C_GetOptionsButton final
{
public:
	class UUI_Button_Ark_Global_Base_C*           OptionsButton;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_BasePage_C_GetOptionsButton;

// Function UI_BasePage.UI_BasePage_C.ExecuteUbergraph_UI_BasePage
// 0x0004 (0x0004 - 0x0000)
struct UI_BasePage_C_ExecuteUbergraph_UI_BasePage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_BasePage_C_ExecuteUbergraph_UI_BasePage;

}

