#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Button_ScreenshotNavigation

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Button_ScreenshotNavigation.UI_Button_ScreenshotNavigation_C.ExecuteUbergraph_UI_Button_ScreenshotNavigation
// 0x0004 (0x0004 - 0x0000)
struct UI_Button_ScreenshotNavigation_C_ExecuteUbergraph_UI_Button_ScreenshotNavigation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_Button_ScreenshotNavigation_C_ExecuteUbergraph_UI_Button_ScreenshotNavigation;

// Function UI_Button_ScreenshotNavigation.UI_Button_ScreenshotNavigation_C.SimulateDisabled
// 0x06F0 (0x06F0 - 0x0000)
struct UI_Button_ScreenshotNavigation_C_SimulateDisabled final
{
public:
	bool                                          Disabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0010(0x0370)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_1;                   // 0x0380(0x0370)()
};
DUMPER7_ASSERTS_UI_Button_ScreenshotNavigation_C_SimulateDisabled;

}

