#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CategoriesSelect

#include "Basic.hpp"

#include "STRUCT_CustomComboBoxOption_structs.hpp"
#include "cfcore_structs.hpp"
#include "STRUCT_SubOptions_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_CategoriesSelect.UI_CategoriesSelect_C.CreateAllCategoriesCategory
// 0x0080 (0x0080 - 0x0000)
struct UI_CategoriesSelect_C_CreateAllCategoriesCategory final
{
public:
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSTRUCT_CustomComboBoxOption           K2Node_MakeStruct_STRUCT_CustomComboBoxOption;     // 0x0010(0x0038)(HasGetValueTypeHash)
	struct FSTRUCT_CustomComboBoxOption           K2Node_MakeStruct_STRUCT_CustomComboBoxOption_1;   // 0x0048(0x0038)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CategoriesSelect_C_CreateAllCategoriesCategory;

// Function UI_CategoriesSelect.UI_CategoriesSelect_C.ExecuteUbergraph_UI_CategoriesSelect
// 0x0120 (0x0120 - 0x0000)
struct UI_CategoriesSelect_C_ExecuteUbergraph_UI_CategoriesSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCFCoreError                           K2Node_CustomEvent_error;                          // 0x0008(0x0038)(ConstParm)
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         K2Node_Event_Current_Class_Category_ID;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTRUCT_CustomComboBoxOption           CallFunc_Array_Get_Item;                           // 0x0050(0x0038)(HasGetValueTypeHash)
	int32                                         CallFunc_Conv_Int64ToInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCFCoreGetCategoriesFilter             CallFunc_MakeGetCategoriesFilter_ReturnValue;      // 0x008C(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_Option;                               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         K2Node_Event_ID;                                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCategory>                      K2Node_CustomEvent_categories;                     // 0x00B0(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(const TArray<struct FCategory>& Categories)> K2Node_CreateDelegate_OutputDelegate; // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x010C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CategoriesSelect_C_ExecuteUbergraph_UI_CategoriesSelect;

// Function UI_CategoriesSelect.UI_CategoriesSelect_C.FilterOutCategories
// 0x01A0 (0x01A0 - 0x0000)
struct UI_CategoriesSelect_C_FilterOutCategories final
{
public:
	TArray<struct FCategory>                      Categories;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCategory                              CallFunc_Array_Get_Item;                           // 0x0020(0x0078)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Int32_AddOne_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_CustomComboBoxOption           K2Node_MakeStruct_STRUCT_CustomComboBoxOption;     // 0x00A8(0x0038)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCategory                              CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0078)()
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTRUCT_SubOptions                     K2Node_MakeStruct_STRUCT_SubOptions;               // 0x0168(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue_1;      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CategoriesSelect_C_FilterOutCategories;

// Function UI_CategoriesSelect.UI_CategoriesSelect_C.OnCategoriesInfoFound
// 0x0010 (0x0010 - 0x0000)
struct UI_CategoriesSelect_C_OnCategoriesInfoFound final
{
public:
	TArray<struct FCategory>                      Categories;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UI_CategoriesSelect_C_OnCategoriesInfoFound;

// Function UI_CategoriesSelect.UI_CategoriesSelect_C.OnCategoriesInfoFound_Error
// 0x0038 (0x0038 - 0x0000)
struct UI_CategoriesSelect_C_OnCategoriesInfoFound_Error final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UI_CategoriesSelect_C_OnCategoriesInfoFound_Error;

// Function UI_CategoriesSelect.UI_CategoriesSelect_C.OnOptionSelectedInterface
// 0x0018 (0x0018 - 0x0000)
struct UI_CategoriesSelect_C_OnOptionSelectedInterface final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int64                                         ID;                                                // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CategoriesSelect_C_OnOptionSelectedInterface;

// Function UI_CategoriesSelect.UI_CategoriesSelect_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_CategoriesSelect_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CategoriesSelect_C_PreConstruct;

// Function UI_CategoriesSelect.UI_CategoriesSelect_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_CategoriesSelect_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CategoriesSelect_C_Tick;

// Function UI_CategoriesSelect.UI_CategoriesSelect_C.UpdateOptions
// 0x0008 (0x0008 - 0x0000)
struct UI_CategoriesSelect_C_UpdateOptions final
{
public:
	int64                                         Current_Class_Category_ID;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_CategoriesSelect_C_UpdateOptions;

}

