#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CategoriesSelect

#include "Basic.hpp"

#include "UI_CustomComboBox_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CategoriesSelect.UI_CategoriesSelect_C
// 0x0050 (0x1500 - 0x14B0)
class UUI_CategoriesSelect_C final : public UUI_CustomComboBox_C
{
public:
	uint8                                         Pad_14A1[0x7];                                     // 0x14A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_CategoriesSelect_C;              // 0x14A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void()>              OnGenerated;                                       // 0x14B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int64                                         CurrentClassCategoryID;                            // 0x14C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Temp;                                              // 0x14C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int64                                         SelectedCategoryID;                                // 0x14D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_ParentBrowser_C*                    UI_ParentPage;                                     // 0x14E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnOptionChangedIGuess;                             // 0x14E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CreateAllCategoriesCategory();
	void ExecuteUbergraph_UI_CategoriesSelect(int32 EntryPoint);
	void FilterOutCategories(TArray<struct FCategory>& Categories);
	void OnCategoriesInfoFound(const TArray<struct FCategory>& Categories);
	void OnCategoriesInfoFound_Error(const struct FCFCoreError& Error);
	void OnOptionSelectedInterface(const class FString& Option, int64 ID);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateOptions(int64 Current_Class_Category_ID);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_CategoriesSelect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_CategoriesSelect_C")
	}
	static class UUI_CategoriesSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CategoriesSelect_C>();
	}
};
DUMPER7_ASSERTS_UUI_CategoriesSelect_C;

}

