#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CustomizeColorSlot

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CustomizeColorSlot.UI_CustomizeColorSlot_C
// 0x0040 (0x03B8 - 0x0378)
class UUI_CustomizeColorSlot_C : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                BOARDER_Color;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Slot;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_NameOfOption;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ThemeCustomizer_C*                  CustomizerParent;                                  // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Slot_Name;                                         // 0x03A0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UUI_StoreMenu_C*                        StoreMenu;                                         // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void GetColor(struct FLinearColor* Color);
	void SetColor(const struct FLinearColor& Color);
	void GetCurrentTheme(struct FCFCoreThemeRowData* CurrentTheme);
	void OnInitialized();
	void BndEvt__UI_CustomizeColorSlot_Button_Slot_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void CustomEvent_0();
	void ExecuteUbergraph_UI_CustomizeColorSlot(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_CustomizeColorSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_CustomizeColorSlot_C")
	}
	static class UUI_CustomizeColorSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CustomizeColorSlot_C>();
	}
};
DUMPER7_ASSERTS_UUI_CustomizeColorSlot_C;

}

