#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CustomizeBoolSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ShooterGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CustomizeBoolSlot.UI_CustomizeBoolSlot_C
// 0x0038 (0x03B0 - 0x0378)
class UUI_CustomizeBoolSlot_C final : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCheckBox*                              CheckBox_285;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_NameOfOption;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ThemeCustomizer_C*                  CustomizerParent;                                  // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Slot_Name;                                         // 0x0398(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UUI_StoreMenu_C*                        StoreMenu;                                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_CustomizeBoolSlot_CheckBox_285_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void ExecuteUbergraph_UI_CustomizeBoolSlot(int32 EntryPoint);
	void GetColor(struct FLinearColor* Color);
	void GetCurrentTheme(struct FCFCoreThemeRowData* CurrentTheme);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetColor(const struct FLinearColor& Color);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_CustomizeBoolSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_CustomizeBoolSlot_C")
	}
	static class UUI_CustomizeBoolSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CustomizeBoolSlot_C>();
	}
};
DUMPER7_ASSERTS_UUI_CustomizeBoolSlot_C;

}

