#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ExpandedModSlot

#include "Basic.hpp"

#include "cfcore_ui_structs.hpp"
#include "Engine_structs.hpp"
#include "CFCoreUIWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ExpandedModSlot.UI_ExpandedModSlot_C
// 0x0648 (0x0E80 - 0x0838)
class UUI_ExpandedModSlot_C final : public UCFCoreUIWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_ExpandedModSlot_C;               // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnBeginPlay;                                       // 0x0840(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0848(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Background;                                 // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Box_Card_OutOfDate;                                // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Box_Card_Purchased;                                // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               HB_ModCards;                                       // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_AddonsIcon_1;                                  // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BackgroundImageDuplicate;                      // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_ModPreviewThumbnail;                           // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ModCards;                                  // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_AuthorName;                                   // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_ModName;                                      // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_ModSummary;                                   // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_InstallSwitcher_C*           UI_Button_InstallSwitcher;                         // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Back_C*           UI_Button_UninstallSelected;                       // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Back_C*           UI_Button_ViewModSelected;                         // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Overlay_C*                          UI_Overlay;                                        // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Like;                                              // 0x08D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnModInstalledComplete;                            // 0x08E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnModInstall;                                      // 0x08F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUI_StoreMenu_C*                        StoreMenuRef;                                      // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnDisableClicked;                                  // 0x0908(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<EGameModsEvent>                        evts;                                              // 0x0918(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FInstallProgressMod                    ModInfo;                                           // 0x0928(0x0538)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	class FString                                 ImageUrl;                                          // 0x0E60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          DebugScreenshotDownloading;                        // 0x0E70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E71[0x7];                                      // 0x0E71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_ModPage_C*                          AssociatedModPage;                                 // 0x0E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Animation_UpdateModImage(class UImage* IMG_GameImage);
	void ApplyThemeSettingsToAll();
	void BndEvt__UI_ExpandedModSlot_UI_Button_InstallSwitcher_K2Node_ComponentBoundEvent_3_OnClickUpdate_B__DelegateSignature();
	void BndEvt__UI_ExpandedModSlot_UI_Button_UninstallSelected_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature();
	void BndEvt__UI_ExpandedModSlot_UI_Button_ViewModSelected_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void CancelInstallation();
	void Construct();
	void Destruct();
	void DownloadImage();
	void Event_On_Uninstall_Pressed();
	void Event_View_Mod_Page();
	void ExecuteUbergraph_UI_ExpandedModSlot(int32 EntryPoint);
	void FormatDownloadNumber(int64 Downloads, class FText* FinalAmount);
	class UWidget* GenerateAuthorNameToolTipWidget();
	class UWidget* GenerateModNameToolTipWidget();
	void GetAuthors(class FString* CombinedAuthorsNames);
	void GetDownloadCount(class FText* FinalAmount);
	void GetModName(class FString* Name_0);
	void GetModSize(class FText* Result);
	void InitModInfo(const struct FInstallProgressMod& NewModInfo);
	void InstallMod();
	bool OnEventBroadcasted(EGameModsEvent evt, const TArray<struct FInstallProgressMod>& ModsList, const struct FCFCoreApiResponsePagination& pagination);
	void OnFail_99B1ABC24A7099A526173E84E0B7AC9A(class UTexture2DDynamic* Texture);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnReturnClicked_Event_0();
	void OnSuccess_99B1ABC24A7099A526173E84E0B7AC9A(class UTexture2DDynamic* Texture);
	void PlayStartingAnimation();
	void ResetWidget();
	void SequenceEvent__ENTRYPOINTUI_ExpandedModSlot(class UImage* IMG_GameImage);
	void ToggleUpdateButtonVisibility();
	void Update_LikeStatus();
	void UpdateAuthors();
	void UpdateImage();
	void UpdateMod();
	void UpdateModDownloadCount();
	void UpdateModName();
	void UpdateModRating();
	void UpdateModSize();
	void UpdateModSummary();
	void UpdatePaidPremiumStatus();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_ExpandedModSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_ExpandedModSlot_C")
	}
	static class UUI_ExpandedModSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ExpandedModSlot_C>();
	}
};
DUMPER7_ASSERTS_UUI_ExpandedModSlot_C;

}

