#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HelpPage

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_HelpPage.UI_HelpPage_C.BPHandleDockedModeChange
// 0x0001 (0x0001 - 0x0000)
struct UI_HelpPage_C_BPHandleDockedModeChange final
{
public:
	bool                                          bIsDocked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_HelpPage_C_BPHandleDockedModeChange;

// Function UI_HelpPage.UI_HelpPage_C.ExecuteUbergraph_UI_HelpPage
// 0x0038 (0x0038 - 0x0000)
struct UI_HelpPage_C_ExecuteUbergraph_UI_HelpPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDocked;                            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_Select_Default;                             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UI_HelpPage_C_ExecuteUbergraph_UI_HelpPage;

// Function UI_HelpPage.UI_HelpPage_C.GetSizeboxForExtraHandheldScaling
// 0x0008 (0x0008 - 0x0000)
struct UI_HelpPage_C_GetSizeboxForExtraHandheldScaling final
{
public:
	class USizeBox*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_HelpPage_C_GetSizeboxForExtraHandheldScaling;

// Function UI_HelpPage.UI_HelpPage_C.GetWidgetToScaleForHandheld
// 0x0008 (0x0008 - 0x0000)
struct UI_HelpPage_C_GetWidgetToScaleForHandheld final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_HelpPage_C_GetWidgetToScaleForHandheld;

}

