#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_InstallationStatus

#include "Basic.hpp"

#include "CFCoreUIWidget_classes.hpp"
#include "Engine_structs.hpp"
#include "cfcore_ui_structs.hpp"
#include "cfcore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_InstallationStatus.UI_InstallationStatus_C
// 0x0040 (0x0878 - 0x0838)
class UUI_InstallationStatus_C final : public UCFCoreUIWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_InstallationStatus_C;            // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0840(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0848(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Boarder_FullWindow;                                // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_InstallProgress;                       // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Status;                                       // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameSlot_C*                         UI_GameSlot;                                       // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EInstallStatus                                Installation_Status;                               // 0x0870(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x0871(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInstallStatus                                PreNotifState;                                     // 0x0872(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Event_Set_Bindings_To_Game_Slot(class UUI_GameSlot_C* GameSlot);
	void ExecuteUbergraph_UI_InstallationStatus(int32 EntryPoint);
	double GetTrueProgress(int32 Amount, ELibraryProgressState InstalationState, bool* MaintainPreviousValue);
	void PlayNotificationUpdate(double Duration, const class FText& Message);
	void SetTextBasedOnState(EInstallStatus Index_0);
	void UpdateColor(EInstallStatus Install_Status);
	void UpdateModProgress(int32 progress, EInstallStatus NewInstallationStatus, ELibraryProgressState InstallationPhase);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_InstallationStatus_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_InstallationStatus_C")
	}
	static class UUI_InstallationStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_InstallationStatus_C>();
	}
};
DUMPER7_ASSERTS_UUI_InstallationStatus_C;

}

