#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Loading

#include "Basic.hpp"

#include "CFCoreUIWidget_classes.hpp"
#include "Engine_structs.hpp"
#include "ENUM_LoadingProgress_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Loading.UI_Loading_C
// 0x0038 (0x0870 - 0x0838)
class UUI_Loading_C final : public UCFCoreUIWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_Loading_C;                       // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           ProgressBar_InstallProgress;                       // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Loading;                                   // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_RT_3;                                         // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Interp;                                            // 0x0858(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_859[0x7];                                      // 0x0859(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TargetLoading;                                     // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_LoadingProgress                          CurrentPhaseOfLoad;                                // 0x0868(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_Loading(int32 EntryPoint);
	ENUM_LoadingProgress GetNextSafePhase();
	double GetPhaseValues(ENUM_LoadingProgress Index_0);
	void PauseLoading();
	void ResetLoading();
	void RestartLoading();
	void SetLoadingStage(ENUM_LoadingProgress Loading_Stage);
	void StartLoading();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Loading_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Loading_C")
	}
	static class UUI_Loading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Loading_C>();
	}
};
DUMPER7_ASSERTS_UUI_Loading_C;

}

