#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MilestonesFeedNotificationBP

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MilestonesFeedNotificationBP.UI_MilestonesFeedNotificationBP_C
// 0x00C0 (0x0878 - 0x07B8)
class UUI_MilestonesFeedNotificationBP_C final : public UUI_MilestonesNotificationFeed
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           NotifiesPanel;                                     // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, class UW_MilestoneNotificationBP_C*> Notifies;                                 // 0x07C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class FName, double>                     LastMilestoneProgress;                             // 0x0818(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                Tresholds;                                         // 0x0868(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CalculateTresholdProgress(double progress, int32* Index_0);
	void ExecuteUbergraph_UI_MilestonesFeedNotificationBP(int32 EntryPoint);
	void OnDestruct_Event(class FName ID);
	void PushMilestoneNotify(const class FName MilestoneID, const float NewProgress, const bool LockNotification);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_MilestonesFeedNotificationBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_MilestonesFeedNotificationBP_C")
	}
	static class UUI_MilestonesFeedNotificationBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MilestonesFeedNotificationBP_C>();
	}
};
DUMPER7_ASSERTS_UUI_MilestonesFeedNotificationBP_C;

}

