#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_NotifNoResultsFound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CFCoreUIWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_NotifNoResultsFound.UI_NotifNoResultsFound_C
// 0x0028 (0x0860 - 0x0838)
class UUI_NotifNoResultsFound_C final : public UCFCoreUIWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_NotifNoResultsFound_C;           // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IMG_NoResultsBackground;                           // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              MultiLineEditableTextBox;                          // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Notif_NoResultsFound;                              // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_SearchModName;                                // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ApplyThemeSettingsToAll();
	void Construct();
	void ExecuteUbergraph_UI_NotifNoResultsFound(int32 EntryPoint);
	void UpdateWidget(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_NotifNoResultsFound_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_NotifNoResultsFound_C")
	}
	static class UUI_NotifNoResultsFound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_NotifNoResultsFound_C>();
	}
};
DUMPER7_ASSERTS_UUI_NotifNoResultsFound_C;

}

