#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Notification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CFCoreUIWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Notification.UI_Notification_C
// 0x0098 (0x08D0 - 0x0838)
class UUI_Notification_C final : public UCFCoreUIWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_Notification_C;                  // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PopIn;                                             // 0x0840(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                BUTTON_MENU;                                       // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ModInstalled;                               // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_1;                                          // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BG_3;                                          // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Thumbnail;                                     // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_MainMessage;                                  // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_SecondaryMessage;                             // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Overlay_C*                          UI_Overlay;                                        // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Overlay_C*                          UI_Overlay_1;                                      // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Main_Text;                                         // 0x0898(0x0010)(Edit, BlueprintVisible)
	class FText                                   SecondaryText;                                     // 0x08A8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          AnimationFinished;                                 // 0x08B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B9[0x7];                                      // 0x08B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ThumnailURL;                                       // 0x08C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__ModSuccessfullyInsalledWidget_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void CreateAndPlayAnimation(class UTexture2D* ForcedThumbnail, class UTexture2DDynamic* Texture, const class FString& thumbnailUrl, const class FText& MainText, const class FText& SecondaryText_0);
	void Debug();
	void Download_Thumbnail(const class FString& thumbnailUrl);
	void EnterAnimation();
	void Event_Init();
	void ExecuteUbergraph_UI_Notification(int32 EntryPoint);
	void ExitAnimation();
	void OnClicked();
	void OnFail_E84A8D0E4FF41AB6F8FDA4A13C0CED23(class UTexture2DDynamic* Texture);
	void OnSuccess_E84A8D0E4FF41AB6F8FDA4A13C0CED23(class UTexture2DDynamic* Texture);
	void PopInAnimation();
	void PreConstruct(bool IsDesignTime);
	void RequestExit();
	void ResetClick();
	void SetMainMessage(const class FText& InText);
	void SetSecondaryMessage(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Notification_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Notification_C")
	}
	static class UUI_Notification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Notification_C>();
	}
};
DUMPER7_ASSERTS_UUI_Notification_C;

}

