#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ParentBrowser

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "cfcore_ui_structs.hpp"
#include "ENUM_SideTabs_structs.hpp"
#include "Engine_structs.hpp"
#include "ENUM_TimeFilters_structs.hpp"
#include "cfcore_structs.hpp"
#include "UI_BasePage_classes.hpp"
#include "UMG_structs.hpp"
#include "ENUM_InputDevices_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ParentBrowser.UI_ParentBrowser_C
// 0x01C0 (0x0A28 - 0x0868)
class UUI_ParentBrowser_C : public UUI_BasePage_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_ParentBrowser_C;                 // 0x0868(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0870(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_FilterBy;                            // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_FilterByPremium;                     // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_FilterByTime;                        // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_FilterClasses;                       // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              MultiLineEditableTextBox_1;                        // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_NoModsInstalledFound_C*             Notif_NoInstalledMods;                             // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_NoModsFoundInCategoty_C*            Notif_NoModsInThisCategory;                        // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Notif_NoModsProjects;                              // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_CategorySwap;                              // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Dropdowns;                                 // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_GridList;                                  // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Pagination;                                // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Filters;                                      // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Filters_1;                                    // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Pages;                                        // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Back_C*           UI_Button_Ark_Global_Back_234;                     // 0x08F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Base_C*           UI_Button_UninstallAllMods;                        // 0x08F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Base_C*           UI_Button_UpdateAllMods;                           // 0x0900(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CategoriesSelect_C*                 UI_CategoriesSelect;                               // 0x0908(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CategoriesSelect_C*                 UI_Filter_Classes;                                 // 0x0910(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameSlot_C*                         UI_GameSlot;                                       // 0x0918(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameSlot_C*                         UI_GameSlot_1;                                     // 0x0920(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameSlot_C*                         UI_GameSlot_2;                                     // 0x0928(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameSlot_C*                         UI_GameSlot_3;                                     // 0x0930(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameSlot_C*                         UI_GameSlot_4;                                     // 0x0938(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameSlot_C*                         UI_GameSlot_5;                                     // 0x0940(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameSlot_C*                         UI_GameSlot_6;                                     // 0x0948(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameSlot_C*                         UI_GameSlot_7;                                     // 0x0950(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameSlot_C*                         UI_GameSlot_8;                                     // 0x0958(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_GameSlot_C*                         UI_GameSlot_266;                                   // 0x0960(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_NotifNoResultsFound_C*              UI_NoResultsFound;                                 // 0x0968(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_PaginationLeftRight_C*              UI_PaginationLeft;                                 // 0x0970(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_PaginationLeftRight_C*              UI_PaginationRight;                                // 0x0978(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CustomComboBox_C*                   UI_PremiumFilters;                                 // 0x0980(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CustomComboBox_C*                   UI_SortBySelect;                                   // 0x0988(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CustomComboBox_C*                   UI_TimeFilters;                                    // 0x0990(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel_GameSlots;                        // 0x0998(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Status;                             // 0x09A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Pages;                                             // 0x09A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PageNum;                                           // 0x09AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECFCorePremiumFilterType                      Filter_DefaultPremiumOption;                       // 0x09B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECFCorePremiumFilterType                      Filter_CurrentPremiumOption;                       // 0x09B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECFCoreModsSearchSortField                    Filter_DefaultSortByOption;                        // 0x09B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECFCoreModsSearchSortField                    Filter_CurrentSortByOption;                        // 0x09B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B4[0x4];                                      // 0x09B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CurrentSearchInput;                                // 0x09B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 GameVersion;                                       // 0x09C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 searchFilter;                                      // 0x09D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         SearchTotalModsResultCount;                        // 0x09E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_TimeFilters                              Filter_DefaultTimeOption;                          // 0x09EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENUM_TimeFilters                              Filter_CurrentTimeOption;                          // 0x09ED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9EE[0x2];                                      // 0x09EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGameModsEvent>                        evts;                                              // 0x09F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         ThumbnailsRequested;                               // 0x0A00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ImageDownloadingRow;                               // 0x0A10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A14[0x4];                                      // 0x0A14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstallProgressMod>            TrueModInfo;                                       // 0x0A18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void GetMods();
	void ExecuteUbergraph_UI_ParentBrowser(int32 EntryPoint);
	void CreateEmptySlot(int32 AtIndex);
	bool BPEscapeClosed();
	void EnableClassesDropdown();
	ESlateVisibility SetVisibilityOfUninstallAllMods();
	ESlateVisibility SetVisibilityOfUpdateAllMods();
	class FString Translate_OptionsFilter(ECFCoreModsSearchSortField ENUM_Option);
	class FString Translate_PremiumFilter(ECFCorePremiumFilterType Index_0);
	void FilterSort_Premium(ECFCorePremiumFilterType Default_Premium_FIlter);
	void PlayFadeOutAnim();
	void PlayFadeIn();
	void GetAllModsIDs(TArray<int64>* List);
	bool MoreImagesLeftToDownload();
	void GetModIndexesForCurrentRow(int32* First, int32* Last);
	void DownloadNextBatchOfMods();
	void DownloadBatchOfMods();
	void CheckIfImagesAreReady();
	void DownloadImagesInAllMods();
	void SwitchControllerAction(const struct FKey& Key, EViewState State);
	class UWidget* Nav_Down_from_DropdownTime(EUINavigation Navigation_0);
	class UWidget* Nav_Down_from_DropdownSort(EUINavigation Navigation_0);
	class UWidget* Nav_Down_from_DropdownCategory(EUINavigation Navigation_0);
	class UWidget* Nav_for_Up_Move_from_List(EUINavigation Navigation_0);
	void SetNavigationRuleForList();
	void SetListFocus();
	void CloseAllDropdownApartFrom(class UUI_CustomComboBox_C* Dropdown);
	void CloseAllDropDown();
	void BindToDropdown();
	void SetEnableStageForGameSlot(bool EnableStage);
	void ReturnModsOfCurrentPage(TArray<struct FInstallProgressMod>& Mod_List, TArray<struct FInstallProgressMod>* TrueModInfo_0);
	void UpdateNotificationInSwitcher();
	void InitWidgetStoreMenuRefs();
	void UpdateAllThemeSettings();
	void UpdateSearchText();
	void LoadSavedUpImagesAsync();
	void InitiliazeImageDownloads(bool* ReadyToStart);
	void CalculateModsPerRow(int32* mods);
	void CalculateModsPerPage(int32* mods);
	void PrevPage();
	void NextPage();
	void GetCurrentSearchInput(class FText* CurrentSearchInput_0);
	void ResetPageNum();
	void BuildPage();
	void SetStypleOfPageArrowsButtons();
	void UpdatePaginations(const TArray<struct FInstallProgressMod>& TotalList);
	struct FCFCoreSearchModsFilter FilterModInfo();
	void ClearAllModsInPage();
	void BindToGameSlot();
	void UpdatePagesPagination();
	void CreateModSlot(int32 AtIndex);
	void UpdateClasses();
	void FilterSort_Time(ENUM_TimeFilters SelectedDefaultOption);
	void FilterSort_Options(ECFCoreModsSearchSortField SelectedDefaultOption);
	void FilterSort_ClassFilter();
	void SelectClass();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void CheckWhichTextAppearsFirst(const class FText& NameOne, const class FText& NameTwo, bool* Name_One_Appears_First);
	void Event_On_Input_Device_Changed(ENUM_InputDevices device);
	void BndEvt__ParentPageWidget_SortBySelect_K2Node_ComponentBoundEvent_4_OnOptionSelected__DelegateSignature(const class FString& Option);
	void Event_Update_Filter_By_Options(int64 Current_Class_Category_ID);
	void UpdateSearch(const class FText& SearchInput);
	void Event_Search_Mods();
	void FillTheModList();
	void OnSearch(const class FText& Search_Input);
	void ButtonCall(const struct FKey& Key, EViewState State);
	void BindControllerAction();
	void NextPageButton();
	void PrevPageButton();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__UI_ParentPage_UI_PaginationLeftRight_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature();
	void BndEvt__UI_ParentPage_UI_PaginationRight_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature();
	void ReloadPage();
	void ConstructPage();
	void BndEvt__UI_ParentBrowser_UI_PremiumFilters_K2Node_ComponentBoundEvent_2_OnOptionSelected__DelegateSignature(const class FString& Option);
	void BndEvt__UI_ParentBrowser_UI_Button_Ark_Global_Back_234_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature();
	void BndEvt__UI_ParentBrowser_UI_Filter_Classes_K2Node_ComponentBoundEvent_0_OnOptionSelected__DelegateSignature(const class FString& Option);
	void BndEvt__UI_ParentBrowser_UI_Filter_Classes_K2Node_ComponentBoundEvent_7_OnOptionChangedIGuess__DelegateSignature();
	void BndEvt__UI_ParentBrowser_UI_CategoriesSelect_K2Node_ComponentBoundEvent_6_OnOptionChangedIGuess__DelegateSignature();
	void BndEvt__UI_ParentBrowser_UI_CategoriesSelect_K2Node_ComponentBoundEvent_8_OnOptionSelected__DelegateSignature(const class FString& Option);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_ParentBrowser_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_ParentBrowser_C")
	}
	static class UUI_ParentBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ParentBrowser_C>();
	}
};
DUMPER7_ASSERTS_UUI_ParentBrowser_C;

}

