#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PrivacyAndTerms_2

#include "Basic.hpp"

#include "cfcore_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_PrivacyAndTerms_2.UI_PrivacyAndTerms_2_C.Event Update Terms Of Use On Error
// 0x0038 (0x0038 - 0x0000)
struct UI_PrivacyAndTerms_2_C_Event_Update_Terms_Of_Use_On_Error final
{
public:
	struct FCFCoreError                           Error;                                             // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UI_PrivacyAndTerms_2_C_Event_Update_Terms_Of_Use_On_Error;

// Function UI_PrivacyAndTerms_2.UI_PrivacyAndTerms_2_C.ExecuteUbergraph_UI_PrivacyAndTerms_2
// 0x01A0 (0x01A0 - 0x0000)
struct UI_PrivacyAndTerms_2_C_ExecuteUbergraph_UI_PrivacyAndTerms_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCFCoreSubsystem*                       CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FTerms& Terms)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCFCoreError& Error)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0044(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0058(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0070(0x0014)()
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTerms                                 K2Node_CustomEvent_terms;                          // 0x0088(0x00D0)(ConstParm)
	struct FCFCoreError                           K2Node_CustomEvent_error;                          // 0x0158(0x0038)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0190(0x0010)()
};
DUMPER7_ASSERTS_UI_PrivacyAndTerms_2_C_ExecuteUbergraph_UI_PrivacyAndTerms_2;

// Function UI_PrivacyAndTerms_2.UI_PrivacyAndTerms_2_C.OnSuccess_UpdateTermsOfUse
// 0x00D0 (0x00D0 - 0x0000)
struct UI_PrivacyAndTerms_2_C_OnSuccess_UpdateTermsOfUse final
{
public:
	struct FTerms                                 Terms;                                             // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UI_PrivacyAndTerms_2_C_OnSuccess_UpdateTermsOfUse;

// Function UI_PrivacyAndTerms_2.UI_PrivacyAndTerms_2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_PrivacyAndTerms_2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PrivacyAndTerms_2_C_PreConstruct;

}

