#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Sub_Categories_Scroll

#include "Basic.hpp"

#include "STRUCT_SubOptions_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CFCoreUIWidget_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Sub-Categories_Scroll.UI_Sub-Categories_Scroll_C
// 0x0768 (0x0FA0 - 0x0838)
class UUI_Sub_Categories_Scroll_C final : public UCFCoreUIWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_Sub_Categories_Scroll_C;         // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Category_Button;                                   // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBar_Categories;                              // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CustomComboBox_C*                   CustomComboBoxWidget_Ref;                          // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUI_CustomComboBoxOption_C*             CustomComboBoxOptionWidget_Ref;                    // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class FString>                         SubCategoriesDEP;                                  // 0x0860(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsCategoryHovered;                                 // 0x0870(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHoveredWidget;                                   // 0x0871(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_872[0x6];                                      // 0x0872(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& SubCategory, int64 SubCategoryID)> OnSubcategorySelect; // 0x0878(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              PreRemoval;                                        // 0x0888(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	uint8                                         Pad_898[0x8];                                      // 0x0898(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           ButtonUnselectedStyle;                             // 0x08A0(0x0370)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FButtonStyle                           ButtonSelectedStyle;                               // 0x0C10(0x0370)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<struct FSTRUCT_SubOptions>             SubOptions;                                        // 0x0F80(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          IsScrollHovered;                                   // 0x0F90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Sub_Categories_Scroll_Btn_Category_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Sub_Categories_Scroll_Btn_Category_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Event_Check_If_Selected(class UUI_Sub_Category_C* SubCategoryWidget_Ref, const class FString& Text);
	void Event_Create_Scroll();
	void Event_Is_Still_Hovered();
	void Event_On_Subcategory_Select_Event(const class FString& SubCategory, int64 SubCategoryID);
	void ExecuteUbergraph_UI_Sub_Categories_Scroll(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnInitialized();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Sub-Categories_Scroll_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Sub-Categories_Scroll_C")
	}
	static class UUI_Sub_Categories_Scroll_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Sub_Categories_Scroll_C>();
	}
};
DUMPER7_ASSERTS_UUI_Sub_Categories_Scroll_C;

}

