#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Sub_Category

#include "Basic.hpp"

#include "STRUCT_SubOptions_structs.hpp"
#include "Engine_structs.hpp"
#include "CFCoreUIWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Sub-Category.UI_Sub-Category_C
// 0x0058 (0x0890 - 0x0838)
class UUI_Sub_Category_C final : public UCFCoreUIWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_Sub_Category_C;                  // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Category;                                   // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Fire;                                          // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Category;                                     // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& SubCategory, int64 SubCategoryID)> OnSubCategoryClicked; // 0x0858(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSTRUCT_SubOptions                     CategoryInfo;                                      // 0x0868(0x0028)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__Sub_Category1_Btn_Category_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void Event_Set_Button_Style(const struct FButtonStyle& InStyle);
	void ExecuteUbergraph_UI_Sub_Category(int32 EntryPoint);
	void OnFail_B7C25CB3474DE2A4D0BC4DAA4F40DDC8(class UTexture2DDynamic* Texture);
	void OnSuccess_B7C25CB3474DE2A4D0BC4DAA4F40DDC8(class UTexture2DDynamic* Texture);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Sub-Category_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Sub-Category_C")
	}
	static class UUI_Sub_Category_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Sub_Category_C>();
	}
};
DUMPER7_ASSERTS_UUI_Sub_Category_C;

}

