#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_StoreMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "cfcore_ui_structs.hpp"
#include "UMG_structs.hpp"
#include "ENUM_SideTabs_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ENUM_InputDevices_structs.hpp"
#include "CFCoreUIWidget_MainModShop_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_StoreMenu.UI_StoreMenu_C
// 0x09C0 (0x1260 - 0x08A0)
class UUI_StoreMenu_C final : public UCFCoreUIWidget_MainModShop_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_StoreMenu_C;                     // 0x08A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InitialFadeIn;                                     // 0x08A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_BackgroundInputConsumer;                    // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_X_ReturnCancelSearch;                       // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Tabs;                                // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_BackGround;                                    // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_SearchBack;                                    // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_SearchBar;                                 // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PageTitle;                                    // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_ResultsText;                                  // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_SearchText;                                   // 0x08F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       TEXTBOX_Search;                                    // 0x08F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_BrowseMods_C*                       UI_BrowseMods;                                     // 0x0900(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Back_C*           UI_Button_Ark_Global_RedeemACode;                  // 0x0908(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Sidebar_C*                   UI_Button_BrowseMods;                              // 0x0910(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Sidebar_C*                   UI_Button_Discovery;                               // 0x0918(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Sidebar_C*                   UI_Button_InstalledMods;                           // 0x0920(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Sidebar_C*                   UI_Button_MyMods;                                  // 0x0928(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Discovery_C*                        UI_Discovery;                                      // 0x0930(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_InstalledMods_C*                    UI_InstalledMods;                                  // 0x0938(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MyMods_C*                           UI_MyMods;                                         // 0x0940(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Overlay_C*                          UI_Overlay;                                        // 0x0948(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SeparatedInstalledMods_C*           UI_SeparatedInstalledMods;                         // 0x0950(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_SignIn_C*                    UI_SignIn;                                         // 0x0958(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UserIdDisplay;                                     // 0x0960(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_PageSwitcher;                       // 0x0968(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Title;                              // 0x0970(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSignedIn;                                        // 0x0978(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_979[0x7];                                      // 0x0979(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnModPressed;                                      // 0x0980(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FButtonStyle                           SelectedStyle;                                     // 0x0990(0x0370)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           NotSelectedStyle;                                  // 0x0D00(0x0370)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnCFCoreInitialized;                               // 0x1070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsPlayerUsingGamepad;                              // 0x1080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1081[0x7];                                     // 0x1081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(ENUM_InputDevices Device)> OnInputDeviceChanged;                   // 0x1088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUI_BasePage_C*                         CurrentActivePage;                                 // 0x1098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                FocusdWidget;                                      // 0x10A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUI_Button_Sidebar_C*>           Sidebuttons;                                       // 0x10A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	ENUM_SideTabs                                 CurrentActiveTab;                                  // 0x10B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableThemeCustomizer;                             // 0x10B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_10BA[0x6];                                     // 0x10BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCFCoreThemeRowData                    CurrentTheme;                                      // 0x10C0(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              UpdateAllThemeSettings;                            // 0x11C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UDataTable*                             Data_Table;                                        // 0x11D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUI_ThemeCustomizer_C*                  UI_ThemeCustomizer;                                // 0x11D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_RightClickMenu_C*                   RightClickMenu;                                    // 0x11E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_ModPage_C*                          ModPage;                                           // 0x11E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTermsAndConditions_C*                  TermsPopUp;                                        // 0x11F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInstallProgressMod>            AllInstalledMods;                                  // 0x11F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          BypassSearchExit;                                  // 0x1208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1209[0x7];                                     // 0x1209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUI_BasePage_C*>                 ListOfPages;                                       // 0x1210(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         CurrentBrowserIndex;                               // 0x1220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1224[0x4];                                     // 0x1224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGameModsEvent>                        evts;                                              // 0x1228(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_ServerModsWidget_C*                 ServerModsWidget;                                  // 0x1238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowCategorieRefreshes;                           // 0x1240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1241[0x7];                                     // 0x1241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_RedeemCode_C*                       UI_CodeRedeem;                                     // 0x1248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableDiscoveryTab;                                // 0x1250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDoubleInstalledList;                            // 0x1251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          EnableClassSelection;                              // 0x1252(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_1253[0x1];                                     // 0x1253(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumTabs;                                           // 0x1254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyThemeSettingsToAll();
	void Back_from_Server_Mods();
	void BindControllerAction();
	void BndEvt__StoreMenu_SignIn_K2Node_ComponentBoundEvent_3_OnSignInClicked__DelegateSignature();
	void BndEvt__StoreMenu_TxtBox_Search_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__UI_StoreMenu_Button_41_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_StoreMenu_TEXT_SearchBack_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_StoreMenu_UI_Button_Ark_Global_Back_K2Node_ComponentBoundEvent_10_OnPressed__DelegateSignature();
	void BndEvt__UI_StoreMenu_UI_Button_BrowseMods_K2Node_ComponentBoundEvent_1_Dispatcher_OnClick__DelegateSignature();
	void BndEvt__UI_StoreMenu_UI_Button_Discovery_K2Node_ComponentBoundEvent_8_Dispatcher_OnClick__DelegateSignature();
	void BndEvt__UI_StoreMenu_UI_Button_InstalledMods_K2Node_ComponentBoundEvent_2_Dispatcher_OnClick__DelegateSignature();
	void BndEvt__UI_StoreMenu_UI_Button_MyMods_K2Node_ComponentBoundEvent_6_Dispatcher_OnClick__DelegateSignature();
	bool BPEscapeClosed();
	bool BPGamepadReleased(const struct FKey& theKey);
	void ButtonCall(const struct FKey& Key, EViewState State);
	void Construct();
	void CreateModPageMenu(int64 Mod_Id, int32 DrawUIOnZOrder, class UUI_GameSlot_C* UI_GameSlotRef, class UUI_ModPage_C** ModPageRef);
	void CreateRightClickMenu(class UUI_GameSlot_C* UI_GameSlot, bool ShouldViewBeVisible, bool SepareteReportWithLine, double WidgetWidth, class UUI_RightClickMenu_C** MenuRef);
	void DecideInstalledModsTab();
	void DELETE_FocusableOnKeyDown_1(const struct FKeyEvent& KeyEvent);
	void DestroyModPageMenu();
	void DestroyRightClickMenu();
	void Destruct();
	void EnabledTabSwitching(bool bInIsEnabled);
	void Event_Click_On_Sign_In();
	void Event_Close_Menu();
	void Event_Open_Browse_Mods_Page();
	void Event_Open_Discovery_Page();
	void Event_Open_Installed_Mods_Page();
	void Event_Open_My_Mods_Page();
	void ExecuteUbergraph_UI_StoreMenu(int32 EntryPoint);
	void GamepadRequestChangeTab(bool Forward);
	void GetAllModsIDs(TArray<int64>* List);
	void GetCurrentActivePage(class UUI_BasePage_C** CurrentPage, ENUM_SideTabs* CurrentActiveTab_0);
	void GetDiscoveryRef(class UUI_Discovery_C** DiscoveryRef);
	void GetDiscoveryScrollBox(class UScrollBox** NewParam);
	void InitAllTabs();
	void InitTheme();
	void NotificationHandle(EGameModsEvent Selection, const struct FInstallProgressMod& mod);
	void OnAllModsReceivedUpdated();
	bool OnEventBroadcasted(EGameModsEvent evt, const TArray<struct FInstallProgressMod>& ModsList, const struct FCFCoreApiResponsePagination& pagination);
	void OnFilterChange();
	void OnSearchedTextCommitted();
	void OpenCurrentActivePage();
	void OpenPendingModPage();
	void PlayStartFadeInAnimation();
	void RemoveExtraWidgets();
	void RequestInstalledModsFromAPI();
	void RequestThemeUpdate();
	void ReturnToStoreMenu();
	void SelectPage(class UUI_Button_Sidebar_C* Target);
	void SetCurrentActivePage(ENUM_SideTabs NewActiveTab, bool ReloadPage, bool ForceChange);
	void SetDiscoveryActive();
	void SetInitStoreFocus();
	void SetNewTextInSearch(const class FText& InText);
	void SetUserIdDisplayText();
	void ShouldCustomizeTheme();
	void SwitchControllerAction(const struct FKey& Key, EViewState State);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UI_StoreMenu_AutoGenFunc();
	void UI_StoreMenu_AutoGenFunc3(int64 ServerID);
	void UI_StoreMenu_AutoGenFunc4(int64 ServerID);
	void UpdateAllStoreMenuWidgets();
	void UpdateCloseButtonSearchVisiblity(const class FText& SearchInput);
	void UpdateSearchFilter();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_StoreMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_StoreMenu_C")
	}
	static class UUI_StoreMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_StoreMenu_C>();
	}
};
DUMPER7_ASSERTS_UUI_StoreMenu_C;

}

