#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ShowcaseSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CFCoreUIWidget_classes.hpp"
#include "cfcore_ui_structs.hpp"
#include "cfcore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ShowcaseSlot.UI_ShowcaseSlot_C
// 0x0620 (0x0E58 - 0x0838)
class UUI_ShowcaseSlot_C final : public UCFCoreUIWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_ShowcaseSlot_C;                  // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeProgressBar;                                   // 0x0840(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_GoToModPage;                                // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Showcase;                                      // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_TagHolder;                                 // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Highlight;                             // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Overlay_C*                          UI_Overlay;                                        // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WhiteCategoryPreview_C*             UI_WhiteCategoryPreview;                           // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCurrent;                                         // 0x0878(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_879[0x7];                                      // 0x0879(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Discovery_C*                        Discovery;                                         // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInstallProgressMod                    ShowcaseModInfo;                                   // 0x0888(0x0538)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMulticastInlineDelegate<void()>              ReadyToStart;                                      // 0x0DC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FCarouselItem                          CarouselItem;                                      // 0x0DD0(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2DDynamic*                      IMG_MainImage;                                     // 0x0E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      IMG_Thumbnail;                                     // 0x0E50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_ShowcaseSlot_Button_GoToModPage_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_ShowcaseSlot_Button_GoToModPage_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_ShowcaseSlot_Button_GoToModPage_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void ConstructModShowcase(const struct FCarouselItem& InfoCarouseItem, const struct FInstallProgressMod& ShowcaseModInfo_0);
	void DownloadMainImage();
	void DownloadThumbnail();
	void ExecuteUbergraph_UI_ShowcaseSlot(int32 EntryPoint);
	void NoLongerCurrent();
	void OnFail_6B8AC8D045F539E0C4B381BD368F2796(class UTexture2DDynamic* Texture);
	void OnFail_B8687F5A48265CFC0EB678AEAD6BCBCC(class UTexture2DDynamic* Texture);
	void OnSuccess_6B8AC8D045F539E0C4B381BD368F2796(class UTexture2DDynamic* Texture);
	void OnSuccess_B8687F5A48265CFC0EB678AEAD6BCBCC(class UTexture2DDynamic* Texture);
	void PreConstruct(bool IsDesignTime);
	void Reset_Progress_Bar();
	void SetCurrent();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_ShowcaseSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_ShowcaseSlot_C")
	}
	static class UUI_ShowcaseSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ShowcaseSlot_C>();
	}
};
DUMPER7_ASSERTS_UUI_ShowcaseSlot_C;

}

