#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SeparatedInstalledMods

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "cfcore_ui_structs.hpp"
#include "UI_BasePage_classes.hpp"
#include "ENUM_SideTabs_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SeparatedInstalledMods.UI_SeparatedInstalledMods_C
// 0x0B80 (0x13E8 - 0x0868)
class UUI_SeparatedInstalledMods_C final : public UUI_BasePage_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_SeparatedInstalledMods_C;        // 0x0868(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_NoModsInstalledFound_C*             Notif_NoInstalledMods;                             // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_DisabledNum;                                  // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_EnabledNum;                                   // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Back_C*           UI_Button_Ark_Global_Back;                         // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Back_C*           UI_Button_DisableAllMods;                          // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Back_C*           UI_Button_EnableAllMods;                           // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Base_C*           UI_Button_UninstallAllMods;                        // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Base_C*           UI_Button_UpdateAllMods;                           // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ExpandedModSlot_C*                  UI_ExpandedModSlot_218;                            // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WideGameSlot_C*                     UI_WideGameSlot;                                   // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WideGameSlot_C*                     UI_WideGameSlot_1;                                 // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WideGameSlot_C*                     UI_WideGameSlot_2;                                 // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WideGameSlot_C*                     UI_WideGameSlot_3;                                 // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WideGameSlot_C*                     UI_WideGameSlot_4;                                 // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WideGameSlot_C*                     UI_WideGameSlot_6;                                 // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WideGameSlot_C*                     UI_WideGameSlot_7;                                 // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WideGameSlot_C*                     UI_WideGameSlot_9;                                 // 0x08F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WideGameSlot_C*                     UI_WideGameSlot_12;                                // 0x08F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WideGameSlot_C*                     UI_WideGameSlot_13;                                // 0x0900(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WideGameSlot_C*                     UI_WideGameSlot_14;                                // 0x0908(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_AnyModsAvailable;                   // 0x0910(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_DisabledList;                              // 0x0918(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_EnabledList;                               // 0x0920(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FInstallProgressMod>            NonInstallingMods;                                 // 0x0928(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<EGameModsEvent>                        evts;                                              // 0x0938(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FInstallProgressMod>            TrueModInfo;                                       // 0x0948(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FInstallProgressMod>            EnabledMods;                                       // 0x0958(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FInstallProgressMod>            DisabledMods;                                      // 0x0968(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FInstallProgressMod                    CurrentOption;                                     // 0x0978(0x0538)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FInstallProgressMod                    HoveredOption;                                     // 0x0EB0(0x0538)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AssignFirstModFoundToPreview();
	void BndEvt__UI_SeparatedInstalledMods_UI_Button_Ark_Global_Back_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature();
	void BndEvt__UI_SeparatedInstalledMods_UI_Button_DisableAllMods_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature();
	void BndEvt__UI_SeparatedInstalledMods_UI_Button_EnableAllMods_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature();
	void BndEvt__UI_SeparatedInstalledMods_UI_Button_UninstallAllMods_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature();
	void BndEvt__UI_SeparatedInstalledMods_UI_Button_UpdateAllMods_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature();
	void Construct();
	void CreateModList();
	void CreatePerList(class UWrapBox* Target, TArray<struct FInstallProgressMod>& Array);
	void Destruct();
	void ExecuteUbergraph_UI_SeparatedInstalledMods(int32 EntryPoint);
	void FilterOutNonInstalling(const TArray<struct FInstallProgressMod>& Full_list, TArray<struct FInstallProgressMod>* FilteredList);
	ESlateVisibility Get_UI_Button_UpdateAllMods_Visibility();
	bool GetAnyInstalledModsExist();
	void GetCurrentAndOrderIndexes(bool Next, int32* From, int32* To);
	void MakeAListOfModsToDisable(bool ToEnable, TArray<struct FInstalledModProperties>* ModsToGetSwitched);
	bool OnEventBroadcasted(EGameModsEvent evt, const TArray<struct FInstallProgressMod>& ModsList, const struct FCFCoreApiResponsePagination& pagination);
	void OnWideSlotClicked(const struct FInstallProgressMod& ModInfo);
	void OnWideSlotEnableToggled(const struct FInstallProgressMod& ModInfo);
	void OnWideSlotHovered(const struct FInstallProgressMod& ModInfo);
	void PullModsFromAPI();
	void ReloadInstalledMods();
	void ReloadPage();
	void ResetWidget();
	void SplitModsInTwoLists();
	void SwitchWithNext();
	void SwitchWithPrevious();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UninstallAllinstalledMods();
	void UpdateAllMods();
	void UpdateModCounts();
	void UpdateSwitchAllButtonsEnabled();
	void WipeBothLists();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_SeparatedInstalledMods_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_SeparatedInstalledMods_C")
	}
	static class UUI_SeparatedInstalledMods_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SeparatedInstalledMods_C>();
	}
};
DUMPER7_ASSERTS_UUI_SeparatedInstalledMods_C;

}

