#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_WhiteCategoryPreview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_WhiteCategoryPreview.UI_WhiteCategoryPreview_C
// 0x0030 (0x03A8 - 0x0378)
class UUI_WhiteCategoryPreview_C final : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IMG_BackOutlineforBackground;                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_FrontBackground;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_InsideText;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text_To_Display;                                   // 0x0398(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_UI_WhiteCategoryPreview(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_WhiteCategoryPreview_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_WhiteCategoryPreview_C")
	}
	static class UUI_WhiteCategoryPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_WhiteCategoryPreview_C>();
	}
};
DUMPER7_ASSERTS_UUI_WhiteCategoryPreview_C;

}

