#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_WhiteCategoryPreview

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_WhiteCategoryPreview.UI_WhiteCategoryPreview_C.ExecuteUbergraph_UI_WhiteCategoryPreview
// 0x0008 (0x0008 - 0x0000)
struct UI_WhiteCategoryPreview_C_ExecuteUbergraph_UI_WhiteCategoryPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_WhiteCategoryPreview_C_ExecuteUbergraph_UI_WhiteCategoryPreview;

// Function UI_WhiteCategoryPreview.UI_WhiteCategoryPreview_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_WhiteCategoryPreview_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_WhiteCategoryPreview_C_PreConstruct;

// Function UI_WhiteCategoryPreview.UI_WhiteCategoryPreview_C.UpdateText
// 0x0018 (0x0018 - 0x0000)
struct UI_WhiteCategoryPreview_C_UpdateText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_WhiteCategoryPreview_C_UpdateText;

}

