#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ZoomImage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "cfcore_ui_structs.hpp"
#include "CFCoreUIWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ZoomImage.UI_ZoomImage_C
// 0x0338 (0x0B70 - 0x0838)
class UUI_ZoomImage_C final : public UCFCoreUIWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_ZoomImage_C;                     // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SwitchingImagesEnd;                                // 0x0840(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInOnBeginPlay;                                 // 0x0848(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SwitchingImages;                                   // 0x0850(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Buttom_Next;                                       // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Prev;                                       // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Next;                                          // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Prev;                                          // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_ScreenshotImg;                                 // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_Description;                                  // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TEXT_PageCounter;                                  // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Ark_Global_Back_C*           UI_Button_Ark_Global_Back_C_0;                     // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentImageIndex;                                 // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_89C[0x4];                                      // 0x089C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_ModPage_C*                          UI_ModPage;                                        // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_8A8[0x8];                                      // 0x08A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CantMoveRightImage;                                // 0x08B0(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            CantMoveLeftImage;                                 // 0x0960(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            NextArrowImage;                                    // 0x0A10(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            PrevArrowImage;                                    // 0x0AC0(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BindControllerAction();
	void BndEvt__UI_ZoomImage_UI_Button_Ark_Global_Back_C_0_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature();
	void BndEvt__ZoomImage_UI_NextImage_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ZoomImage_UI_PrevImage_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	bool BPGamepadReleased(const struct FKey& theKey);
	bool BPHighlightWidgetOnStart();
	void ButtonCall(const struct FKey& Key, EViewState State);
	void Construct();
	void ExecuteUbergraph_UI_ZoomImage(int32 EntryPoint);
	void FadeOut();
	void GetScreenshotsInfo(TArray<class UTexture2DDynamic*>* screenshots, TArray<class FString>* Descriptions);
	void GoBack();
	void NextImage();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void PlayFadeInOnBeginPlayAnim();
	void PrevImage();
	void SequenceEvent__ENTRYPOINTUI_ZoomImage();
	void SequenceEvent_SwapImage();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateAllScreenshotInformation();
	void UpdateButtonsStyle();
	void UpdatePageCounter();
	void UpdateScreenshotDescription();
	void UpdateScreenshotImage();
	void UpdateToCurrentImage();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_ZoomImage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_ZoomImage_C")
	}
	static class UUI_ZoomImage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ZoomImage_C>();
	}
};
DUMPER7_ASSERTS_UUI_ZoomImage_C;

}

