#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UpdatingModsToast

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UpdatingModsToast.UpdatingModsToast_C
// 0x0048 (0x0810 - 0x07C8)
class UUpdatingModsToast_C final : public UPrimalUI_Toast
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x07D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x07D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         MainText;                                          // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressImage;                                     // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OverrideText;                                      // 0x07F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               ProgressBarMat;                                    // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HideCounter;                                       // 0x0808(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateProgressBar();
	void UpdateMainText();
	void SetCounter(int32 NewCounter);
	void OverrideTextValueWithString(const class FString& NewText, bool HideProgressBar, bool HideCounter_0);
	void OverrideTextValue(const class FText& NewText, bool HideProgressBar, bool HideCounter_0);
	void InitCounter(int32 NewCounterMax, bool bInWillSetCounter);
	void incrementCounter();
	void ExecuteUbergraph_UpdatingModsToast(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UpdatingModsToast_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UpdatingModsToast_C")
	}
	static class UUpdatingModsToast_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUpdatingModsToast_C>();
	}
};
DUMPER7_ASSERTS_UUpdatingModsToast_C;

}

