#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: USDClasses

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "USDClasses_structs.hpp"


namespace SDK::Params
{

// Function USDClasses.UsdAssetCache2.AddAssetReference
// 0x0018 (0x0018 - 0x0000)
struct UsdAssetCache2_AddAssetReference final
{
public:
	const class UObject*                          Asset;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          Referencer;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache2_AddAssetReference;

// Function USDClasses.UsdAssetCache2.CacheAsset
// 0x0020 (0x0020 - 0x0000)
struct UsdAssetCache2_CacheAsset final
{
public:
	class FString                                 Hash;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Asset;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          Referencer;                                        // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache2_CacheAsset;

// Function USDClasses.UsdAssetCache2.CanRemoveAsset
// 0x0018 (0x0018 - 0x0000)
struct UsdAssetCache2_CanRemoveAsset final
{
public:
	class FString                                 Hash;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache2_CanRemoveAsset;

// Function USDClasses.UsdAssetCache2.GetCachedAsset
// 0x0018 (0x0018 - 0x0000)
struct UsdAssetCache2_GetCachedAsset final
{
public:
	class FString                                 Hash;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache2_GetCachedAsset;

// Function USDClasses.UsdAssetCache2.RemoveAllAssetReferences
// 0x0010 (0x0010 - 0x0000)
struct UsdAssetCache2_RemoveAllAssetReferences final
{
public:
	const class UObject*                          Referencer;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache2_RemoveAllAssetReferences;

// Function USDClasses.UsdAssetCache2.RemoveAsset
// 0x0018 (0x0018 - 0x0000)
struct UsdAssetCache2_RemoveAsset final
{
public:
	class FString                                 Hash;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache2_RemoveAsset;

// Function USDClasses.UsdAssetCache2.RemoveAssetReference
// 0x0018 (0x0018 - 0x0000)
struct UsdAssetCache2_RemoveAssetReference final
{
public:
	const class UObject*                          Asset;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          Referencer;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache2_RemoveAssetReference;

// Function USDClasses.UsdAssetCache2.TouchAsset
// 0x0018 (0x0018 - 0x0000)
struct UsdAssetCache2_TouchAsset final
{
public:
	const class UObject*                          Asset;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          Referencer;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache2_TouchAsset;

// Function USDClasses.UsdAssetCache2.GetAllAssetHashes
// 0x0010 (0x0010 - 0x0000)
struct UsdAssetCache2_GetAllAssetHashes final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache2_GetAllAssetHashes;

// Function USDClasses.UsdAssetCache2.GetAllCachedAssetPaths
// 0x0010 (0x0010 - 0x0000)
struct UsdAssetCache2_GetAllCachedAssetPaths final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache2_GetAllCachedAssetPaths;

// Function USDClasses.UsdAssetCache2.GetAllLoadedAssets
// 0x0010 (0x0010 - 0x0000)
struct UsdAssetCache2_GetAllLoadedAssets final
{
public:
	TArray<class UObject*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache2_GetAllLoadedAssets;

// Function USDClasses.UsdAssetCache2.GetHashForAsset
// 0x0018 (0x0018 - 0x0000)
struct UsdAssetCache2_GetHashForAsset final
{
public:
	const class UObject*                          Asset;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache2_GetHashForAsset;

// Function USDClasses.UsdAssetCache2.GetNumAssets
// 0x0004 (0x0004 - 0x0000)
struct UsdAssetCache2_GetNumAssets final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache2_GetNumAssets;

// Function USDClasses.UsdAssetCache2.IsAssetOwnedByCache
// 0x0018 (0x0018 - 0x0000)
struct UsdAssetCache2_IsAssetOwnedByCache final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache2_IsAssetOwnedByCache;

// Function USDClasses.UsdAssetCache3.AddAssetReferencer
// 0x0018 (0x0018 - 0x0000)
struct UsdAssetCache3_AddAssetReferencer final
{
public:
	const class UObject*                          Asset;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          Referencer;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache3_AddAssetReferencer;

// Function USDClasses.UsdAssetCache3.CacheAsset
// 0x0038 (0x0038 - 0x0000)
struct UsdAssetCache3_CacheAsset final
{
public:
	class FString                                 Hash;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AssetPath;                                         // 0x0010(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          Referencer;                                        // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache3_CacheAsset;

// Function USDClasses.UsdAssetCache3.DeleteUnreferencedAssets
// 0x0001 (0x0001 - 0x0000)
struct UsdAssetCache3_DeleteUnreferencedAssets final
{
public:
	bool                                          bShowConfirmation;                                 // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache3_DeleteUnreferencedAssets;

// Function USDClasses.UsdAssetCache3.GetOrCreateCachedAsset
// 0x0040 (0x0040 - 0x0000)
struct UsdAssetCache3_GetOrCreateCachedAsset final
{
public:
	class FString                                 Hash;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 Class_0;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DesiredName;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DesiredFlags;                                      // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutCreatedAsset;                                  // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          Referencer;                                        // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache3_GetOrCreateCachedAsset;

// Function USDClasses.UsdAssetCache3.RemoveAllAssetReferencers
// 0x0001 (0x0001 - 0x0000)
struct UsdAssetCache3_RemoveAllAssetReferencers final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache3_RemoveAllAssetReferencers;

// Function USDClasses.UsdAssetCache3.RemoveAllReferencerAssets
// 0x0010 (0x0010 - 0x0000)
struct UsdAssetCache3_RemoveAllReferencerAssets final
{
public:
	const class UObject*                          Referencer;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache3_RemoveAllReferencerAssets;

// Function USDClasses.UsdAssetCache3.RemoveAllReferencersForAsset
// 0x0010 (0x0010 - 0x0000)
struct UsdAssetCache3_RemoveAllReferencersForAsset final
{
public:
	const class UObject*                          Asset;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache3_RemoveAllReferencersForAsset;

// Function USDClasses.UsdAssetCache3.RemoveAssetReferencer
// 0x0018 (0x0018 - 0x0000)
struct UsdAssetCache3_RemoveAssetReferencer final
{
public:
	const class UObject*                          Asset;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          Referencer;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache3_RemoveAssetReferencer;

// Function USDClasses.UsdAssetCache3.SetAssetDeletable
// 0x0010 (0x0010 - 0x0000)
struct UsdAssetCache3_SetAssetDeletable final
{
public:
	const class UObject*                          Asset;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDeletable;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache3_SetAssetDeletable;

// Function USDClasses.UsdAssetCache3.StopTrackingAsset
// 0x0030 (0x0030 - 0x0000)
struct UsdAssetCache3_StopTrackingAsset final
{
public:
	class FString                                 Hash;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache3_StopTrackingAsset;

// Function USDClasses.UsdAssetCache3.GetAllTrackedAssets
// 0x0050 (0x0050 - 0x0000)
struct UsdAssetCache3_GetAllTrackedAssets final
{
public:
	TMap<class FString, struct FSoftObjectPath>   ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache3_GetAllTrackedAssets;

// Function USDClasses.UsdAssetCache3.GetCachedAsset
// 0x0018 (0x0018 - 0x0000)
struct UsdAssetCache3_GetCachedAsset final
{
public:
	class FString                                 Hash;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache3_GetCachedAsset;

// Function USDClasses.UsdAssetCache3.GetCachedAssetPath
// 0x0030 (0x0030 - 0x0000)
struct UsdAssetCache3_GetCachedAssetPath final
{
public:
	class FString                                 Hash;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache3_GetCachedAssetPath;

// Function USDClasses.UsdAssetCache3.GetHashForAsset
// 0x0030 (0x0030 - 0x0000)
struct UsdAssetCache3_GetHashForAsset final
{
public:
	struct FSoftObjectPath                        AssetPath;                                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache3_GetHashForAsset;

// Function USDClasses.UsdAssetCache3.GetNumAssets
// 0x0004 (0x0004 - 0x0000)
struct UsdAssetCache3_GetNumAssets final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache3_GetNumAssets;

// Function USDClasses.UsdAssetCache3.IsAssetDeletable
// 0x0010 (0x0010 - 0x0000)
struct UsdAssetCache3_IsAssetDeletable final
{
public:
	const class UObject*                          Asset;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache3_IsAssetDeletable;

// Function USDClasses.UsdAssetCache3.IsAssetTrackedByCache
// 0x0028 (0x0028 - 0x0000)
struct UsdAssetCache3_IsAssetTrackedByCache final
{
public:
	struct FSoftObjectPath                        AssetPath;                                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UsdAssetCache3_IsAssetTrackedByCache;

// Function USDClasses.UsdAssetCache3.LoadAndGetAllTrackedAssets
// 0x0050 (0x0050 - 0x0000)
struct UsdAssetCache3_LoadAndGetAllTrackedAssets final
{
public:
	TMap<class FString, class UObject*>           ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdAssetCache3_LoadAndGetAllTrackedAssets;

// Function USDClasses.UsdDrawModeComponent.SetBoundsColor
// 0x0010 (0x0010 - 0x0000)
struct UsdDrawModeComponent_SetBoundsColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetBoundsColor;

// Function USDClasses.UsdDrawModeComponent.SetBoundsMax
// 0x0018 (0x0018 - 0x0000)
struct UsdDrawModeComponent_SetBoundsMax final
{
public:
	struct FVector                                NewMax;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetBoundsMax;

// Function USDClasses.UsdDrawModeComponent.SetBoundsMin
// 0x0018 (0x0018 - 0x0000)
struct UsdDrawModeComponent_SetBoundsMin final
{
public:
	struct FVector                                NewMin;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetBoundsMin;

// Function USDClasses.UsdDrawModeComponent.SetCardGeometry
// 0x0004 (0x0004 - 0x0000)
struct UsdDrawModeComponent_SetCardGeometry final
{
public:
	EUsdModelCardGeometry                         NewGeometry;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetCardGeometry;

// Function USDClasses.UsdDrawModeComponent.SetCardTextureXNeg
// 0x0008 (0x0008 - 0x0000)
struct UsdDrawModeComponent_SetCardTextureXNeg final
{
public:
	class UTexture2D*                             NewTexture;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetCardTextureXNeg;

// Function USDClasses.UsdDrawModeComponent.SetCardTextureXPos
// 0x0008 (0x0008 - 0x0000)
struct UsdDrawModeComponent_SetCardTextureXPos final
{
public:
	class UTexture2D*                             NewTexture;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetCardTextureXPos;

// Function USDClasses.UsdDrawModeComponent.SetCardTextureYNeg
// 0x0008 (0x0008 - 0x0000)
struct UsdDrawModeComponent_SetCardTextureYNeg final
{
public:
	class UTexture2D*                             NewTexture;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetCardTextureYNeg;

// Function USDClasses.UsdDrawModeComponent.SetCardTextureYPos
// 0x0008 (0x0008 - 0x0000)
struct UsdDrawModeComponent_SetCardTextureYPos final
{
public:
	class UTexture2D*                             NewTexture;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetCardTextureYPos;

// Function USDClasses.UsdDrawModeComponent.SetCardTextureZNeg
// 0x0008 (0x0008 - 0x0000)
struct UsdDrawModeComponent_SetCardTextureZNeg final
{
public:
	class UTexture2D*                             NewTexture;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetCardTextureZNeg;

// Function USDClasses.UsdDrawModeComponent.SetCardTextureZPos
// 0x0008 (0x0008 - 0x0000)
struct UsdDrawModeComponent_SetCardTextureZPos final
{
public:
	class UTexture2D*                             NewTexture;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetCardTextureZPos;

// Function USDClasses.UsdDrawModeComponent.SetDrawMode
// 0x0004 (0x0004 - 0x0000)
struct UsdDrawModeComponent_SetDrawMode final
{
public:
	EUsdDrawMode                                  NewDrawMode;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetDrawMode;

// Function USDClasses.UsdDrawModeComponent.SetTextureForFace
// 0x0010 (0x0010 - 0x0000)
struct UsdDrawModeComponent_SetTextureForFace final
{
public:
	EUsdModelCardFace                             Face;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_SetTextureForFace;

// Function USDClasses.UsdDrawModeComponent.GetTextureForFace
// 0x0010 (0x0010 - 0x0000)
struct UsdDrawModeComponent_GetTextureForFace final
{
public:
	EUsdModelCardFace                             Face;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UsdDrawModeComponent_GetTextureForFace;

}

