#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: USDStage

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UnrealUSDWrapper_structs.hpp"
#include "USDStage_structs.hpp"
#include "USDClasses_structs.hpp"


namespace SDK
{

// Class USDStage.UsdDynamicBindingResolverLibrary
// 0x0000 (0x0028 - 0x0028)
class UUsdDynamicBindingResolverLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMovieSceneDynamicBindingResolveResult ResolveWithStageActor(class UObject* WorldContextObject, const struct FMovieSceneDynamicBindingResolveParams& Params_0, const class FString& StageActorIDNameFilter, const class FString& RootLayerFilter, const class FString& PrimPath);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UsdDynamicBindingResolverLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UsdDynamicBindingResolverLibrary")
	}
	static class UUsdDynamicBindingResolverLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdDynamicBindingResolverLibrary>();
	}
};
DUMPER7_ASSERTS_UUsdDynamicBindingResolverLibrary;

// Class USDStage.UsdInfoCache
// 0x0008 (0x0030 - 0x0028)
class UUsdInfoCache final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UsdInfoCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UsdInfoCache")
	}
	static class UUsdInfoCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdInfoCache>();
	}
};
DUMPER7_ASSERTS_UUsdInfoCache;

// Class USDStage.UsdPrimLinkCache
// 0x0008 (0x0030 - 0x0028)
class UUsdPrimLinkCache final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UsdPrimLinkCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UsdPrimLinkCache")
	}
	static class UUsdPrimLinkCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdPrimLinkCache>();
	}
};
DUMPER7_ASSERTS_UUsdPrimLinkCache;

// Class USDStage.UsdStageActor
// 0x03D0 (0x0850 - 0x0480)
class AUsdStageActor final : public AActor
{
public:
	struct FFilePath                              RootLayer;                                         // 0x0480(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdStageState                                StageState;                                        // 0x0490(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUsdAssetCache3*                        AssetCache;                                        // 0x0498(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UUsdInfoCache*                          UsdInfoCache;                                      // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UUsdPrimLinkCache*                      PrimLinkCache;                                     // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UUsdAssetCache2*                        UsdAssetCache;                                     // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	EUsdInitialLoadSet                            InitialLoadSet;                                    // 0x04B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdInterpolationType                         InterpolationType;                                 // 0x04B9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryCacheImport                          GeometryCacheImport;                               // 0x04BA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePrimKindsForCollapsing;                        // 0x04BB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KindsToCollapse;                                   // 0x04BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMergeIdenticalMaterialSlots;                      // 0x04C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShareAssetsForIdenticalPrims;                     // 0x04C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseIdenticalAssets;                             // 0x04C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCollapseTopLevelPointInstancers;                  // 0x04C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PurposesToLoad;                                    // 0x04C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NaniteTriangleThreshold;                           // 0x04C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RenderContext;                                     // 0x04CC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaterialPurpose;                                   // 0x04D4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdRootMotionHandling                        RootMotionHandling;                                // 0x04DC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DD[0x3];                                      // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubdivisionLevel;                                  // 0x04E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUsdMetadataImportOptions              MetadataOptions;                                   // 0x04E8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_508[0xA8];                                     // 0x0508(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponent;                                    // 0x05B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	float                                         Time;                                              // 0x05B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5BC[0x4];                                      // 0x05BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         LevelSequence;                                     // 0x05C0(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UUsdPrimTwin*                           RootUsdTwin;                                       // 0x05C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	TSet<class FString>                           PrimsToAnimate;                                    // 0x05D0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class UObject*, class FString>           ObjectsToWatch;                                    // 0x0620(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	class UUsdTransactor*                         Transactor;                                        // 0x0670(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_678[0x1D8];                                    // 0x0678(0x01D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ULevelSequence* GetLevelSequence();
	void NewStage();
	void SetAssetCache(class UUsdAssetCache2* NewCache);
	void SetBlockedPrefixFilters(const TArray<class FString>& NewFilters);
	void SetCollapseTopLevelPointInstancers(bool bCollapse);
	void SetCollectFromEntireSubtrees(bool bNewCollectValue);
	void SetCollectMetadata(bool bNewCollectValue);
	void SetCollectOnComponents(bool bNewCollectValue);
	void SetGeometryCacheImport(EGeometryCacheImport ImportOption);
	void SetInitialLoadSet(EUsdInitialLoadSet NewLoadSet);
	void SetInterpolationType(EUsdInterpolationType NewType);
	void SetInvertFilters(bool bNewInvertValue);
	void SetIsolatedRootLayer(const class FString& IsolatedStageRootLayer);
	void SetKindsToCollapse(int32 NewKindsToCollapse);
	void SetMaterialPurpose(const class FName& NewMaterialPurpose);
	void SetMergeIdenticalMaterialSlots(bool bMerge);
	void SetNaniteTriangleThreshold(int32 NewNaniteTriangleThreshold);
	void SetPurposesToLoad(int32 NewPurposesToLoad);
	void SetRenderContext(const class FName& NewRenderContext);
	void SetReuseIdenticalAssets(bool bReuse);
	void SetRootLayer(const class FString& RootFilePath);
	void SetRootMotionHandling(EUsdRootMotionHandling NewHandlingStrategy);
	void SetShareAssetsForIdenticalPrims(bool bShare);
	void SetStageState(EUsdStageState NewStageState);
	void SetSubdivisionLevel(int32 NewLevel);
	void SetTime(float InTime);
	void SetUsdAssetCache(class UUsdAssetCache3* NewCache);
	void SetUsePrimKindsForCollapsing(bool bUse);

	TArray<class UObject*> GetGeneratedAssets(const class FString& PrimPath) const;
	class USceneComponent* GetGeneratedComponent(const class FString& PrimPath) const;
	class FString GetIsolatedRootLayer() const;
	class FString GetSourcePrimPath(const class UObject* Object) const;
	float GetTime() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UsdStageActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UsdStageActor")
	}
	static class AUsdStageActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUsdStageActor>();
	}
};
DUMPER7_ASSERTS_AUsdStageActor;

// Class USDStage.UsdPrimTwin
// 0x0088 (0x00B0 - 0x0028)
class UUsdPrimTwin final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PrimPath;                                          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         SceneComponent;                                    // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class UUsdPrimTwin*>      Children;                                          // 0x0058(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
	TWeakObjectPtr<class UUsdPrimTwin>            Parent;                                            // 0x00A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UsdPrimTwin")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UsdPrimTwin")
	}
	static class UUsdPrimTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdPrimTwin>();
	}
};
DUMPER7_ASSERTS_UUsdPrimTwin;

// Class USDStage.UsdTransactor
// 0x0010 (0x0038 - 0x0028)
class UUsdTransactor final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UsdTransactor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UsdTransactor")
	}
	static class UUsdTransactor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdTransactor>();
	}
};
DUMPER7_ASSERTS_UUsdTransactor;

}

