#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VirtualHeightfieldMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VirtualHeightfieldMesh.HeightfieldMinMaxTexture
// 0x0048 (0x0070 - 0x0028)
class UHeightfieldMinMaxTexture final : public UObject
{
public:
	class UTexture2D*                             Texture;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UTexture2D*                             LodBiasTexture;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class UTexture2D*                             LodBiasMinMaxTexture;                              // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	int32                                         MaxCPULevels;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      TextureData;                                       // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FIntPoint                              TextureDataSize;                                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 TextureDataMips;                                   // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HeightfieldMinMaxTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HeightfieldMinMaxTexture")
	}
	static class UHeightfieldMinMaxTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeightfieldMinMaxTexture>();
	}
};
DUMPER7_ASSERTS_UHeightfieldMinMaxTexture;

// Class VirtualHeightfieldMesh.MaterialExpressionHeightfieldMinMaxTexture
// 0x0010 (0x00C0 - 0x00B0)
class UMaterialExpressionHeightfieldMinMaxTexture final : public UMaterialExpression
{
public:
	class UHeightfieldMinMaxTexture*              MinMaxTexture;                                     // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	EMaterialSamplerType                          SamplerType;                                       // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionHeightfieldMinMaxTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionHeightfieldMinMaxTexture")
	}
	static class UMaterialExpressionHeightfieldMinMaxTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionHeightfieldMinMaxTexture>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionHeightfieldMinMaxTexture;

// Class VirtualHeightfieldMesh.VirtualHeightfieldMesh
// 0x0008 (0x0488 - 0x0480)
class AVirtualHeightfieldMesh final : public AActor
{
public:
	class UVirtualHeightfieldMeshComponent*       VirtualHeightfieldMeshComponent;                   // 0x0480(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VirtualHeightfieldMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VirtualHeightfieldMesh")
	}
	static class AVirtualHeightfieldMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVirtualHeightfieldMesh>();
	}
};
DUMPER7_ASSERTS_AVirtualHeightfieldMesh;

// Class VirtualHeightfieldMesh.VirtualHeightfieldMeshComponent
// 0x0070 (0x0670 - 0x0600)
class UVirtualHeightfieldMeshComponent final : public UPrimitiveComponent
{
public:
	TSoftObjectPtr<class ARuntimeVirtualTextureVolume> VirtualTexture;                               // 0x05F8(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ARuntimeVirtualTextureVolume*           VirtualTextureRef;                                 // 0x0620(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	class UObject*                                VirtualTextureThumbnail;                           // 0x0628(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	bool                                          bCopyBoundsButton;                                 // 0x0630(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHeightfieldMinMaxTexture*              MinMaxTexture;                                     // 0x0638(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	int32                                         NumMinMaxTextureBuildLevels;                       // 0x0640(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBuildMinMaxTextureButton;                         // 0x0644(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_645[0x3];                                      // 0x0645(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0648(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	float                                         LOD0ScreenSize;                                    // 0x0650(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Lod0Distribution;                                  // 0x0654(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LodDistribution;                                   // 0x0658(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LodBiasScale;                                      // 0x065C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumForceLoadLods;                                  // 0x0660(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumOcclusionLods;                                  // 0x0664(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHiddenInEditor;                                   // 0x0668(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWorldPositionOffsetVelocity;                      // 0x0669(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_66A[0x6];                                      // 0x066A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GatherHideFlags(bool* InOutHidePrimitivesInEditor, bool* InOutHidePrimitivesInGame) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VirtualHeightfieldMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VirtualHeightfieldMeshComponent")
	}
	static class UVirtualHeightfieldMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVirtualHeightfieldMeshComponent>();
	}
};
DUMPER7_ASSERTS_UVirtualHeightfieldMeshComponent;

}

