#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoicePlayerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ShooterGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass VoicePlayerComponent.VoicePlayerComponent_C
// 0x00D8 (0x0190 - 0x00B8)
class UVoicePlayerComponent_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        MyAudioComponent;                                  // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             VoicelinesDT;                                      // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   MyAudioComponentTag;                               // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APrimalCharacter*                       OwnerPrimalCharacter;                              // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OwnerActor;                                        // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVoiceline                             LastVoiceline;                                     // 0x00E8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         LastSoundIndex;                                    // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastAnimIndex;                                     // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrequencyToAnalyse;                                // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NormMagnitudeOffset;                               // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastRandValue;                                     // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, double>                     VoicelineLastPlayedTimes;                          // 0x0138(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         InitFailures;                                      // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowTriggerWhileMoving;                          // 0x018C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableDebug;                                      // 0x018D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnComponentCreated();
	bool Can_Play_Voiceline(const struct FVoiceline& Voiceline, class FName Tag);
	void ExecuteUbergraph_VoicePlayerComponent(int32 EntryPoint);
	void GetAudioComponent(class UAudioComponent** Return);
	struct FVoiceline GetVoicelineData(class FName VoicelineTag);
	void InitVoicePlayerComponent();
	void PlayVoiceLine(class FName VoicelineTag, bool bForcePlay, bool* bDidActuallyPlay);
	void ShouldResetLastNoTaskTime(class FName VoicelineTag, bool* Return);
	void ShouldTriggerVoiceLine(class FName VoicelineTag, bool* Return);
	void TickSpectralAnalysis();
	void VoicePlayerComponent_OnUpdatePlaybackPercent(const class USoundWave* PlayingSoundWave, const float PlaybackPercent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VoicePlayerComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VoicePlayerComponent_C")
	}
	static class UVoicePlayerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoicePlayerComponent_C>();
	}
};
DUMPER7_ASSERTS_UVoicePlayerComponent_C;

}

