#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MilestoneEntry

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MilestoneEntry.W_MilestoneEntry_C
// 0x0040 (0x03B8 - 0x0378)
class UW_MilestoneEntry_C final : public UPrimalUserWidget
{
public:
	class UTextBlock*                             SkillName;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MilestoneTask_C*                     W_MilestoneTask;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MilestoneTask_C*                     W_MilestoneTask_1;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MilestoneTask_C*                     W_MilestoneTask_2;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ProceduralLineSkill_C*               W_ProceduralLineSkill_1;                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ProceduralLineSkill_C*               W_ProceduralLineSkill_2;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void InitMilestones(TArray<struct FPrimalMilestone>& Data, TArray<class FName>& Ids, const class FString& Name_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MilestoneEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MilestoneEntry_C")
	}
	static class UW_MilestoneEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MilestoneEntry_C>();
	}
};
DUMPER7_ASSERTS_UW_MilestoneEntry_C;

}

