#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MilestonesTabEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_MilestonesTabEntry.W_MilestonesTabEntry_C.ExecuteUbergraph_W_MilestonesTabEntry
// 0x0004 (0x0004 - 0x0000)
struct W_MilestonesTabEntry_C_ExecuteUbergraph_W_MilestonesTabEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MilestonesTabEntry_C_ExecuteUbergraph_W_MilestonesTabEntry;

// Function W_MilestonesTabEntry.W_MilestonesTabEntry_C.SetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct W_MilestonesTabEntry_C_SetIsSelected final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MilestonesTabEntry_C_SetIsSelected;

// Function W_MilestonesTabEntry.W_MilestonesTabEntry_C.SetMilestonesTreeName
// 0x0020 (0x0020 - 0x0000)
struct W_MilestonesTabEntry_C_SetMilestonesTreeName final
{
public:
	class FName                                   Milestones_Tree_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Custom_Tool_Tip_String;                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_MilestonesTabEntry_C_SetMilestonesTreeName;

}

