#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MilestonesTabEntry

#include "Basic.hpp"

#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MilestonesTabEntry.W_MilestonesTabEntry_C
// 0x0030 (0x03A8 - 0x0378)
class UW_MilestonesTabEntry_C final : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_3;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButtonWidget*                    SkillTreeMenuButton;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FName MilestonesTree)> OnClicked;                            // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   Milestones_Tree;                                   // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_MilestonesTabEntry_SkillTreeMenuButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_W_MilestonesTabEntry(int32 EntryPoint);
	void SetIsSelected(bool bSelected);
	void SetMilestonesTreeName(class FName Milestones_Tree_0, class UTexture2D* Texture, const class FText& Custom_Tool_Tip_String);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MilestonesTabEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MilestonesTabEntry_C")
	}
	static class UW_MilestonesTabEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MilestonesTabEntry_C>();
	}
};
DUMPER7_ASSERTS_UW_MilestonesTabEntry_C;

}

