#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ProceduralLineSkill

#include "Basic.hpp"

#include "ShooterGame_structs.hpp"
#include "ShooterGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ProceduralLineSkill.W_ProceduralLineSkill_C
// 0x0140 (0x04B8 - 0x0378)
class UW_ProceduralLineSkill_C final : public UPrimalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GoToUnlocked;                                      // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GoToReadyToUnlock;                                 // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   FromSkill;                                         // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimalSkill                           Skill_Data;                                        // 0x03A0(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaxRanks;                                          // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAlreadyInitialized;                               // 0x04A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A5[0x3];                                      // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   To_Skill;                                          // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDefaultEnabled;                                   // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviousState;                                     // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_ProceduralLineSkill(int32 EntryPoint);
	void InitSkillLine(struct FPrimalSkill& SkillData, class FName& FromSkill_0, class FName ToSkill);
	void PreConstruct(bool IsDesignTime);
	void RefreshDefaultEnabled();
	void UpdateSkillLine();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ProceduralLineSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ProceduralLineSkill_C")
	}
	static class UW_ProceduralLineSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ProceduralLineSkill_C>();
	}
};
DUMPER7_ASSERTS_UW_ProceduralLineSkill_C;

}

