#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterInteractionBP

#include "Basic.hpp"

#include "NinjaLive_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WaterInteractionBP.WaterInteractionBP_C
// 0x0048 (0x0798 - 0x0750)
class AWaterInteractionBP_C final : public ANinjaLive_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WaterInteractionBP_C;               // 0x0750(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 WaterPlane;                                        // 0x0758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          HasEverRidden;                                     // 0x0760(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget*                   GDF_RT;                                            // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     GDF_Material;                                      // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         GDF_RT_Size;                                       // 0x0778(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ASA_TraceMesh_Size;                                // 0x0780(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckDisable();
	void CheckHalfSize();
	void ExecuteUbergraph_WaterInteractionBP(int32 EntryPoint);
	void LiveActivation(class FName ParamName, double FadeTimeOfBrush, double FadeTimeOfCanvas);
	void LiveFluidParams(double BrushSize);
	void ReceiveBeginPlay();
	void StagePrint(const class FString& Note, const class FString& Name_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WaterInteractionBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaterInteractionBP_C")
	}
	static class AWaterInteractionBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterInteractionBP_C>();
	}
};
DUMPER7_ASSERTS_AWaterInteractionBP_C;

}

