#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeapLance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeapLance.WeapLance_C
// 0x00B8 (0x11C8 - 0x1110)
class AWeapLance_C final : public AShooterWeapon_Melee
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x1118(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ThirdPersonMesh;                                   // 0x1120(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAttacking;                                      // 0x1128(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWantsAttacking;                                   // 0x1129(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112A[0x6];                                     // 0x112A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        PreviousTracePoints;                               // 0x1130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                         HurtList;                                          // 0x1140(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        ClearHurtListTime;                                 // 0x1150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StaminaCostPerSecondWantsAttacking;                // 0x1158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StaminaCostPerSecondIsAttacking;                   // 0x1160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             StartAttackingSound;                               // 0x1168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             StopAttackingSound;                                // 0x1170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DurabilityCostForDismount;                         // 0x1178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastCostDurabilityTime;                            // 0x1180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CostDurabilityInterval;                            // 0x1188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CostDurabilityAmountPerInterval;                   // 0x1190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefaultLanceRot;                                   // 0x1198(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               WantsToAttackLanceRot;                             // 0x11B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool BPForceTPVTargetingAnimation();
	void BPHandleMeleeAttack();
	void BPStopMeleeAttack();
	void DamageActor(class AActor* Victim, struct FHitResult& HitInfo);
	void DidDismountHit();
	void DoPlayStartAttackingSound();
	void DoPlayStopAttackingSound();
	void DoTrace(const struct FVector& Start, const struct FVector& End);
	void DoTraceAttacks();
	void ExecuteUbergraph_WeapLance(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WeapLance_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeapLance_C")
	}
	static class AWeapLance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapLance_C>();
	}
};
DUMPER7_ASSERTS_AWeapLance_C;

}

