#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeapSword_Tek

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WeapSword_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeapSword_Tek.WeapSword_Tek_C
// 0x02A0 (0x13E0 - 0x1140)
class AWeapSword_Tek_C final : public AWeapSword_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WeapSword_Tek_C;                    // 0x1140(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_TekSword_Core1;                                 // 0x1148(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_TekSword_Core;                                  // 0x1150(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LumenSwordMesh2;                                   // 0x1158(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LumenSwordMesh;                                    // 0x1160(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_TekSword_Glow1;                                 // 0x1168(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_TekSword_Glow;                                  // 0x1170(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x1178(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x1180(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio1;                                            // 0x1188(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem2;                                   // 0x1190(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM1P;                                              // 0x1198(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem1;                                   // 0x11A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM3P;                                              // 0x11A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bRepHasAmmo;                                       // 0x11B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B1[0x7];                                     // 0x11B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CharacterElementCostPerHit;                        // 0x11B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GenericStructureSettingsElementCostPerHit;         // 0x11C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                SpecificStructureSettingsElementCostPerHit;        // 0x11C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         SpecificStructureSettings;                         // 0x11D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        ExtraStructureDamageMultiplier;                    // 0x11E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AmmoCostPerSwing;                                  // 0x11F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideWeapon;                                        // 0x11F4(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F5[0x3];                                     // 0x11F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             AttackSound;                                       // 0x11F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseColorTypeParamForParticleSystem;               // 0x1200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1201[0x7];                                     // 0x1201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            WeaponStaticMesh;                                  // 0x1208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponParticleSystem;                              // 0x1210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1218[0x8];                                     // 0x1218(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ThreePMeshTransformOverride;                       // 0x1220(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             OnePMeshTransformOverride;                         // 0x1280(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             FPVWeaponParticleSystemTransformOverride;          // 0x12E0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TPVWeaponParticleSystemTransformOverride;          // 0x1340(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OverrideLoopingIdleAudio;                          // 0x13A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Color_FX;                                          // 0x13A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         TekSwordTrail;                                     // 0x13C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SwordFXColorOverride;                              // 0x13C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideSwordFXColor;                              // 0x13D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AppliedDamageToTarget(class AActor* DamageTarget, double ElementCostMultiplier, int32 DamageIn, bool* bExtraDamage);
	void BPAnimNotifyCustomEvent(class FName CustomEventName, class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const class UAnimNotify* AnimNotifyObject);
	void BPAppliedPrimalItemToWeapon();
	void BPHandleMeleeAttack();
	void BPStartEquippedNotify();
	int32 BPWeaponDealDamage(const struct FHitResult& Impact, const struct FVector& ShootDir, int32 DamageAmount, TSubclassOf<class UDamageType> DamageType, float Impulse);
	void DoAppliedDamageToTarget(class AActor* DamageTarget, double ElementCostMultiplier, int32 DamageIn, bool* bExtraDamage);
	void ExecuteUbergraph_WeapSword_Tek(int32 EntryPoint);
	void NetDoPlayMeleeAttackSound();
	void OnRep_HideWeapon();
	void PlayAttackSound();
	void ReceiveTick(float DeltaSeconds);
	void StartUnequipEvent();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WeapSword_Tek_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeapSword_Tek_C")
	}
	static class AWeapSword_Tek_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapSword_Tek_C>();
	}
};
DUMPER7_ASSERTS_AWeapSword_Tek_C;

}

