#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weap_Torch_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShooterGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weap_Torch_Base.Weap_Torch_Base_C
// 0x0048 (0x1158 - 0x1110)
class AWeap_Torch_Base_C final : public AShooterWeapon_Melee
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 BeltTorchBuff;                                     // 0x1118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bAllowPutOnBelt;                                   // 0x1120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEquipped;                                       // 0x1121(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBeingDestroyed;                                   // 0x1122(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1123[0x5];                                     // 0x1123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NiagaraTime;                                       // 0x1128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeToExtinguish;                                  // 0x1130(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeToRampUp;                                      // 0x1138(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            RampUpCurve;                                       // 0x1140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            ExtinguishCurve;                                   // 0x1148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldTickFire;                                   // 0x1150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPAppliedPrimalItemToWeapon();
	bool BPCanEquip(class AShooterCharacter* ByCharacter);
	void CanUseNiagaraFire(bool* bCanUse);
	void ExecuteUbergraph_Weap_Torch_Base(int32 EntryPoint);
	void FireTick();
	void GetFPVNiagaraFire(class UNiagaraComponent** FPVNiagaraComponent);
	void GetTPVNiagaraFire(class UNiagaraComponent** TPVNiagaraComponent);
	void OnInstigatorSleepingStateChanged();
	void ReceiveBeginPlay();
	void Server_AttemptPutOnBelt();
	void StartSecondaryActionEvent();
	void StartUnequipEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Weap_Torch_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Weap_Torch_Base_C")
	}
	static class AWeap_Torch_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeap_Torch_Base_C>();
	}
};
DUMPER7_ASSERTS_AWeap_Torch_Base_C;

}

