#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldConditions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum WorldConditions.EWorldConditionResultValue
// NumValues: 0x0004
enum class EWorldConditionResultValue : uint8
{
	IsFalse                                  = 0,
	IsTrue                                   = 1,
	Invalid                                  = 2,
	EWorldConditionResultValue_MAX           = 3,
};

// Enum WorldConditions.EWorldConditionOperator
// NumValues: 0x0004
enum class EWorldConditionOperator : uint8
{
	And                                      = 0,
	Or                                       = 1,
	Copy                                     = 2,
	EWorldConditionOperator_MAX              = 3,
};

// Enum WorldConditions.EWorldConditionContextDataType
// NumValues: 0x0003
enum class EWorldConditionContextDataType : uint8
{
	Dynamic                                  = 0,
	Persistent                               = 1,
	EWorldConditionContextDataType_MAX       = 2,
};

// ScriptStruct WorldConditions.WorldConditionQueryDefinition
// 0x0018 (0x0018 - 0x0000)
struct FWorldConditionQueryDefinition final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UWorldConditionSchema>      SchemaClass;                                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FWorldConditionQueryDefinition;

// ScriptStruct WorldConditions.WorldConditionBase
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FWorldConditionBase
{
public:
	uint8                                         Pad_0[0xB];                                        // 0x0000(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         BitPad_B_0 : 2;                                    // 0x000B(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bInvert : 1;                                       // 0x000B(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	EWorldConditionOperator                       Operator;                                          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         NextExpressionDepth;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWorldConditionBase;

// ScriptStruct WorldConditions.WorldConditionQuerySharedDefinition
// 0x0028 (0x0028 - 0x0000)
struct FWorldConditionQuerySharedDefinition final
{
public:
	struct FInstancedStructContainer              Conditions;                                        // 0x0000(0x0010)(NativeAccessSpecifierPrivate)
	TSubclassOf<class UWorldConditionSchema>      SchemaClass;                                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWorldConditionQuerySharedDefinition;

// ScriptStruct WorldConditions.WorldConditionCommonBase
// 0x0000 (0x0010 - 0x0010)
struct FWorldConditionCommonBase final : public FWorldConditionBase
{
};
DUMPER7_ASSERTS_FWorldConditionCommonBase;

// ScriptStruct WorldConditions.WorldConditionCommonActorBase
// 0x0000 (0x0010 - 0x0010)
struct FWorldConditionCommonActorBase final : public FWorldConditionBase
{
};
DUMPER7_ASSERTS_FWorldConditionCommonActorBase;

// ScriptStruct WorldConditions.WorldConditionEditable
// 0x0001 (0x0001 - 0x0000)
struct FWorldConditionEditable final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWorldConditionEditable;

// ScriptStruct WorldConditions.WorldConditionItem
// 0x0003 (0x0003 - 0x0000)
struct FWorldConditionItem final
{
public:
	uint8                                         Pad_0[0x3];                                        // 0x0000(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWorldConditionItem;

// ScriptStruct WorldConditions.WorldConditionStateObject
// 0x0008 (0x0008 - 0x0000)
struct FWorldConditionStateObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FWorldConditionStateObject;

// ScriptStruct WorldConditions.WorldConditionQueryState
// 0x0030 (0x0030 - 0x0000)
struct FWorldConditionQueryState final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Owner;                                             // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, ExperimentalNeverOverriden)
};
DUMPER7_ASSERTS_FWorldConditionQueryState;

// ScriptStruct WorldConditions.WorldConditionQuery
// 0x0048 (0x0048 - 0x0000)
struct FWorldConditionQuery final
{
public:
	struct FWorldConditionQueryDefinition         QueryDefinition;                                   // 0x0000(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FWorldConditionQueryState              QueryState;                                        // 0x0018(0x0030)(Transient, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FWorldConditionQuery;

// ScriptStruct WorldConditions.WorldConditionResult
// 0x0002 (0x0002 - 0x0000)
struct FWorldConditionResult final
{
public:
	EWorldConditionResultValue                    Value;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanBeCached;                                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWorldConditionResult;

// ScriptStruct WorldConditions.WorldConditionContextDataDesc
// 0x0018 (0x0018 - 0x0000)
struct FWorldConditionContextDataDesc final
{
public:
	class UStruct*                                Struct;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, ExperimentalNeverOverriden)
	class FName                                   Name;                                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWorldConditionContextDataType                Type;                                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWorldConditionContextDataDesc;

// ScriptStruct WorldConditions.WorldConditionContextDataRef
// 0x000C (0x000C - 0x0000)
struct FWorldConditionContextDataRef final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Index;                                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWorldConditionContextDataRef;

}

