#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZoneGraph

#include "Basic.hpp"

#include "ZoneGraph_structs.hpp"


namespace SDK::Params
{

// Function ZoneGraph.ZoneShapeComponent.SetPolygonRoutingType
// 0x0001 (0x0001 - 0x0000)
struct ZoneShapeComponent_SetPolygonRoutingType final
{
public:
	EZoneShapePolygonRoutingType                  NewType;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneShapeComponent_SetPolygonRoutingType;

// Function ZoneGraph.ZoneShapeComponent.SetReverseLaneProfile
// 0x0002 (0x0002 - 0x0000)
struct ZoneShapeComponent_SetReverseLaneProfile final
{
public:
	bool                                          bReverse;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneShapeComponent_SetReverseLaneProfile;

// Function ZoneGraph.ZoneShapeComponent.SetShapeType
// 0x0001 (0x0001 - 0x0000)
struct ZoneShapeComponent_SetShapeType final
{
public:
	EFZoneShapeType                               Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneShapeComponent_SetShapeType;

// Function ZoneGraph.ZoneShapeComponent.SetTags
// 0x0004 (0x0004 - 0x0000)
struct ZoneShapeComponent_SetTags final
{
public:
	struct FZoneGraphTagMask                      NewTags;                                           // 0x0000(0x0004)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneShapeComponent_SetTags;

// Function ZoneGraph.ZoneShapeComponent.GetShapeType
// 0x0001 (0x0001 - 0x0000)
struct ZoneShapeComponent_GetShapeType final
{
public:
	EFZoneShapeType                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneShapeComponent_GetShapeType;

// Function ZoneGraph.ZoneShapeComponent.GetTags
// 0x0004 (0x0004 - 0x0000)
struct ZoneShapeComponent_GetTags final
{
public:
	struct FZoneGraphTagMask                      ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneShapeComponent_GetTags;

// Function ZoneGraph.ZoneShapeComponent.IsLaneProfileReversed
// 0x0001 (0x0001 - 0x0000)
struct ZoneShapeComponent_IsLaneProfileReversed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneShapeComponent_IsLaneProfileReversed;

}

