#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZoneGraphAnnotations

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "ZoneGraphAnnotations_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ZoneGraph_structs.hpp"


namespace SDK
{

// Class ZoneGraphAnnotations.ZoneGraphAnnotationComponent
// 0x0020 (0x0670 - 0x0650)
#pragma pack(push, 0x1)
class alignas(0x10) UZoneGraphAnnotationComponent : public UDebugDrawComponent
{
public:
	uint8                                         Pad_648[0x18];                                     // 0x0648(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableDebugDrawing;                               // 0x0660(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneGraphAnnotationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZoneGraphAnnotationComponent")
	}
	static class UZoneGraphAnnotationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UZoneGraphAnnotationComponent;

// Class ZoneGraphAnnotations.ZoneGraphAnnotationSubsystem
// 0x0070 (0x00B0 - 0x0040)
class UZoneGraphAnnotationSubsystem final : public UTickableWorldSubsystem
{
public:
	TArray<struct FRegisteredZoneGraphAnnotation> RegisteredComponents;                              // 0x0040(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FInstancedStructContainer              Events[0x2];                                       // 0x0050(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UZoneGraphAnnotationComponent*>  TagToAnnotationLookup;                             // 0x0078(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_88[0x28];                                      // 0x0088(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneGraphAnnotationSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZoneGraphAnnotationSubsystem")
	}
	static class UZoneGraphAnnotationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationSubsystem>();
	}
};
DUMPER7_ASSERTS_UZoneGraphAnnotationSubsystem;

// Class ZoneGraphAnnotations.ZoneGraphAnnotationTest
// 0x0008 (0x0030 - 0x0028)
class UZoneGraphAnnotationTest : public UObject
{
public:
	class UZoneGraphAnnotationTestingComponent*   OwnerComponent;                                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneGraphAnnotationTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZoneGraphAnnotationTest")
	}
	static class UZoneGraphAnnotationTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationTest>();
	}
};
DUMPER7_ASSERTS_UZoneGraphAnnotationTest;

// Class ZoneGraphAnnotations.ZoneGraphAnnotationTestingComponent
// 0x0010 (0x0660 - 0x0650)
class UZoneGraphAnnotationTestingComponent final : public UDebugDrawComponent
{
public:
	TArray<class UZoneGraphAnnotationTest*>       Tests;                                             // 0x0648(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)
	uint8                                         Pad_658[0x8];                                      // 0x0658(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneGraphAnnotationTestingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZoneGraphAnnotationTestingComponent")
	}
	static class UZoneGraphAnnotationTestingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphAnnotationTestingComponent>();
	}
};
DUMPER7_ASSERTS_UZoneGraphAnnotationTestingComponent;

// Class ZoneGraphAnnotations.ZoneGraphAnnotationTestingActor
// 0x0008 (0x0488 - 0x0480)
class AZoneGraphAnnotationTestingActor final : public AActor
{
public:
	class UZoneGraphAnnotationTestingComponent*   TestingComp;                                       // 0x0480(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	void Trigger();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneGraphAnnotationTestingActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZoneGraphAnnotationTestingActor")
	}
	static class AZoneGraphAnnotationTestingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZoneGraphAnnotationTestingActor>();
	}
};
DUMPER7_ASSERTS_AZoneGraphAnnotationTestingActor;

// Class ZoneGraphAnnotations.ZoneGraphDisturbanceAnnotation
// 0x0060 (0x06D0 - 0x0670)
class UZoneGraphDisturbanceAnnotation final : public UZoneGraphAnnotationComponent
{
public:
	struct FZoneGraphTag                          DangerAnnotationTag;                               // 0x0668(0x0001)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneGraphTag                          ObstacleAnnotationTag;                             // 0x0669(0x0001)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_66A[0x2];                                      // 0x066A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneGraphTagFilter                    AffectedLaneTags;                                  // 0x066C(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphTagFilter                    EscapeLaneTags;                                    // 0x0678(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         IdealSpanLength;                                   // 0x0684(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_688[0x40];                                     // 0x0688(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UZoneGraphSubsystem*                    ZoneGraphSubsystem;                                // 0x06C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, ExperimentalNeverOverriden)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneGraphDisturbanceAnnotation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZoneGraphDisturbanceAnnotation")
	}
	static class UZoneGraphDisturbanceAnnotation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphDisturbanceAnnotation>();
	}
};
DUMPER7_ASSERTS_UZoneGraphDisturbanceAnnotation;

// Class ZoneGraphAnnotations.ZoneGraphDisturbanceAnnotationTest
// 0x0020 (0x0050 - 0x0030)
class UZoneGraphDisturbanceAnnotationTest final : public UZoneGraphAnnotationTest
{
public:
	struct FVector                                Offset;                                            // 0x0030(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Duration;                                          // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DangerRadius;                                      // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneGraphDisturbanceAnnotationTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZoneGraphDisturbanceAnnotationTest")
	}
	static class UZoneGraphDisturbanceAnnotationTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphDisturbanceAnnotationTest>();
	}
};
DUMPER7_ASSERTS_UZoneGraphDisturbanceAnnotationTest;

// Class ZoneGraphAnnotations.ZoneGraphDisturbanceAnnotationBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UZoneGraphDisturbanceAnnotationBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void TriggerDanger(class UObject* WorldContextObject, const class AActor* Instigator, const struct FVector& position, const float Radius, const float Duration);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneGraphDisturbanceAnnotationBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZoneGraphDisturbanceAnnotationBPLibrary")
	}
	static class UZoneGraphDisturbanceAnnotationBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphDisturbanceAnnotationBPLibrary>();
	}
};
DUMPER7_ASSERTS_UZoneGraphDisturbanceAnnotationBPLibrary;

}

